MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
When the compilation flag USE_HAL_ADC_REGISTER_CALLBACKS is set to 0 or not defined,
the callback registration feature is not available and all callbacks are set to the corresponding weak functions.

  */

/**
  * @}
  */

/** @defgroup ADC_Configuration_Table ADC Configuration Table
  * @{

## Configuration inside the ADC driver

Config defines                  | Description           | Default value | Note
------------------------------- | --------------------- | ------------- | --------------------------------------------
USE_HAL_ADC_MODULE              | from hal_conf.h       | 1  | When set, HAL ADC module is enabled
USE_HAL_ADC_DMA                 | from hal_conf.h       | 1  | Enable DMA code inside ADC
USE_HAL_ADC_REGISTER_CALLBACKS  | from hal_conf.h       | 0  | When defined, enable the register callbacks assert
USE_HAL_ADC_CLK_ENABLE_MODEL    | from hal_conf.h       | HAL_CLK_ENABLE_NO | Enable gating of the peripheral clock
USE_HAL_CHECK_PARAM             | from hal_conf.h       | 0  | Parameters (pointers or sizes) are checked in runtime
USE_HAL_CHECK_PROCESS_STATE     | from hal_conf.h       | 0  | When set, enable atomic access to process state check
USE_ASSERT_DBG_PARAM            | from PreProcessor env | None | When defined, enable the params assert
USE_ASSERT_DBG_STATE            | from PreProcessor env | None | When defined, enable the state assert
ADC_INST_IN_COMMON_COUNT        | from CMSIS | None | When defined and value > 2, multiple ADC handles can be linked
ADC_MULTIMODE_SUPPORT           | from CMSIS | None | When defined, multimode features available
  */
/**
  * @}
  */

/* Private constants -------------------------------------------------------------------------------------------------*/
/** @defgroup ADC_Private_Constants ADC Private Constants
  * @{
  */

/* Definition of HAL ADC handle table "group_state" indexes */
#define ADC_GROUP_REGULAR               ((uint8_t)HAL_ADC_GROUP_REGULAR - 1U)  /*!< ADC group regular index
                                        in HAL ADC handle table "group_state" */
#define ADC_GROUP_INJECTED              ((uint8_t)HAL_ADC_GROUP_INJECTED - 1U) /*!< ADC group injected index
                                        in HAL ADC handle table "group_state" */

#if defined(ADC_MULTIMODE_SUPPORT)
/* Definition of HAL ADC handle table "common" indexes
   Multimode ADC instances on this STM32 series: ADC1 and ADC2. */
#define ADC_MM_INDEX_MASTER             (0U) /*!< Multimode ADC instance master index
                                        in HAL ADC handle table "common" */
#define ADC_MM_INDEX_SLAVE              (1U) /*!< Multimode ADC instance slave index
                                        in HAL ADC handle table "common" */
#define ADC_MM_INST_COUNT               (2U) /*!< Multimode ADC instances count */
#endif /* ADC_MULTIMODE_SUPPORT */

#define ADC_GAIN_COMPENSATION_VAL_UNIT  (1000UL) /*!< HAL ADC gain compensation value corresponding to unitary gain */

/* Delay values for ADC operation */
#define ADC_DELAY_CALIB_ENABLE_CPU_CYCLES  (LL_ADC_DELAY_CALIB_ENABLE_ADC_CYCLES * 32U) /*!< Delay between ADC end of
                                        calibration and ADC enable. Delay estimation in CPU cycles: Case of ADC enable
                                        done immediately after ADC calibration, ADC clock setting slow (presc 32). */

/* Timeout values for ADC operations (enable settling time,                   */
/*   disable settling time, ...).                                             */
/*   Values defined to be higher than worst cases: low clock frequency,       */
/*   maximum prescalers.                                                      */
#define ADC_ENABLE_TIMEOUT_MS           (2UL) /*!< ADC enable timeout value (unit: milliseconds) */
#define ADC_DISABLE_TIMEOUT_MS          (2UL) /*!< ADC disable timeout value (unit: milliseconds) */
#define ADC_CONV_STOP_TIMEOUT_MS        (2UL) /*!< ADC conversion stop timeout value (unit: milliseconds) */

/* Timeout value for ADC calibration.                                         */
/* Refer to datasheet params "tCAL" and "fADC":                               */
/* Calibration time typ = tCAL / fADC                                         */
/* Calibration time max = tCAL max / fADC min = 31849 / 0.14 = 228ms          */
#define ADC_CALIBRATION_TIMEOUT_MS      (228UL) /*!< ADC calibration timeout value (unit: milliseconds) */

/**
  * @}
  */

/* Private macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup ADC_Private_Macros ADC Private Macros
  * @{
  */

/*! Get ADC instance from the selected HAL ADC handle */
#define ADC_GET_INSTANCE(hadc) ((ADC_TypeDef *)((uint32_t)(hadc)->instance))

/*! Convert HAL ADC group (hal_adc_group_t) to group state (hal_adc_group_state_t) */
#define ADC_GROUP_TO_STATE(group) ((hal_adc_group_state_t)(((uint32_t)group) - 1U))

/**
  * @brief Wait for approximate delay in us.
  * @param delay_us Delay to wait for (unit: us)
  * @note  Compute number of CPU cycles to wait for, using CMSIS global variable "SystemCoreClock".
  * @note  Delay is approximate (depends on compilation optimization).
  * @note  Computation: variable is divided by 2 to compensate partially CPU processing cycles of wait loop
  *        (total shift right of 21 bits, including conversion from frequency in MHz).
  *        If system core clock frequency is below 500kHz, delay is fulfilled by few CPU processing cycles.
  */
#define ADC_DELAY_US(delay_us) \
  do { \
    volatile uint32_t wait_loop_index = (((delay_us) * (SystemCoreClock >> 19U)) >> 2U); \
    while (wait_loop_index != 0U) { \
      wait_loop_index--; \
    } \
  } while(0)

/**
  * @brief IS_ADC macro assert definitions
  * @{
  */
/*! Assert definitions of ADC resolution parameters */
#define IS_ADC_RESOLUTION(resolution) (((resolution) == HAL_ADC_RESOLUTION_12_BIT) \
                                       || ((resolution) == HAL_ADC_RESOLUTION_10_BIT) \
                                       || ((resolution) == HAL_ADC_RESOLUTION_8_BIT) \
                                       || ((resolution) == HAL_ADC_RESOLUTION_6_BIT))

/*! Assert definitions of ADC trigger frequency mode */
#define IS_ADC_TRIGGER_FREQ_MODE(trigger_freq_mode) (((trigger_freq_mode) == HAL_ADC_TRIGGER_FREQ_HIGH) \
                                                     || ((trigger_freq_mode) == HAL_ADC_TRIGGER_FREQ_LOW))

/*! Assert definitions of ADC sampling mode */
#define IS_ADC_SAMPLING_MODE(sampling_mode) (((sampling_mode) == HAL_ADC_SAMPLING_MODE_NORMAL) \
                                             || ((sampling_mode) == HAL_ADC_SAMPLING_MODE_BULB) \
                                             || ((sampling_mode) == HAL_ADC_SAMPLING_MODE_TRIGGER_CTRL))

/*! Assert definitions of ADC group */
#define IS_ADC_GROUP(group) (((group) == HAL_ADC_GROUP_REGULAR) \
                             || ((group) == HAL_ADC_GROUP_INJECTED) \
                             || ((group) == HAL_ADC_GROUP_REGULAR_INJECTED) \
                             || ((group) == HAL_ADC_GROUP_NONE))

/*! Assert definitions of ADC group regular conversion trigger source (ADC instance specific) */
#if defined(STM32C591xx) || defined(STM32C593xx) || defined(STM32C5A3xx)
#define IS_ADC_REG_TRIGGER_SRC_ADC123(trigger_src)  (((trigger_src) == HAL_ADC_REG_TRIG_SOFTWARE) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_EXTI11) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM1_OC1) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM1_OC2) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM1_OC3) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM1_TRGO) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM1_TRGO2) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM2_OC2) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM2_TRGO) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM3_OC4) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM3_TRGO) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM4_TRGO) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM4_OC4) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM5_OC4) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM5_TRGO) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM6_TRGO) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM8_TRGO) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM8_TRGO2) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM15_TRGO) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_LPTIM1_OC1))
#else
#define IS_ADC_REG_TRIGGER_SRC_ADC123(trigger_src)  (((trigger_src) == HAL_ADC_REG_TRIG_SOFTWARE) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_EXTI11) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM1_OC1) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM1_OC2) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM1_OC3) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM1_TRGO) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM1_TRGO2) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM2_OC2) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM2_TRGO) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM5_OC4) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM5_TRGO) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM6_TRGO) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM8_TRGO) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM8_TRGO2) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_TIM15_TRGO) \
                                                     || ((trigger_src) == HAL_ADC_REG_TRIG_LPTIM1_OC1))
#endif /* STM32C591xx, STM32C593xx, STM32C5A3xx */

