MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
/*! Assert definitions of ADC group regular conversion trigger source */
#define IS_ADC_REG_TRIGGER_SRC(instance, trigger_src) (IS_ADC_REG_TRIGGER_SRC_ADC123(trigger_src))


/*! Assert definitions of ADC group regular conversion trigger edge */
#define IS_ADC_REG_TRIGGER_EDGE(trigger_edge) (((trigger_edge) == HAL_ADC_REG_TRIG_EDGE_NONE) \
                                               || ((trigger_edge) == HAL_ADC_REG_TRIG_EDGE_RISING) \
                                               || ((trigger_edge) == HAL_ADC_REG_TRIG_EDGE_FALLING) \
                                               || ((trigger_edge) == HAL_ADC_REG_TRIG_EDGE_RISING_FALLING))

/*! Assert definitions of ADC group regular sequencer length */
#define IS_ADC_REG_SEQUENCER_LENGTH(sequencer_length) ((1U <= (sequencer_length)) && ((sequencer_length) <= 16U))

/*! Assert definitions of ADC group regular sequencer discontinuous mode */
#define IS_ADC_REG_SEQ_DISCONT(sequencer_discont) (((sequencer_discont) == HAL_ADC_REG_SEQ_DISCONT_DISABLE) \
                                                   || ((sequencer_discont) == HAL_ADC_REG_SEQ_DISCONT_1RANK) \
                                                   || ((sequencer_discont) == HAL_ADC_REG_SEQ_DISCONT_2RANKS) \
                                                   || ((sequencer_discont) == HAL_ADC_REG_SEQ_DISCONT_3RANKS) \
                                                   || ((sequencer_discont) == HAL_ADC_REG_SEQ_DISCONT_4RANKS) \
                                                   || ((sequencer_discont) == HAL_ADC_REG_SEQ_DISCONT_5RANKS) \
                                                   || ((sequencer_discont) == HAL_ADC_REG_SEQ_DISCONT_6RANKS) \
                                                   || ((sequencer_discont) == HAL_ADC_REG_SEQ_DISCONT_7RANKS) \
                                                   || ((sequencer_discont) == HAL_ADC_REG_SEQ_DISCONT_8RANKS))

/*! Assert definitions of ADC group regular continuous mode */
#define IS_ADC_REG_CONTINUOUS_MODE(continuous) (((continuous) == HAL_ADC_REG_CONV_SINGLE) \
                                                || ((continuous) == HAL_ADC_REG_CONV_CONTINUOUS))

/*! Assert definitions of ADC group regular overrun mode */
#define IS_ADC_REG_OVERRUN_MODE(overrun) (((overrun) == HAL_ADC_REG_OVR_DATA_PRESERVED) \
                                          || ((overrun) == HAL_ADC_REG_OVR_DATA_OVERWRITTEN))

/*! Assert definitions of ADC group injected conversion trigger source (ADC instance specific) */
#if defined(STM32C591xx) || defined(STM32C593xx) || defined(STM32C5A3xx)
#define IS_ADC_INJ_TRIGGER_SRC_ADC12(trigger_src)  (((trigger_src) == HAL_ADC_INJ_TRIG_SOFTWARE) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_EXTI15) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM1_OC4) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM1_TRGO) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM1_TRGO2) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM2_OC1) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM2_TRGO) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM3_TRGO) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM3_OC1) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM3_OC3) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM4_TRGO) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM5_OC1) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM5_OC2) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM5_OC3) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM5_TRGO) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM7_TRGO) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM8_OC4) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM8_TRGO) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM8_TRGO2) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM8_TRGO) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM12_TRGO) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM15_TRGO) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_LPTIM1_OC1) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_FROM_REGULAR))
#else
#define IS_ADC_INJ_TRIGGER_SRC_ADC12(trigger_src)  (((trigger_src) == HAL_ADC_INJ_TRIG_SOFTWARE) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_EXTI15) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM1_OC4) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM1_TRGO) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM1_TRGO2) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM2_OC1) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM2_TRGO) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM5_OC1) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM5_OC2) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM5_OC3) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM5_TRGO) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM7_TRGO) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM8_OC4) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM8_TRGO) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM8_TRGO2) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM8_TRGO) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM12_TRGO) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_TIM15_TRGO) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_LPTIM1_OC1) \
                                                    || ((trigger_src) == HAL_ADC_INJ_TRIG_FROM_REGULAR))
#endif /* STM32C591xx, STM32C593xx, STM32C5A3xx */

/*! Assert definitions of ADC group injected conversion trigger source */
#define IS_ADC_INJ_TRIGGER_SRC(instance, trigger_src) (IS_ADC_INJ_TRIGGER_SRC_ADC12(trigger_src))

/*! Assert definitions of ADC group injected conversion trigger edge */
#define IS_ADC_INJ_TRIGGER_EDGE(trigger_edge) (((trigger_edge) == HAL_ADC_INJ_TRIG_EDGE_NONE) \
                                               || ((trigger_edge) == HAL_ADC_INJ_TRIG_EDGE_RISING) \
                                               || ((trigger_edge) == HAL_ADC_INJ_TRIG_EDGE_FALLING) \
                                               || ((trigger_edge) == HAL_ADC_INJ_TRIG_EDGE_RISING_FALLING))

/*! Assert definitions of ADC group injected sequencer length */
#define IS_ADC_INJ_SEQUENCER_LENGTH(sequencer_length) ((1U <= (sequencer_length)) && ((sequencer_length) <= 4U))

