MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
/*! Assert definitions of ADC group injected sequencer discontinuous mode */
#define IS_ADC_INJ_SEQ_DISCONT(sequencer_discont) (((sequencer_discont) == HAL_ADC_INJ_SEQ_DISCONT_DISABLE) \
                                                   || ((sequencer_discont) == HAL_ADC_INJ_SEQ_DISCONT_1RANK))

/*! Assert definitions of ADC channel (specific ADC1) */
#define IS_ADC_CHANNEL_ADC1(channel) (((channel) == HAL_ADC_CHANNEL_0) \
                                      || ((channel) == HAL_ADC_CHANNEL_1) \
                                      || ((channel) == HAL_ADC_CHANNEL_2) \
                                      || ((channel) == HAL_ADC_CHANNEL_3) \
                                      || ((channel) == HAL_ADC_CHANNEL_4) \
                                      || ((channel) == HAL_ADC_CHANNEL_5) \
                                      || ((channel) == HAL_ADC_CHANNEL_6) \
                                      || ((channel) == HAL_ADC_CHANNEL_7) \
                                      || ((channel) == HAL_ADC_CHANNEL_8) \
                                      || ((channel) == HAL_ADC_CHANNEL_9) \
                                      || ((channel) == HAL_ADC_CHANNEL_10) \
                                      || ((channel) == HAL_ADC_CHANNEL_11) \
                                      || ((channel) == HAL_ADC_CHANNEL_12) \
                                      || ((channel) == HAL_ADC_CHANNEL_13) \
                                      || ((channel) == HAL_ADC_CHANNEL_VREFINT) \
                                      || ((channel) == HAL_ADC_CHANNEL_TEMPSENSOR) \
                                      || ((channel) == HAL_ADC_CHANNEL_NONE) \
                                      || ((channel) == HAL_ADC_CHANNEL_ALL))

#if defined(ADC2)
/*! Assert definitions of ADC channel (specific ADC2) */
#define IS_ADC_CHANNEL_ADC2(channel) (((channel) == HAL_ADC_CHANNEL_0) \
                                      || ((channel) == HAL_ADC_CHANNEL_1) \
                                      || ((channel) == HAL_ADC_CHANNEL_2) \
                                      || ((channel) == HAL_ADC_CHANNEL_3) \
                                      || ((channel) == HAL_ADC_CHANNEL_4) \
                                      || ((channel) == HAL_ADC_CHANNEL_5) \
                                      || ((channel) == HAL_ADC_CHANNEL_6) \
                                      || ((channel) == HAL_ADC_CHANNEL_7) \
                                      || ((channel) == HAL_ADC_CHANNEL_8) \
                                      || ((channel) == HAL_ADC_CHANNEL_9) \
                                      || ((channel) == HAL_ADC_CHANNEL_10) \
                                      || ((channel) == HAL_ADC_CHANNEL_11) \
                                      || ((channel) == HAL_ADC_CHANNEL_12) \
                                      || ((channel) == HAL_ADC_CHANNEL_13) \
                                      || ((channel) == HAL_ADC_CHANNEL_NONE) \
                                      || ((channel) == HAL_ADC_CHANNEL_ALL))
#endif /* ADC2 */

#if defined(ADC3)
/*! Assert definitions of ADC channel (specific ADC3) */
#define IS_ADC_CHANNEL_ADC3(channel) (((channel) == HAL_ADC_CHANNEL_0) \
                                      || ((channel) == HAL_ADC_CHANNEL_1) \
                                      || ((channel) == HAL_ADC_CHANNEL_2) \
                                      || ((channel) == HAL_ADC_CHANNEL_3) \
                                      || ((channel) == HAL_ADC_CHANNEL_4) \
                                      || ((channel) == HAL_ADC_CHANNEL_5) \
                                      || ((channel) == HAL_ADC_CHANNEL_6) \
                                      || ((channel) == HAL_ADC_CHANNEL_7) \
                                      || ((channel) == HAL_ADC_CHANNEL_8) \
                                      || ((channel) == HAL_ADC_CHANNEL_9) \
                                      || ((channel) == HAL_ADC_CHANNEL_10) \
                                      || ((channel) == HAL_ADC_CHANNEL_11) \
                                      || ((channel) == HAL_ADC_CHANNEL_12) \
                                      || ((channel) == HAL_ADC_CHANNEL_13) \
                                      || ((channel) == HAL_ADC_CHANNEL_NONE) \
                                      || ((channel) == HAL_ADC_CHANNEL_ALL))
#endif /* ADC3 */

/*! Assert definitions of ADC channel */
#if defined(ADC3)
#define IS_ADC_CHANNEL(instance, channel)  (((instance) == HAL_ADC1) ? IS_ADC_CHANNEL_ADC1(channel) : \
                                            ((instance) == HAL_ADC2) ? IS_ADC_CHANNEL_ADC2(channel) : \
                                            IS_ADC_CHANNEL_ADC3(channel))
#elif defined(ADC2)
#define IS_ADC_CHANNEL(instance, channel) (((instance) == HAL_ADC2) ? \
                                           IS_ADC_CHANNEL_ADC2(channel) :\
                                           IS_ADC_CHANNEL_ADC1(channel))
#else
#define IS_ADC_CHANNEL(instance, channel) (IS_ADC_CHANNEL_ADC1(channel))
#endif /* ADC2 */

/*! Assert definitions of ADC sampling time */
#define IS_ADC_SAMPLING_TIME(sampling_time) (((sampling_time) ==  HAL_ADC_SAMPLING_TIME_3CYCLES) \
                                             || ((sampling_time) ==  HAL_ADC_SAMPLING_TIME_5CYCLES) \
                                             || ((sampling_time) ==  HAL_ADC_SAMPLING_TIME_8CYCLES) \
                                             || ((sampling_time) ==  HAL_ADC_SAMPLING_TIME_13CYCLES) \
                                             || ((sampling_time) ==  HAL_ADC_SAMPLING_TIME_25CYCLES) \
                                             || ((sampling_time) ==  HAL_ADC_SAMPLING_TIME_48CYCLES) \
                                             || ((sampling_time) ==  HAL_ADC_SAMPLING_TIME_139CYCLES) \
                                             || ((sampling_time) ==  HAL_ADC_SAMPLING_TIME_289CYCLES))

/*! Assert definitions of ADC channel ending mode */
#define IS_ADC_CHANNEL_INPUT_MODE(input_mode) ((input_mode) == HAL_ADC_IN_SINGLE_ENDED)


/*! Assert definitions of ADC multimode mode */
#define IS_ADC_MM_MODE(mode) (((mode) == HAL_ADC_MM_INDEPENDENT) \
                              || ((mode) == HAL_ADC_MM_DUAL_REG_SIMULT) \
                              || ((mode) == HAL_ADC_MM_DUAL_REG_INTERL) \
                              || ((mode) == HAL_ADC_MM_DUAL_INJ_SIMULT) \
                              || ((mode) == HAL_ADC_MM_DUAL_INJ_ALTERN) \
                              || ((mode) == HAL_ADC_MM_DUAL_REG_SIM_INJ_SIM) \
                              || ((mode) == HAL_ADC_MM_DUAL_REG_SIM_INJ_ALT) \
                              || ((mode) == HAL_ADC_MM_DUAL_REG_INT_INJ_SIM))

/*! Assert definitions of ADC multimode data format */
#define IS_ADC_MM_REG_DATA_FORMAT(reg_data_format) (((reg_data_format) == HAL_ADC_MM_REG_DATA_EACH_ADC) \
                                                    || ((reg_data_format) == HAL_ADC_MM_REG_DATA_PACK_32_BITS) \
                                                    || ((reg_data_format) == HAL_ADC_MM_REG_DATA_PACK_16_BITS))

/*! Assert definitions of ADC multimode data format */
#define IS_ADC_MM_REG_DATA_TRANSFER_PACKING(reg_data_transfer) \
  (((reg_data_transfer) == HAL_ADC_MM_REG_DATA_TRANSFER_PACK) \
   || ((reg_data_transfer) == HAL_ADC_MM_REG_DATA_TRANSFER_UNPACK))

/*! Assert definitions of ADC multimode interleaved delay */
#define IS_ADC_MM_INTERL_DELAY(interl_delay) (((interl_delay) == HAL_ADC_MM_INTERL_DELAY_1CYCLE) \
                                              || ((interl_delay) == HAL_ADC_MM_INTERL_DELAY_2CYCLES) \
                                              || ((interl_delay) == HAL_ADC_MM_INTERL_DELAY_3CYCLES) \
                                              || ((interl_delay) == HAL_ADC_MM_INTERL_DELAY_4CYCLES) \
                                              || ((interl_delay) == HAL_ADC_MM_INTERL_DELAY_5CYCLES) \
                                              || ((interl_delay) == HAL_ADC_MM_INTERL_DELAY_6CYCLES) \
                                              || ((interl_delay) == HAL_ADC_MM_INTERL_DELAY_7CYCLES) \
                                              || ((interl_delay) == HAL_ADC_MM_INTERL_DELAY_8CYCLES) \
                                              || ((interl_delay) == HAL_ADC_MM_INTERL_DELAY_9CYCLES) \
                                              || ((interl_delay) == HAL_ADC_MM_INTERL_DELAY_10CYCLES) \
                                              || ((interl_delay) == HAL_ADC_MM_INTERL_DELAY_11CYCLES) \
                                              || ((interl_delay) == HAL_ADC_MM_INTERL_DELAY_12CYCLES) \
                                              || ((interl_delay) == HAL_ADC_MM_INTERL_DELAY_13CYCLES))

/*! Assert definitions of ADC data shift left */
#define IS_ADC_LEFT_BIT_SHIFT(left_bit_shift) (((left_bit_shift) == HAL_ADC_LEFT_BIT_SHIFT_NONE) \
                                               || ((left_bit_shift) == HAL_ADC_LEFT_BIT_SHIFT_1_BIT) \
                                               || ((left_bit_shift) == HAL_ADC_LEFT_BIT_SHIFT_2_BITS) \
                                               || ((left_bit_shift) == HAL_ADC_LEFT_BIT_SHIFT_3_BITS) \
                                               || ((left_bit_shift) == HAL_ADC_LEFT_BIT_SHIFT_4_BITS) \
                                               || ((left_bit_shift) == HAL_ADC_LEFT_BIT_SHIFT_5_BITS) \
                                               || ((left_bit_shift) == HAL_ADC_LEFT_BIT_SHIFT_6_BITS) \
                                               || ((left_bit_shift) == HAL_ADC_LEFT_BIT_SHIFT_7_BITS) \
                                               || ((left_bit_shift) == HAL_ADC_LEFT_BIT_SHIFT_8_BITS) \
                                               || ((left_bit_shift) == HAL_ADC_LEFT_BIT_SHIFT_9_BITS) \
                                               || ((left_bit_shift) == HAL_ADC_LEFT_BIT_SHIFT_10_BITS) \
                                               || ((left_bit_shift) == HAL_ADC_LEFT_BIT_SHIFT_11_BITS) \
                                               || ((left_bit_shift) == HAL_ADC_LEFT_BIT_SHIFT_12_BITS) \
                                               || ((left_bit_shift) == HAL_ADC_LEFT_BIT_SHIFT_13_BITS) \
                                               || ((left_bit_shift) == HAL_ADC_LEFT_BIT_SHIFT_14_BITS) \
                                               || ((left_bit_shift) == HAL_ADC_LEFT_BIT_SHIFT_15_BITS))

