MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
/*! Assert definitions of ADC gain compensation */
#define IS_ADC_GAIN_COMPENSATION(gain_compensation) ((gain_compensation) <= 3999UL)

/*! Assert definitions of ADC low power mode auto wait */
#define IS_ADC_LP_AUTOWAIT(lp_auto_wait) (((lp_auto_wait) == HAL_ADC_LP_AUTO_WAIT_DISABLE) \
                                          || ((lp_auto_wait) == HAL_ADC_LP_AUTO_WAIT_ENABLE))

/*! Assert definitions of ADC analog watchdog instance */
#define IS_ADC_AWD_INSTANCE(awd_instance) (((awd_instance) == HAL_ADC_AWD_1) \
                                           || ((awd_instance) == HAL_ADC_AWD_2) \
                                           || ((awd_instance) == HAL_ADC_AWD_3))

/*! Assert definitions of ADC analog watchdog threshold selection */
#define IS_ADC_AWD_THRESHOLD_SEL(threshold_sel) (((threshold_sel) == HAL_ADC_AWD_THRESHOLD_HIGH) \
                                                 || ((threshold_sel) == HAL_ADC_AWD_THRESHOLD_LOW))

/*! Assert definitions of ADC analog watchdog threshold value */
#define IS_ADC_AWD_THRESHOLD(threshold) (((threshold) >= (0x00400000L * (-1L))) && ((threshold) <= 0x003FFFFFL))

/*! Assert definitions of ADC analog watchdog filtering */
#define IS_ADC_AWD_FILTERING(filtering) (((filtering) == HAL_ADC_AWD_FILTERING_NONE) \
                                         || ((filtering) == HAL_ADC_AWD_FILTERING_2SAMPLES) \
                                         || ((filtering) == HAL_ADC_AWD_FILTERING_3SAMPLES) \
                                         || ((filtering) == HAL_ADC_AWD_FILTERING_4SAMPLES) \
                                         || ((filtering) == HAL_ADC_AWD_FILTERING_5SAMPLES) \
                                         || ((filtering) == HAL_ADC_AWD_FILTERING_6SAMPLES) \
                                         || ((filtering) == HAL_ADC_AWD_FILTERING_7SAMPLES) \
                                         || ((filtering) == HAL_ADC_AWD_FILTERING_8SAMPLES))

/*! Assert definitions of ADC oversampling instance */
#define IS_ADC_OVS_INSTANCE(ovs_instance) ((ovs_instance) == HAL_ADC_OVS_1)

/*! Assert definitions of ADC oversampling scope */
#define IS_ADC_OVS_SCOPE(scope) (((scope) == HAL_ADC_OVS_DISABLE) \
                                 || ((scope) == HAL_ADC_OVS_REG_CONTINUED) \
                                 || ((scope) == HAL_ADC_OVS_REG_RESUMED) \
                                 || ((scope) == HAL_ADC_OVS_INJ) \
                                 || ((scope) == HAL_ADC_OVS_INJ_REG_RESUMED))

/*! Assert definitions of ADC oversampling discontinuous mode */
#define IS_ADC_OVS_DISCONT(discont) (((discont) == HAL_ADC_OVS_CONT) \
                                     || ((discont) == HAL_ADC_OVS_DISCONT))

/*! Assert definitions of ADC oversampling ratio */
#define IS_ADC_OVS_RATIO(ratio) ((1UL <= (ratio)) && ((ratio) <= (1UL << 10U) /* 1024 */))

/*! Assert definitions of ADC oversampling ratio power of 2 */
#define IS_ADC_OVS_RATIO_POW_2(ratio) (((ratio) == (1UL << 0U))     /* 1 */ \
                                       || ((ratio) == (1UL << 1U))  /* 2 */ \
                                       || ((ratio) == (1UL << 2U))  /* 4 */ \
                                       || ((ratio) == (1UL << 3U))  /* 8 */ \
                                       || ((ratio) == (1UL << 4U))  /* 16 */ \
                                       || ((ratio) == (1UL << 5U))  /* 32 */ \
                                       || ((ratio) == (1UL << 6U))  /* 64 */ \
                                       || ((ratio) == (1UL << 7U))  /* 128 */ \
                                       || ((ratio) == (1UL << 8U))  /* 256 */ \
                                       || ((ratio) == (1UL << 9U))  /* 512 */ \
                                       || ((ratio) == (1UL << 10U)))/* 1024 */

/*! Assert definitions of ADC oversampling shift */
#define IS_ADC_OVS_SHIFT(shift) ((shift) <= 11UL)

/*! Assert definitions of ADC offset instance */
#define IS_ADC_OFFSET_INSTANCE(offset_instance) (((offset_instance) == HAL_ADC_OFFSET_1) \
                                                 || ((offset_instance) == HAL_ADC_OFFSET_2) \
                                                 || ((offset_instance) == HAL_ADC_OFFSET_3) \
                                                 || ((offset_instance) == HAL_ADC_OFFSET_4))

/*! Assert definitions of ADC offset level value */
#define IS_ADC_OFFSET_LEVEL(level) (((level) >= (0x003FFFFFL * (-1L))) && ((level) <= 0x003FFFFFL))

/*! Assert definitions of ADC offset signed saturation */
#define IS_ADC_OFFSET_SAT_SIGN(saturation_signed) (((saturation_signed) == HAL_ADC_OFFSET_SAT_SIGNED_DISABLE) \
                                                   || ((saturation_signed) == HAL_ADC_OFFSET_SAT_SIGNED_ENABLE))

/*! Assert definitions of ADC offset unsigned saturation */
#define IS_ADC_OFFSET_SAT_UNSIGN(sat_unsigned) (((sat_unsigned) == HAL_ADC_OFFSET_SAT_UNSIGNED_DISABLE) \
                                                || ((sat_unsigned) == HAL_ADC_OFFSET_SAT_UNSIGNED_ENABLE))

/*! Assert definitions of ADC event */
#define IS_ADC_EVENT(event) (((event) == HAL_ADC_EVENT_EOC) \
                             || ((event) == HAL_ADC_EVENT_EOS) \
                             || ((event) == HAL_ADC_EVENT_OVR) \
                             || ((event) == HAL_ADC_EVENT_EOSMP) \
                             || ((event) == HAL_ADC_EVENT_JEOC) \
                             || ((event) == HAL_ADC_EVENT_JEOS) \
                             || ((event) == HAL_ADC_EVENT_AWD_1) \
                             || ((event) == HAL_ADC_EVENT_AWD_2) \
                             || ((event) == HAL_ADC_EVENT_AWD_3))

/*! Assert configuration of ADC data transfer by DMA in silent mode: DMA must be in circular mode */
#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#define IS_ADC_DMA_VALID_SILENT_MODE(hadc, interrupts) \
  (((interrupts) != HAL_ADC_OPT_DMA_IT_SILENT) || (hadc->hdma_reg->xfer_mode == HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR))
#endif /* USE_HAL_DMA_LINKEDLIST */
#endif /* USE_HAL_ADC_DMA */

/*! Assert definitions of ADC optional interruptions for regular conversions */
#define IS_ADC_OPT_IT_REG(event) (((event) & (HAL_ADC_OPT_IT_NONE \
                                              | HAL_ADC_OPT_IT_REG_EOSMP \
                                              | HAL_ADC_OPT_IT_REG_EOC \
                                              | HAL_ADC_OPT_IT_REG_EOS \
                                              | HAL_ADC_OPT_IT_REG_OVR \
                                              | HAL_ADC_OPT_IT_AWD_1 \
                                              | HAL_ADC_OPT_IT_AWD_2 \
                                              | HAL_ADC_OPT_IT_AWD_3)) == (event))

