MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
/*! Assert definitions of ADC optional interruptions for regular conversions with data transfer by DMA */
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#define IS_ADC_OPT_IT_REG_DMA(event) ((((event) & (HAL_ADC_OPT_IT_NONE \
                                                   | HAL_ADC_OPT_IT_REG_EOSMP \
                                                   | HAL_ADC_OPT_IT_REG_EOC \
                                                   | HAL_ADC_OPT_IT_REG_EOS \
                                                   | HAL_ADC_OPT_IT_REG_OVR \
                                                   | HAL_ADC_OPT_IT_AWD_1 \
                                                   | HAL_ADC_OPT_IT_AWD_2 \
                                                   | HAL_ADC_OPT_IT_AWD_3 \
                                                   | HAL_ADC_OPT_DMA_IT_NONE \
                                                   | HAL_ADC_OPT_DMA_IT_HT \
                                                   | HAL_ADC_OPT_DMA_IT_DEFAULT)) == (event)) \
                                      || ((event) == HAL_ADC_OPT_DMA_IT_SILENT))
#else
#define IS_ADC_OPT_IT_REG_DMA(event) (((event) & (HAL_ADC_OPT_IT_NONE \
                                                  | HAL_ADC_OPT_IT_REG_EOSMP \
                                                  | HAL_ADC_OPT_IT_REG_EOC \
                                                  | HAL_ADC_OPT_IT_REG_EOS \
                                                  | HAL_ADC_OPT_IT_REG_OVR \
                                                  | HAL_ADC_OPT_IT_AWD_1 \
                                                  | HAL_ADC_OPT_IT_AWD_2 \
                                                  | HAL_ADC_OPT_IT_AWD_3 \
                                                  | HAL_ADC_OPT_DMA_IT_NONE \
                                                  | HAL_ADC_OPT_DMA_IT_HT \
                                                  | HAL_ADC_OPT_DMA_IT_DEFAULT)) == (event))
#endif /* USE_HAL_DMA_LINKEDLIST */
#endif /* USE_HAL_ADC_DMA */

/*! Assert definitions of ADC optional interruptions for injected conversions */
#define IS_ADC_OPT_IT_INJ(event) (((event) & (HAL_ADC_OPT_IT_NONE \
                                              | HAL_ADC_OPT_IT_INJ_EOC \
                                              | HAL_ADC_OPT_IT_INJ_EOS \
                                              | HAL_ADC_OPT_IT_AWD_1 \
                                              | HAL_ADC_OPT_IT_AWD_2 \
                                              | HAL_ADC_OPT_IT_AWD_3)) == (event))

/**
  * @}
  */

/**
  * @}
  */

/* Private functions -------------------------------------------------------------------------------------------------*/
/** @defgroup ADC_Private_Functions ADC Private Functions
  * @{
  */
#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
static void adc_reg_dma_data_transfer_half_callback(hal_dma_handle_t *hdma);
static void adc_reg_dma_data_transfer_cplt_callback(hal_dma_handle_t *hdma);
static void adc_reg_dma_data_transfer_stop_callback(hal_dma_handle_t *hdma);
#if defined(ADC_MULTIMODE_SUPPORT)
static void adc_mm_reg_dma_data_transfer_stop_callback(hal_dma_handle_t *hdma);
#endif /* ADC_MULTIMODE_SUPPORT */
static void adc_reg_dma_data_transfer_error_callback(hal_dma_handle_t *hdma);
#endif /* USE_HAL_ADC_DMA */

static hal_status_t adc_activate(hal_adc_handle_t *hadc);
static hal_status_t adc_deactivate(hal_adc_handle_t *hadc);
static hal_status_t adc_calibrate(hal_adc_handle_t *hadc);
static hal_status_t adc_reg_stop_conversion(hal_adc_handle_t *hadc);
static hal_status_t adc_inj_stop_conversion(hal_adc_handle_t *hadc);

#if defined(ADC_MULTIMODE_SUPPORT)
static void adc_assert_state_mm_inst(const hal_adc_handle_t *hadc,
                                     const hal_adc_common_state_t common_state_expected,
                                     const hal_adc_state_t instance_state_expected);
static void adc_assert_state_mm_reg(const hal_adc_handle_t *hadc,
                                    const hal_adc_group_state_t group_state_expected);
static void adc_assert_state_mm_inj(const hal_adc_handle_t *hadc,
                                    const hal_adc_group_state_t group_state_expected);
static void adc_mm_set_state_inst(hal_adc_handle_t *hadc,
                                  hal_adc_common_state_t common_state,
                                  hal_adc_state_t instance_state);
static void adc_mm_set_state_inst_reg(hal_adc_handle_t *hadc,
                                      hal_adc_common_state_t common_state,
                                      hal_adc_state_t instance_state,
                                      hal_adc_group_state_t group_state);
static void adc_mm_set_state_inst_inj(hal_adc_handle_t *hadc,
                                      hal_adc_common_state_t common_state,
                                      hal_adc_state_t instance_state,
                                      hal_adc_group_state_t group_state);
static hal_status_t adc_mm_check_set_state_group(hal_adc_handle_t *hadc,
                                                 uint8_t group_index,
                                                 hal_adc_group_state_t group_state_conditional,
                                                 hal_adc_group_state_t group_state_new);
#endif /* ADC_MULTIMODE_SUPPORT */
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup ADC_Exported_Functions
  * @{
  */

/** @addtogroup ADC_Exported_Functions_Group1
  * @{
    Set of functions allowing to initialize and deinitialize the ADCx peripheral:
      + HAL_ADC_Init(): associate HAL ADC handle with selected ADC instance.
      + HAL_ADC_DeInit(): restore the default configuration of the HAL ADC handle.
      + HAL_ADC_SetLinkNextHandle(): Link HAL ADC handles belonging to the same ADC common instance.
      + HAL_ADC_REG_SetDMA(): Link a HAL ADC handle and a HAL DMA handle for conversion data from ADC group regular.
  */

/**
  * @brief  Initialize HAL ADC handle and associate it to the selected ADC instance.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  instance ADC instance.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_OK    HAL ADC handle has been correctly initialized.
  */
hal_status_t HAL_ADC_Init(hal_adc_handle_t *hadc, hal_adc_t instance)
{
  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(IS_ADC_ALL_INSTANCE((ADC_TypeDef *)((uint32_t)instance)));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hadc == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hadc->instance = instance;

