MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
#if defined(ADC_INST_IN_COMMON_COUNT) && (ADC_INST_IN_COMMON_COUNT > 1)
  hadc->p_link_next_handle = (hal_adc_handle_t *) NULL;
#endif /* ADC_INST_IN_COMMON_COUNT */

#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
  hadc->hdma_reg = (hal_dma_handle_t *) NULL;
#if defined(ADC_MULTIMODE_SUPPORT)
  hadc->mm_reg_data_transfer_packing = HAL_ADC_MM_REG_DATA_TRANSFER_PACK;
#endif /* ADC_MULTIMODE_SUPPORT */
#endif /* USE_HAL_ADC_DMA */

#if defined(USE_HAL_ADC_USER_DATA) && (USE_HAL_ADC_USER_DATA == 1)
  hadc->p_user_data = (void *) NULL;
#endif /* USE_HAL_ADC_USER_DATA */

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1U)
  /* Init HAL ADC callback settings */
  hadc->p_error_cb = HAL_ADC_ErrorCallback;
  hadc->p_reg_end_of_sampling_cb = HAL_ADC_REG_EndOfSamplingCallback;
  hadc->p_reg_eoc_cb = HAL_ADC_REG_UnitaryConvCpltCallback;
  hadc->p_reg_eos_cb = HAL_ADC_REG_SequenceConvCpltCallback;
#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
  hadc->p_reg_xfer_half_cb = HAL_ADC_REG_DataTransferHalfCallback;
  hadc->p_reg_xfer_cplt_cb = HAL_ADC_REG_DataTransferCpltCallback;
  hadc->p_reg_xfer_stop_cb = HAL_ADC_REG_DataTransferStopCallback;
#endif /* USE_HAL_ADC_DMA */
  hadc->p_inj_eoc_cb = HAL_ADC_INJ_UnitaryConvCpltCallback;
  hadc->p_inj_eos_cb = HAL_ADC_INJ_SequenceConvCpltCallback;
  hadc->p_awd_out_window_cb = HAL_ADC_AnalogWD_OutOfWindowCallback;
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */

#if defined(USE_HAL_ADC_GET_LAST_ERRORS) && (USE_HAL_ADC_GET_LAST_ERRORS == 1)
  hadc->last_error_codes = HAL_ADC_ERROR_NONE;
#endif /* USE_HAL_ADC_GET_LAST_ERRORS */

#if defined(USE_HAL_ADC_CLK_ENABLE_MODEL) && (USE_HAL_ADC_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
#if defined(USE_HAL_ADC_CLK_ENABLE_MODEL) && (USE_HAL_ADC_CLK_ENABLE_MODEL == HAL_CLK_ENABLE_PERIPH_PWR_SYSTEM)
  /* Enable the independent analog power supply */
#endif /* USE_HAL_ADC_CLK_ENABLE_MODEL */

  /* Enable peripheral clock */
#if defined(ADC3)
  if (instance == HAL_ADC3)
  {
    LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_ADC3);
  }
  else
  {
    LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_ADC12);
  }
#else
  LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_ADC12);
#endif /* ADC3 */
#endif /* USE_HAL_ADC_CLK_ENABLE_MODEL */

  /* Initialize HAL ADC state machine */
  hadc->global_state = HAL_ADC_STATE_INIT;
  hadc->group_state[ADC_GROUP_REGULAR] = HAL_ADC_GROUP_STATE_RESET;
  hadc->group_state[ADC_GROUP_INJECTED] = HAL_ADC_GROUP_STATE_RESET;
  hadc->common_state = HAL_ADC_COMMON_STATE_INDEPT;

  return HAL_OK;
}

/**
  * @brief  Deinitialize the ADC peripheral.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  */
void HAL_ADC_DeInit(hal_adc_handle_t *hadc)
{
  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(IS_ADC_ALL_INSTANCE(ADC_GET_INSTANCE(hadc)));

  /* Stop the current operations */
  if (hadc->global_state == HAL_ADC_STATE_ACTIVE)
  {
    if (hadc->group_state[ADC_GROUP_REGULAR] == HAL_ADC_GROUP_STATE_ACTIVE)
    {
      (void)HAL_ADC_REG_StopConv(hadc);
    }

    if (hadc->group_state[ADC_GROUP_INJECTED] == HAL_ADC_GROUP_STATE_ACTIVE)
    {
      (void)HAL_ADC_INJ_StopConv(hadc);
    }

    (void)HAL_ADC_Stop(hadc);
  }

#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
  hadc->hdma_reg = (hal_dma_handle_t *) NULL;
#endif /* USE_HAL_ADC_DMA */

#if defined(USE_HAL_ADC_USER_DATA) && (USE_HAL_ADC_USER_DATA == 1)
  hadc->p_user_data = NULL;
#endif /* USE_HAL_ADC_USER_DATA */

#if defined(ADC_INST_IN_COMMON_COUNT) && (ADC_INST_IN_COMMON_COUNT > 1)
  /* Check whether handle is registered in a handles daisy chain */
  if (hadc->p_link_next_handle != NULL)
  {
    /* Remove handle from daisy chain: Parse handles through links of daisy chain until loop back to previous handle */
    uint32_t index = ADC_MM_INST_COUNT; /* Maximum number of linked handles (to prevent infinite loop in case of
                                           pointer issue. In this case, daisy chain not updated.) */
    hal_adc_handle_t *p_handle_current = hadc;
    while (index != 0U)
    {
      if (p_handle_current->p_link_next_handle == hadc)
      {
#if (ADC_MM_INST_COUNT > 2)
        /* Daisy chain can be left with other handles linked */
        if (p_handle_current == hadc->p_link_next_handle)
        {
          /* Daisy chain remaining without link: other ADC handle no more linked */
          p_handle_current->common_state = HAL_ADC_COMMON_STATE_INDEPT;
          p_handle_current->p_link_next_handle = NULL;
        }
        else
        {
          /* Daisy chain update: Set link from previous handle to next handle */
          p_handle_current->p_link_next_handle = hadc->p_link_next_handle;
        }
#else
        /* Daisy chain remaining without link: other ADC handle no more linked */
        p_handle_current->common_state = HAL_ADC_COMMON_STATE_INDEPT;
        p_handle_current->p_link_next_handle = NULL;
#endif /* ADC_MM_INST_COUNT */

        hadc->p_link_next_handle = NULL;
        break;
      }
      else
      {
        /* Go to next handle */
        ASSERT_DBG_PARAM(p_handle_current->p_link_next_handle != NULL);
        p_handle_current = p_handle_current->p_link_next_handle;
      }
      index--;
    }
  }
#endif /* ADC_INST_IN_COMMON_COUNT */

  hadc->global_state = HAL_ADC_STATE_RESET;
  hadc->group_state[ADC_GROUP_REGULAR] = HAL_ADC_GROUP_STATE_RESET;
  hadc->group_state[ADC_GROUP_INJECTED] = HAL_ADC_GROUP_STATE_RESET;
  hadc->common_state = HAL_ADC_COMMON_STATE_INDEPT;
}

#if defined(ADC_INST_IN_COMMON_COUNT) && (ADC_INST_IN_COMMON_COUNT > 1)
/**
  * @brief  Link HAL ADC handles belonging to the same ADC common instance.
  * @param  hadc_a Pointer to hal_adc_handle_t structure of an ADC instance
  *                (not yet linked or already linked to a chain)
  * @param  hadc_b Pointer to hal_adc_handle_t structure of another ADC instance sharing the same ADC common instance
  *                (not yet linked: to be added to an existing chain)
  * @note   Requirement: The selected device must have at least 2 ADC instances sharing the same ADC common instance.
  *         Refer to device reference manual or macro "ADC_COMMON_INSTANCE()" returning
  *         ADC common instance from ADC instance.
  * @note   Link can be performed even if not using the common features.
  *         It is recommended to systematically link handles (when compliant instances): this allows functions
  *         to perform all cross instances checks possible, for optimal HAL ADC driver usage.
  * @note   Links are used to access multiple HAL ADC handles (daisy chain: from one to another and circular).
  *         Used by functions configuring parameters impacting multiple ADC instances.
  * @note   A handle can be removed from a chain using function @ref HAL_ADC_DeInit().
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_SetLinkNextHandle(hal_adc_handle_t *hadc_a, hal_adc_handle_t *hadc_b)
{
  hal_status_t status = HAL_OK;

  ASSERT_DBG_PARAM((hadc_a != NULL));
  ASSERT_DBG_PARAM((hadc_b != NULL));

  /* Check whether selected ADC instances are different */
  ASSERT_DBG_PARAM(hadc_a->instance != hadc_b->instance);

  /* Ensure new handle is not already linked */
  ASSERT_DBG_PARAM(hadc_b->p_link_next_handle == NULL);

  /* Check whether selected ADC instances belong to the same ADC common instance */
  ASSERT_DBG_PARAM(ADC_COMMON_INSTANCE(ADC_GET_INSTANCE(hadc_a))
                   == ADC_COMMON_INSTANCE(ADC_GET_INSTANCE(hadc_b)));

  ASSERT_DBG_STATE(hadc_a->common_state,
                   (uint32_t)HAL_ADC_COMMON_STATE_RESET |
                   (uint32_t)HAL_ADC_COMMON_STATE_INDEPT |
                   (uint32_t)HAL_ADC_COMMON_STATE_LINKED);
  ASSERT_DBG_STATE(hadc_b->common_state,
                   (uint32_t)HAL_ADC_COMMON_STATE_RESET |
                   (uint32_t)HAL_ADC_COMMON_STATE_INDEPT);
  ASSERT_DBG_STATE(hadc_a->global_state, (hal_adc_state_t)((uint32_t)HAL_ADC_STATE_INIT
                                                           | (uint32_t)HAL_ADC_STATE_CONFIGURING
                                                           | (uint32_t)HAL_ADC_STATE_CALIB
                                                           | (uint32_t)HAL_ADC_STATE_IDLE
                                                           | (uint32_t)HAL_ADC_STATE_ACTIVE));
  ASSERT_DBG_STATE(hadc_b->global_state, (hal_adc_state_t)((uint32_t)HAL_ADC_STATE_INIT
                                                           | (uint32_t)HAL_ADC_STATE_CONFIGURING
                                                           | (uint32_t)HAL_ADC_STATE_CALIB
                                                           | (uint32_t)HAL_ADC_STATE_IDLE
                                                           | (uint32_t)HAL_ADC_STATE_ACTIVE));

  if (hadc_a->p_link_next_handle == NULL)
  {
    /* First link */
    hadc_b->p_link_next_handle = hadc_a;
  }
  else
  {
    /* Additional link */
    hadc_b->p_link_next_handle = hadc_a->p_link_next_handle;
  }
  hadc_a->p_link_next_handle = hadc_b;

  hadc_a->common_state = HAL_ADC_COMMON_STATE_LINKED;
  hadc_b->common_state = HAL_ADC_COMMON_STATE_LINKED;

