MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  return status;
}
#endif /* ADC_INST_IN_COMMON_COUNT */

#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
/**
  * @brief Link a HAL ADC handle and a HAL DMA handle for conversion data from ADC group regular.
  * @param  hadc Pointer to HAL ADC handle.
  * @param  hdma Pointer to HAL DMA handle.
  * @retval HAL_OK    HAL ADC handle has been correctly configured.
  */
hal_status_t HAL_ADC_REG_SetDMA(hal_adc_handle_t *hadc, hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((hdma != NULL));

  ASSERT_DBG_STATE(hadc->global_state, ((uint32_t)HAL_ADC_STATE_INIT |
                                        (uint32_t)HAL_ADC_STATE_CONFIGURING |
                                        (uint32_t)HAL_ADC_STATE_IDLE));
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_REGULAR], ((uint32_t)HAL_ADC_GROUP_STATE_RESET |
                                                          (uint32_t)HAL_ADC_GROUP_STATE_IDLE));

  hadc->hdma_reg = hdma;
  hdma->p_parent = hadc;

  return HAL_OK;
}
#endif /* USE_HAL_ADC_DMA */

/**
  * @}
  */

/** @addtogroup ADC_Exported_Functions_Group2_1
  * @{
    Set of functions allowing to configure ADCx peripheral (mandatory features):
    Mandatory features for some process functions (at least some of these functions must be used but
    not necessarily all, depending on process functions used).
    @note For necessary configurations functions, refer to state machine diagram
          or "How to use the ADC HAL module driver" section).
  */

/**
  * @brief  Configure ADC instance.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_config Pointer to a hal_adc_config_t structure containing ADC configuration.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_SetConfig(hal_adc_handle_t *hadc, const hal_adc_config_t *p_config)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_ADC_RESOLUTION(p_config->resolution));
  ASSERT_DBG_PARAM(IS_ADC_SAMPLING_MODE(p_config->sampling_mode));

  ASSERT_DBG_STATE(hadc->global_state,
                   (uint32_t)HAL_ADC_STATE_INIT |
                   (uint32_t)HAL_ADC_STATE_CONFIGURING |
                   (uint32_t)HAL_ADC_STATE_IDLE);

  p_instance = ADC_GET_INSTANCE(hadc);

  LL_ADC_SetResolution(p_instance, (uint32_t)p_config->resolution);
  LL_ADC_SetSamplingMode(p_instance, (uint32_t)p_config->sampling_mode);

  if (hadc->global_state == HAL_ADC_STATE_INIT)
  {
    hadc->global_state = HAL_ADC_STATE_CONFIGURING;
  }

  return status;
}

/**
  * @brief  Get the ADC instance configuration.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_config Pointer to a hal_adc_config_t structure containing ADC configuration.
  */
void HAL_ADC_GetConfig(const hal_adc_handle_t *hadc, hal_adc_config_t *p_config)
{
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(hadc->global_state, (hal_adc_state_t)((uint32_t)HAL_ADC_STATE_CONFIGURING
                                                         | (uint32_t)HAL_ADC_STATE_IDLE
                                                         | (uint32_t)HAL_ADC_STATE_ACTIVE));

  p_instance = ADC_GET_INSTANCE(hadc);

  p_config->resolution = (hal_adc_resolution_t)LL_ADC_GetResolution(p_instance);
  p_config->sampling_mode = (hal_adc_sampling_mode_t)LL_ADC_GetSamplingMode(p_instance);
}

/**
  * @brief  Configure ADC group regular.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_config Pointer to a hal_adc_reg_config_t structure containing ADC group regular configuration.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_REG_SetConfig(hal_adc_handle_t *hadc, const hal_adc_reg_config_t *p_config)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;
  uint32_t reg_config;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_ADC_REG_TRIGGER_SRC(hadc->instance, p_config->trigger_src));
  if (p_config->trigger_src != HAL_ADC_REG_TRIG_SOFTWARE)
  {
    ASSERT_DBG_PARAM(IS_ADC_REG_TRIGGER_EDGE(p_config->trigger_edge));
  }
  ASSERT_DBG_PARAM(IS_ADC_REG_CONTINUOUS_MODE(p_config->continuous));
  ASSERT_DBG_PARAM(IS_ADC_REG_OVERRUN_MODE(p_config->overrun));
  ASSERT_DBG_PARAM(IS_ADC_REG_SEQUENCER_LENGTH(p_config->sequencer_length));
  ASSERT_DBG_PARAM(IS_ADC_REG_SEQ_DISCONT(p_config->sequencer_discont));

  ASSERT_DBG_STATE(hadc->global_state,
                   (uint32_t)HAL_ADC_STATE_CONFIGURING |
                   (uint32_t)HAL_ADC_STATE_IDLE);

  p_instance = ADC_GET_INSTANCE(hadc);

  /* Verify configuration compliance versus hardware constraints */
  if (p_config->continuous != HAL_ADC_REG_CONV_SINGLE)
  {
    if (LL_ADC_GetSamplingMode(p_instance) != LL_ADC_SAMPLING_MODE_NORMAL)
    {
      status = HAL_ERROR;
    }
  }

  LL_ADC_REG_SetTriggerSource(p_instance, (uint32_t)p_config->trigger_src);
  if (p_config->trigger_src != HAL_ADC_REG_TRIG_SOFTWARE)
  {
    LL_ADC_REG_SetTriggerEdge(p_instance, (uint32_t)p_config->trigger_edge);
  }

  LL_ADC_REG_SetSequencerLength(p_instance, LL_ADC_DECIMAL_NB_TO_REG_SEQ_LENGTH((uint32_t)p_config->sequencer_length));

  /* Set ADC group regular in a single register write access
     (equivalent to successive calls of configuration functions LL_ADC_REG_Set...()) */
  reg_config = LL_ADC_READ_REG(p_instance, CFGR1);
  reg_config &= ~(ADC_CFGR1_CONT
                  | ADC_CFGR1_DISCEN | ADC_CFGR1_DISCNUM
                  | ADC_CFGR1_DMNGT
                  | ADC_CFGR1_OVRMOD);
  reg_config |= ((uint32_t)p_config->continuous
                 | (uint32_t)p_config->sequencer_discont
                 | (uint32_t)p_config->overrun);
  LL_ADC_WRITE_REG(p_instance, CFGR1, reg_config);

  if ((p_config->trigger_src == HAL_ADC_REG_TRIG_SOFTWARE)
      && (p_config->continuous == HAL_ADC_REG_CONV_SINGLE))
  {
    hadc->group_conv_per_start[ADC_GROUP_REGULAR] = HAL_ADC_GROUP_CONV_UNIT;
  }
  else
  {
    hadc->group_conv_per_start[ADC_GROUP_REGULAR] = HAL_ADC_GROUP_CONV_MULTIPLE;
  }

  hadc->group_state[ADC_GROUP_REGULAR] = HAL_ADC_GROUP_STATE_IDLE;

