MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  return status;
}

/**
  * @brief  Get configuration of ADC group regular.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_config Pointer to a hal_adc_reg_config_t structure containing ADC group regular configuration.
  */
void HAL_ADC_REG_GetConfig(const hal_adc_handle_t *hadc, hal_adc_reg_config_t *p_config)
{
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(hadc->global_state, (hal_adc_state_t)((uint32_t)HAL_ADC_STATE_CONFIGURING
                                                         | (uint32_t)HAL_ADC_STATE_IDLE
                                                         | (uint32_t)HAL_ADC_STATE_ACTIVE));

  p_instance = ADC_GET_INSTANCE(hadc);

  p_config->trigger_src = (hal_adc_reg_trig_src_t)LL_ADC_REG_GetTriggerSource(p_instance);

  if (p_config->trigger_src == HAL_ADC_REG_TRIG_SOFTWARE)
  {
    p_config->trigger_edge = HAL_ADC_REG_TRIG_EDGE_NONE;
  }
  else
  {
    p_config->trigger_edge = (hal_adc_reg_trig_edge_t)LL_ADC_REG_GetTriggerEdge(p_instance);
  }

  p_config->sequencer_length = (uint8_t)LL_ADC_REG_SEQ_LENGTH_TO_DECIMAL_NB(LL_ADC_REG_GetSequencerLength(p_instance));
  p_config->sequencer_discont = (hal_adc_reg_seq_discont_length_t)LL_ADC_REG_GetSequencerDiscont(p_instance);
  p_config->continuous = (hal_adc_reg_continuous_mode_t)LL_ADC_REG_GetContinuousMode(p_instance);
  p_config->overrun = (hal_adc_reg_overrun_mode_t)LL_ADC_REG_GetOverrun(p_instance);
}

/**
  * @brief  Configure ADC group injected.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_config Pointer to a hal_adc_inj_config_t structure containing ADC group injected configuration.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_INJ_SetConfig(hal_adc_handle_t *hadc, const hal_adc_inj_config_t *p_config)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_ADC_INJ_TRIGGER_SRC(hadc->instance, p_config->trigger_src));
  if ((p_config->trigger_src != HAL_ADC_INJ_TRIG_SOFTWARE)
      && (p_config->trigger_src != HAL_ADC_INJ_TRIG_FROM_REGULAR))
  {
    ASSERT_DBG_PARAM(IS_ADC_INJ_TRIGGER_EDGE(p_config->trigger_edge));
  }
  ASSERT_DBG_PARAM(IS_ADC_INJ_SEQUENCER_LENGTH(p_config->sequencer_length));
  ASSERT_DBG_PARAM(IS_ADC_INJ_SEQ_DISCONT(p_config->sequencer_discont));

  ASSERT_DBG_STATE(hadc->global_state,
                   (uint32_t)HAL_ADC_STATE_CONFIGURING |
                   (uint32_t)HAL_ADC_STATE_IDLE);

  p_instance = ADC_GET_INSTANCE(hadc);

  LL_ADC_INJ_SetTriggerSource(p_instance, (uint32_t)p_config->trigger_src & ~LL_ADC_INJ_TRIG_FROM_REGULAR);

  if (p_config->trigger_src != HAL_ADC_INJ_TRIG_SOFTWARE)
  {
    if (p_config->trigger_src == HAL_ADC_INJ_TRIG_FROM_REGULAR)
    {
      LL_ADC_INJ_SetTrigAuto(p_instance, LL_ADC_INJ_TRIG_FROM_REGULAR);
    }
    else
    {
      LL_ADC_INJ_SetTriggerEdge(p_instance, (uint32_t)p_config->trigger_edge);
    }
  }

  LL_ADC_INJ_SetSequencerLength(p_instance, LL_ADC_DECIMAL_NB_TO_INJ_SEQ_LENGTH((uint32_t)p_config->sequencer_length));
  LL_ADC_INJ_SetSequencerDiscont(p_instance, (uint32_t)p_config->sequencer_discont);

  if (p_config->trigger_src == HAL_ADC_INJ_TRIG_SOFTWARE)
  {
    hadc->group_conv_per_start[ADC_GROUP_INJECTED] = HAL_ADC_GROUP_CONV_UNIT;
  }
  else
  {
    hadc->group_conv_per_start[ADC_GROUP_INJECTED] = HAL_ADC_GROUP_CONV_MULTIPLE;
  }

  hadc->group_state[ADC_GROUP_INJECTED] = HAL_ADC_GROUP_STATE_IDLE;

  return status;
}

/**
  * @brief  Get configuration of ADC group injected.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_config Pointer to a hal_adc_inj_config_t structure containing ADC group injected configuration.
  */
void HAL_ADC_INJ_GetConfig(const hal_adc_handle_t *hadc, hal_adc_inj_config_t *p_config)
{
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(hadc->global_state, (hal_adc_state_t)((uint32_t)HAL_ADC_STATE_CONFIGURING
                                                         | (uint32_t)HAL_ADC_STATE_IDLE
                                                         | (uint32_t)HAL_ADC_STATE_ACTIVE));

  p_instance = ADC_GET_INSTANCE(hadc);

  p_config->trigger_src = (hal_adc_inj_trig_src_t)LL_ADC_INJ_GetTriggerSource(p_instance);

  if (p_config->trigger_src == HAL_ADC_INJ_TRIG_SOFTWARE)
  {
    p_config->trigger_src = (hal_adc_inj_trig_src_t)LL_ADC_INJ_GetTrigAuto(p_instance);

    p_config->trigger_edge = HAL_ADC_INJ_TRIG_EDGE_NONE;
  }
  else
  {
    p_config->trigger_edge = (hal_adc_inj_trig_edge_t)LL_ADC_INJ_GetTriggerEdge(p_instance);
  }

  p_config->sequencer_length = (uint8_t)LL_ADC_INJ_SEQ_LENGTH_TO_DECIMAL_NB(LL_ADC_INJ_GetSequencerLength(p_instance));
  p_config->sequencer_discont = (hal_adc_inj_seq_discont_length_t)LL_ADC_INJ_GetSequencerDiscont(p_instance);
}

/**
  * @brief  Configure the selected ADC channel.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  channel ADC channel
  * @param  p_config Pointer to a hal_adc_channel_config_t structure containing ADC channel configuration.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_SetConfigChannel(hal_adc_handle_t *hadc, hal_adc_channel_t channel,
                                      const hal_adc_channel_config_t *p_config)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;
  uint32_t sequencer_rank_ll_format;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

