MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  ASSERT_DBG_PARAM(IS_ADC_CHANNEL(hadc->instance, channel));
  ASSERT_DBG_PARAM((p_config->group == HAL_ADC_GROUP_REGULAR) || (p_config->group == HAL_ADC_GROUP_INJECTED));
  if (p_config->group == HAL_ADC_GROUP_REGULAR)
  {
    ASSERT_DBG_PARAM(IS_ADC_REG_SEQUENCER_LENGTH(p_config->sequencer_rank));
  }
  else
  {
    ASSERT_DBG_PARAM(IS_ADC_INJ_SEQUENCER_LENGTH(p_config->sequencer_rank));
  }
  ASSERT_DBG_PARAM(IS_ADC_SAMPLING_TIME(p_config->sampling_time));
  ASSERT_DBG_PARAM(IS_ADC_CHANNEL_INPUT_MODE(p_config->input_mode));

  ASSERT_DBG_STATE(hadc->global_state,
                   (uint32_t)HAL_ADC_STATE_CONFIGURING |
                   (uint32_t)HAL_ADC_STATE_IDLE);

  p_instance = ADC_GET_INSTANCE(hadc);

  if (p_config->group == HAL_ADC_GROUP_REGULAR)
  {
    sequencer_rank_ll_format = LL_ADC_DECIMAL_NB_TO_REG_SEQ_RANK((uint32_t)p_config->sequencer_rank);

    LL_ADC_REG_SetSequencerRanks(p_instance, sequencer_rank_ll_format, (uint32_t)channel);
  }
  else
  {
    sequencer_rank_ll_format = LL_ADC_DECIMAL_NB_TO_INJ_SEQ_RANK((uint32_t)p_config->sequencer_rank);
    LL_ADC_INJ_SetSequencerRanks(p_instance, sequencer_rank_ll_format, (uint32_t)channel);
  }

  LL_ADC_SetChannelSamplingTime(p_instance, (uint32_t)channel, (uint32_t)p_config->sampling_time);
  LL_ADC_SetChannelSingleDiff(p_instance, (uint32_t)channel, (uint32_t)p_config->input_mode);

  if (LL_ADC_IS_CHANNEL_INTERNAL((uint32_t)channel))
  {
    /* Channel internal */
    if (((uint32_t)channel & LL_ADC_COMMON_PATH_INTERNAL_MASK) != 0UL)
    {
      LL_ADC_SetCommonPathInternalChAdd(ADC_COMMON_INSTANCE(p_instance), (uint32_t)channel);
    }
  }
  else
  {
    /* Channel connected to GPIO */
    LL_ADC_SetChannelPreselection(p_instance, (uint32_t)channel);
  }

  hadc->global_state = HAL_ADC_STATE_IDLE;

  return status;
}

/**
  * @brief  Get configuration of the selected ADC channel.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  channel ADC channel
  * @param  p_config Pointer to a hal_adc_channel_config_t structure containing ADC channel configuration.
  * @note   Specific cases:
  *         - in case of channel set in ADC groups regular and injected, returned value of ADC group is
  *           @ref HAL_ADC_GROUP_REGULAR_INJECTED and sequencer rank referring to group regular.
  *         - in case of channel not set in any ADC group sequencer, returned value of ADC group is
  *           @ref HAL_ADC_GROUP_NONE. Value of sequencer rank is not relevant.
  *         - in case of channel set multiple times in a ADC group sequencer, returned value of sequencer rank is the
  *           lowest one.
  */
void HAL_ADC_GetConfigChannel(const hal_adc_handle_t *hadc, hal_adc_channel_t channel,
                              hal_adc_channel_config_t *p_config)
{
  ADC_TypeDef *p_instance;
  uint32_t sequencer_rank_ll_format;
  uint8_t sequencer_length;
  uint8_t index;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));
  ASSERT_DBG_PARAM(IS_ADC_CHANNEL(hadc->instance, channel));

  ASSERT_DBG_STATE(hadc->global_state,
                   (uint32_t)HAL_ADC_STATE_IDLE |
                   (uint32_t)HAL_ADC_STATE_ACTIVE);

  p_instance = ADC_GET_INSTANCE(hadc);

  p_config->group = HAL_ADC_GROUP_NONE;
  p_config->sequencer_rank = 0U; /* Initialization to sequencer rank out of bound */
  sequencer_length = (uint8_t)LL_ADC_REG_SEQ_LENGTH_TO_DECIMAL_NB(LL_ADC_REG_GetSequencerLength(p_instance));

  /* Search channel in ADC group regular sequencer */
  for (index = 1U; index <= sequencer_length; index++)
  {
    sequencer_rank_ll_format = LL_ADC_DECIMAL_NB_TO_REG_SEQ_RANK(index);
    if (LL_ADC_CHANNEL_TO_DECIMAL_NB(LL_ADC_REG_GetSequencerRanks(p_instance, sequencer_rank_ll_format))
        == LL_ADC_CHANNEL_TO_DECIMAL_NB((uint32_t)channel))
    {
      p_config->group = HAL_ADC_GROUP_REGULAR;
      p_config->sequencer_rank = index;
      break;
    }
  }

  /* Search channel in ADC group injected sequencer */
  sequencer_length = (uint8_t)LL_ADC_INJ_SEQ_LENGTH_TO_DECIMAL_NB(LL_ADC_INJ_GetSequencerLength(p_instance));
  for (index = 1U; index <= sequencer_length; index++)
  {
    sequencer_rank_ll_format = LL_ADC_DECIMAL_NB_TO_INJ_SEQ_RANK(index);
    if (LL_ADC_CHANNEL_TO_DECIMAL_NB(LL_ADC_INJ_GetSequencerRanks(p_instance, sequencer_rank_ll_format))
        == LL_ADC_CHANNEL_TO_DECIMAL_NB((uint32_t)channel))
    {
      if (p_config->group == HAL_ADC_GROUP_REGULAR)
      {
        p_config->group = HAL_ADC_GROUP_REGULAR_INJECTED;
        /* Note: in this case, field "sequencer_rank" kept referring to group regular */
      }
      else
      {
        p_config->group = HAL_ADC_GROUP_INJECTED;
        p_config->sequencer_rank = index;
      }
      break;
    }
  }

  p_config->input_mode = (hal_adc_in_mode_t)LL_ADC_GetChannelSingleDiff(p_instance, (uint32_t)channel);
  p_config->sampling_time = (hal_adc_sampling_time_t)LL_ADC_GetChannelSamplingTime(p_instance, (uint32_t)channel);
}

#if defined(ADC_MULTIMODE_SUPPORT)
/**
  * @brief  Configure ADC multimode.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @param  p_config Pointer to a hal_adc_mm_config_t structure containing ADC multimode configuration.
  * @warning  Prerequisite: HAL ADC handles part of multimode setup must have been linked using function
  *           @ref HAL_ADC_SetLinkNextHandle().
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_SetConfig(hal_adc_handle_t *hadc, const hal_adc_mm_config_t *p_config)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;
  ADC_Common_TypeDef *p_common_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_ADC_MM_MODE(p_config->mode));
  if (p_config->mode != HAL_ADC_MM_INDEPENDENT)
  {
    if ((p_config->mode != HAL_ADC_MM_DUAL_INJ_SIMULT)
        && (p_config->mode != HAL_ADC_MM_DUAL_INJ_ALTERN))
    {
      ASSERT_DBG_PARAM(IS_ADC_MM_REG_DATA_FORMAT(p_config->reg_data_format));

