MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
      if (p_config->reg_data_format != HAL_ADC_MM_REG_DATA_EACH_ADC)
      {
        ASSERT_DBG_PARAM(IS_ADC_MM_REG_DATA_TRANSFER_PACKING(p_config->reg_data_transfer_packing));
      }
#endif /* USE_HAL_ADC_DMA */
    }

    if ((p_config->mode == HAL_ADC_MM_DUAL_REG_INTERL)
        || (p_config->mode == HAL_ADC_MM_DUAL_REG_INT_INJ_SIM))
    {
      ASSERT_DBG_PARAM(IS_ADC_MM_INTERL_DELAY(p_config->interl_delay));
    }
  }

  /* Check state of all HAL ADC handles part of multimode */
  adc_assert_state_mm_inst(hadc,
                           (hal_adc_common_state_t)((uint32_t)HAL_ADC_COMMON_STATE_LINKED |
                                                    (uint32_t)HAL_ADC_COMMON_STATE_MM),
                           HAL_ADC_STATE_IDLE);

  p_instance = ADC_GET_INSTANCE(hadc);
  p_common_instance = ADC_COMMON_INSTANCE(p_instance);

  /* Variable can be unused depending on assert param and ADC_COMMON_INSTANCE() macro content */
  STM32_UNUSED(p_instance);

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(p_instance) == p_instance);

#if defined(USE_ASSERT_DBG_PARAM)
  /* Check constraints for mode interleaved */
  if ((p_config->mode == HAL_ADC_MM_DUAL_REG_INTERL)
      || (p_config->mode == HAL_ADC_MM_DUAL_REG_INT_INJ_SIM))
  {
    /* Interleaved delay dependency to ADC resolution */
    uint32_t adc_resolution = LL_ADC_GetResolution(p_instance);
    if (adc_resolution == LL_ADC_RESOLUTION_10B)
    {
      ASSERT_DBG_PARAM(p_config->interl_delay <= HAL_ADC_MM_INTERL_DELAY_11CYCLES);
    }
    else if (adc_resolution == LL_ADC_RESOLUTION_8B)
    {
      ASSERT_DBG_PARAM(p_config->interl_delay <= HAL_ADC_MM_INTERL_DELAY_9CYCLES);
    }
    else if (adc_resolution == LL_ADC_RESOLUTION_6B)
    {
      ASSERT_DBG_PARAM(p_config->interl_delay <= HAL_ADC_MM_INTERL_DELAY_7CYCLES);
    }
    else
    {
      /* No action */
    }
  }
#endif /* USE_ASSERT_DBG_PARAM */

  LL_ADC_SetMultimode(p_common_instance, (uint32_t)p_config->mode);

  if (p_config->mode != HAL_ADC_MM_INDEPENDENT)
  {
    if ((p_config->mode != HAL_ADC_MM_DUAL_INJ_SIMULT)
        && (p_config->mode != HAL_ADC_MM_DUAL_INJ_ALTERN))
    {
      LL_ADC_SetMultiDMATransfer(p_common_instance, (uint32_t)p_config->reg_data_format);

#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
      if (p_config->reg_data_format != HAL_ADC_MM_REG_DATA_EACH_ADC)
      {
        hadc->mm_reg_data_transfer_packing = p_config->reg_data_transfer_packing;
      }
#endif /* USE_HAL_ADC_DMA */
    }

    if ((p_config->mode == HAL_ADC_MM_DUAL_REG_INTERL)
        || (p_config->mode == HAL_ADC_MM_DUAL_REG_INT_INJ_SIM))
    {
      LL_ADC_SetMultiTwoSamplingDelay(p_common_instance, (uint32_t)p_config->interl_delay);
    }
  }

  /* Update state of all HAL ADC handles part of multimode */
  adc_mm_set_state_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_IDLE);

  return status;
}

/**
  * @brief  Get configuration of ADC multimode.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @param  p_config Pointer to a hal_adc_mm_config_t structure containing ADC multimode configuration.
  */
void HAL_ADC_MM_GetConfig(const hal_adc_handle_t *hadc, hal_adc_mm_config_t *p_config)
{
  ADC_Common_TypeDef *p_common_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(ADC_GET_INSTANCE(hadc)) == ADC_GET_INSTANCE(hadc));

  /* Check state of all HAL ADC handles part of multimode */
  adc_assert_state_mm_inst(hadc,
                           (hal_adc_common_state_t)((uint32_t)HAL_ADC_COMMON_STATE_LINKED |
                                                    (uint32_t)HAL_ADC_COMMON_STATE_MM),
                           (hal_adc_state_t)((uint32_t)HAL_ADC_STATE_IDLE
                                             | (uint32_t)HAL_ADC_STATE_ACTIVE));

  p_common_instance = ADC_COMMON_INSTANCE(ADC_GET_INSTANCE(hadc));

  p_config->mode = (hal_adc_mm_mode_t)LL_ADC_GetMultimode(p_common_instance);
  p_config->reg_data_format = (hal_adc_mm_reg_data_format_t)LL_ADC_GetMultiDMATransfer(p_common_instance);
#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
  p_config->reg_data_transfer_packing = hadc->mm_reg_data_transfer_packing;
#endif /* USE_HAL_ADC_DMA */
  p_config->interl_delay = (hal_adc_mm_interl_delay_t)LL_ADC_GetMultiTwoSamplingDelay(p_common_instance);
}

#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
/**
  * @brief  Multimode configuration: conversion data of all ADC instances part of multimode are
  *         transferred using multiple DMA channels (one DMA channel assigned to each ADC).
  *         This function must be called by each HAL ADC handle part of multimode.
  *         Then, multimode conversion is started by HAL_ADC_MM_REG_StartConvM_DMA() / M_DMA_Opt().
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_data     Pointer to the data buffer (data transfer from ADC to buffer, through DMA).
  * @param  size_byte  Data buffer size (in bytes).
  * @warning  Prerequisite: HAL ADC handles part of multimode setup must have been linked using function
  *           @ref HAL_ADC_SetLinkNextHandle()
  *           and multimode must have been configured using function @ref HAL_ADC_MM_SetConfig().
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_REG_SetMultiDMA(hal_adc_handle_t *hadc, uint8_t *p_data, uint32_t size_byte)
{
  hal_status_t status;
  ADC_TypeDef *p_instance;
  hal_dma_handle_t *hdma;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(hadc->hdma_reg != NULL); /* Pointer set by HAL_ADC_REG_SetDMA() */
  ASSERT_DBG_PARAM(p_data != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((hadc->hdma_reg == NULL) || (p_data == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check state of all HAL ADC handles part of multimode */
  ASSERT_DBG_STATE(hadc->common_state, HAL_ADC_COMMON_STATE_MM);
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_REGULAR], HAL_ADC_GROUP_STATE_IDLE);

  p_instance = ADC_GET_INSTANCE(hadc);
  hdma = hadc->hdma_reg;

