MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  /* Set DMA channel callback functions pointers */
  hdma->p_xfer_error_cb     = adc_reg_dma_data_transfer_error_callback;
  hdma->p_xfer_halfcplt_cb  = adc_reg_dma_data_transfer_half_callback;
  hdma->p_xfer_cplt_cb      = adc_reg_dma_data_transfer_cplt_callback;

  /* Start DMA transfer in IT mode */
  /* Note: DMA transfer interruptions selection is updated by HAL_ADC_MM_REG_StartConvM_DMA() / DMA_Opt() */
  status = HAL_DMA_StartPeriphXfer_IT_Opt(hdma,
                                          LL_ADC_DMA_GetRegAddr(p_instance, LL_ADC_DMA_REG_REGULAR_DATA),
                                          (uint32_t)p_data, size_byte, HAL_ADC_OPT_DMA_IT_NONE);

#if defined(USE_HAL_ADC_GET_LAST_ERRORS) && (USE_HAL_ADC_GET_LAST_ERRORS == 1)
  if (status != HAL_OK)
  {
    hadc->last_error_codes |= HAL_ADC_REG_ERROR_DMA;
  }
#endif /* USE_HAL_ADC_GET_LAST_ERRORS */

  /* ADC DMA requests come from each ADC instance */
  LL_ADC_SetMultiDMATransfer(ADC_COMMON_INSTANCE(p_instance), LL_ADC_MULTI_REG_DMA_EACH_ADC);

  return status;
}
#endif /* USE_HAL_ADC_DMA */

#endif /* ADC_MULTIMODE_SUPPORT */

/**
  * @}
  */

/** @addtogroup ADC_Exported_Functions_Group2_2
  * @{
    Set of functions allowing to configure ADCx peripheral (optional features):
    Same as other configuration functions for optional features: the non usage of these functions will not block
    any process function.
  */

/**
  * @brief  Configure ADC instance advanced features: conversion data post processing.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_config Pointer to a hal_adc_post_processing_config_t structure containing ADC configuration.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_SetConfigPostProcessing(hal_adc_handle_t *hadc, const hal_adc_post_processing_config_t *p_config)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));
  ASSERT_DBG_PARAM(IS_ADC_LEFT_BIT_SHIFT(p_config->left_bit_shift));
  ASSERT_DBG_PARAM(IS_ADC_GAIN_COMPENSATION(p_config->gain_compensation_x1000));

  ASSERT_DBG_STATE(hadc->global_state,
                   (uint32_t)HAL_ADC_STATE_CONFIGURING |
                   (uint32_t)HAL_ADC_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_instance = ADC_GET_INSTANCE(hadc);

  LL_ADC_SetLeftBitShift(p_instance, (uint32_t)p_config->left_bit_shift);

  /* Gain coefficient computation: convert from HAL ADC gain in decimal value to ADC peripheral digital value */
  LL_ADC_SetGainCompensation(p_instance,
                             (uint32_t)((p_config->gain_compensation_x1000 * LL_ADC_GAIN_COMPENSATION_DIV)
                                        / ADC_GAIN_COMPENSATION_VAL_UNIT));

  return status;
}

/**
  * @brief  Get the ADC instance configuration for advanced features: conversion data post processing.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_config Pointer to a hal_adc_post_processing_config_t structure containing ADC configuration.
  * @note   Returned value of hal_adc_post_processing_config_t field "gain_compensation_x1000"
  *         can differ from value set in HAL_ADC_SetConfigPostProcessing() due to computation rounding.
  */
void HAL_ADC_GetConfigPostProcessing(const hal_adc_handle_t *hadc, hal_adc_post_processing_config_t *p_config)
{
  ADC_TypeDef *p_instance;
  uint32_t gain_compensation;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(hadc->global_state, (hal_adc_state_t)((uint32_t)HAL_ADC_STATE_CONFIGURING
                                                         | (uint32_t)HAL_ADC_STATE_IDLE
                                                         | (uint32_t)HAL_ADC_STATE_ACTIVE));

  p_instance = ADC_GET_INSTANCE(hadc);

  p_config->left_bit_shift = (hal_adc_left_bit_shift_t)LL_ADC_GetLeftBitShift(p_instance);

  gain_compensation = LL_ADC_GetGainCompensation(p_instance);
  if (gain_compensation == LL_ADC_GAIN_COMPENSATION_DIV)
  {
    p_config->gain_compensation_x1000 = ADC_GAIN_COMPENSATION_VAL_UNIT;
  }
  else
  {
    /* Gain coefficient computation: convert from ADC peripheral digital value to HAL ADC gain in decimal value */
    p_config->gain_compensation_x1000 = ((gain_compensation * ADC_GAIN_COMPENSATION_VAL_UNIT)
                                         / LL_ADC_GAIN_COMPENSATION_DIV);
    /* Update value to compensate computation rounding */
    if (gain_compensation != 0UL)
    {
      p_config->gain_compensation_x1000 += 1UL;
    }
  }
}

/**
  * @brief  Configure ADC instance advanced features: low power.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_config Pointer to a hal_adc_low_power_config_t structure containing ADC configuration.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_SetConfigLowPower(hal_adc_handle_t *hadc, const hal_adc_low_power_config_t *p_config)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));
  ASSERT_DBG_PARAM(IS_ADC_LP_AUTOWAIT(p_config->lp_auto_wait));

  ASSERT_DBG_STATE(hadc->global_state,
                   (uint32_t)HAL_ADC_STATE_CONFIGURING |
                   (uint32_t)HAL_ADC_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_instance = ADC_GET_INSTANCE(hadc);

  LL_ADC_SetLowPowerMode(p_instance, (uint32_t)p_config->lp_auto_wait);

  return status;
}

/**
  * @brief  Get the ADC instance configuration for advanced features: low power.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_config Pointer to a hal_adc_low_power_config_t structure containing ADC configuration.
  */
void HAL_ADC_GetConfigLowPower(const hal_adc_handle_t *hadc, hal_adc_low_power_config_t *p_config)
{
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(hadc->global_state, (hal_adc_state_t)((uint32_t)HAL_ADC_STATE_CONFIGURING
                                                         | (uint32_t)HAL_ADC_STATE_IDLE
                                                         | (uint32_t)HAL_ADC_STATE_ACTIVE));

  p_instance = ADC_GET_INSTANCE(hadc);

  p_config->lp_auto_wait = (hal_adc_lp_auto_wait_state_t)LL_ADC_GetLowPowerMode(p_instance);
}


/**
  * @brief  Configure ADC analog watchdog.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  awd_instance Analog watchdog instance.
  * @param  p_config Pointer to a hal_adc_awd_config_t structure containing ADC analog watchdog configuration.
  * @note   Specific configurations:
  *         - to monitor all channels, use following parameters values of hal_adc_awd_config_t:
  *             .group = definition of group regular and-or injected
  *             .channel = HA_ADC_CHANNEL_ALL
  *         - to monitor a list of channels (AWD2 and AWD3 only): call this function once to configure
  *           all parameters with one channel, then call function @ref HAL_ADC_SetAnalogWDChannel() for channels to add.
  *         - to disable ADC analog watchdog, use following parameters values:
  *             .group = HAL_ADC_GROUP_NONE
  *             .channel = HAL_ADC_CHANNEL_NONE
  *           (parameters HAL_ADC_GROUP_NONE and HAL_ADC_CHANNEL_NONE must be used together, not separately)
  * @note   Analog watchdog instances specificities: refer to description of "hal_adc_awd_instance_t".
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_SetConfigAnalogWD(hal_adc_handle_t *hadc, hal_adc_awd_instance_t awd_instance,
                                       const hal_adc_awd_config_t *p_config)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;
  uint32_t adc_resolution;
  int32_t threshold_high_res;
  int32_t threshold_low_res;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_ADC_AWD_INSTANCE(awd_instance));
  ASSERT_DBG_PARAM(IS_ADC_GROUP(p_config->group));
  ASSERT_DBG_PARAM(IS_ADC_CHANNEL(hadc->instance, p_config->channel));
  if (p_config->channel != HAL_ADC_CHANNEL_NONE)
  {
    ASSERT_DBG_PARAM(IS_ADC_AWD_THRESHOLD(p_config->threshold_high));
    ASSERT_DBG_PARAM(IS_ADC_AWD_THRESHOLD(p_config->threshold_low));

    /* Case filtering selected */
    ASSERT_DBG_PARAM(IS_ADC_AWD_FILTERING(p_config->filtering));
    if (awd_instance != HAL_ADC_AWD_1)
    {
      ASSERT_DBG_PARAM(p_config->filtering == HAL_ADC_AWD_FILTERING_NONE);
    }
  }

  /* Check parameters values dependent to specific conditions */
  /* Case analog watchdog disable: if group set to HAL_ADC_GROUP_NONE, channel must be set to HAL_ADC_CHANNEL_NONE */
  if (p_config->channel == HAL_ADC_CHANNEL_NONE)
  {
    ASSERT_DBG_PARAM(p_config->group == HAL_ADC_GROUP_NONE);
  }
  if (p_config->group == HAL_ADC_GROUP_NONE)
  {
    ASSERT_DBG_PARAM(p_config->channel == HAL_ADC_CHANNEL_NONE);
  }

  ASSERT_DBG_STATE(hadc->global_state,
                   (uint32_t)HAL_ADC_STATE_CONFIGURING |
                   (uint32_t)HAL_ADC_STATE_IDLE);

  p_instance = ADC_GET_INSTANCE(hadc);

  /* Apply analog watchdog configuration */
  LL_ADC_SetAnalogWDScope(p_instance, (uint32_t)awd_instance, (uint32_t)p_config->group, (uint32_t)p_config->channel);

  if (p_config->channel != HAL_ADC_CHANNEL_NONE)
  {
    /* Thresholds computation: convert from numerical value to ADC peripheral digital value */
    adc_resolution = LL_ADC_GetResolution(p_instance);
    threshold_high_res = (int32_t)LL_ADC_ANALOGWD_SET_THRESHOLD_RES(adc_resolution, p_config->threshold_high);
    threshold_low_res = (int32_t)LL_ADC_ANALOGWD_SET_THRESHOLD_RES(adc_resolution, p_config->threshold_low);

