MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
    LL_ADC_SetAnalogWDThresholds(p_instance, (uint32_t)awd_instance, LL_ADC_AWD_THRESHOLD_HIGH, threshold_high_res);
    LL_ADC_SetAnalogWDThresholds(p_instance, (uint32_t)awd_instance, LL_ADC_AWD_THRESHOLD_LOW, threshold_low_res);

    if (awd_instance == HAL_ADC_AWD_1)
    {
      LL_ADC_SetAnalogWDFiltering(p_instance, (uint32_t)awd_instance, (uint32_t)p_config->filtering);
    }
  }

  return status;
}

/**
  * @brief  Get configuration of ADC analog watchdog.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  awd_instance Analog watchdog instance.
  * @param  p_config Pointer to a hal_adc_awd_config_t structure containing ADC analog watchdog configuration.
  * @note   Usage of the returned structure field "channel":
  *         To reinject this channel into another function HAL_ADC_xxx: the returned channel number
  *         is only partly formatted on definition of literals HAL_ADC_CHANNEL_x.
  *         Therefore, it has to be compared with literals HAL_ADC_CHANNEL_x using
  *         helper macro LL_ADC_CHANNEL_TO_DECIMAL_NB().
  * @note   Case of multiple channels monitored (AWD2 and AWD3 only): the channel value returned corresponds
  *         to the lowest one. If needed to check a specific channel, use LL_ADC_IsAnalogWDChannelMonitored().
  */
void HAL_ADC_GetConfigAnalogWD(const hal_adc_handle_t *hadc, hal_adc_awd_instance_t awd_instance,
                               hal_adc_awd_config_t *p_config)
{
  ADC_TypeDef *p_instance;
  uint32_t adc_resolution;
  int32_t threshold_high;
  int32_t threshold_low;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));
  ASSERT_DBG_PARAM(IS_ADC_AWD_INSTANCE(awd_instance));

  ASSERT_DBG_STATE(hadc->global_state, (hal_adc_state_t)((uint32_t)HAL_ADC_STATE_CONFIGURING
                                                         | (uint32_t)HAL_ADC_STATE_IDLE
                                                         | (uint32_t)HAL_ADC_STATE_ACTIVE));

  p_instance = ADC_GET_INSTANCE(hadc);

  p_config->group = (hal_adc_group_t)LL_ADC_GetAnalogWDScopeGroup(p_instance, (uint32_t)awd_instance);
  p_config->channel = (hal_adc_channel_t)LL_ADC_GetAnalogWDScopeChannel(p_instance, (uint32_t)awd_instance);

  if ((p_config->channel != HAL_ADC_CHANNEL_ALL) && (p_config->channel != HAL_ADC_CHANNEL_NONE))
  {
    /* Case unitary channel */
    p_config->channel = (hal_adc_channel_t)
                        ((uint32_t)LL_ADC_DECIMAL_NB_TO_CHANNEL(
                           LL_ADC_CHANNEL_TO_DECIMAL_NB(((uint32_t)p_config->channel))));
  }

  /* Thresholds computation: convert from numerical value to ADC peripheral digital value */
  threshold_high = LL_ADC_GetAnalogWDThresholds(p_instance, (uint32_t)awd_instance, LL_ADC_AWD_THRESHOLD_HIGH);
  threshold_low = LL_ADC_GetAnalogWDThresholds(p_instance, (uint32_t)awd_instance, LL_ADC_AWD_THRESHOLD_LOW);
  adc_resolution = LL_ADC_GetResolution(p_instance);
  p_config->threshold_high = (int32_t)LL_ADC_ANALOGWD_GET_THRESHOLD_RES(adc_resolution, threshold_high);
  p_config->threshold_low = (int32_t)LL_ADC_ANALOGWD_GET_THRESHOLD_RES(adc_resolution, threshold_low);

  if (awd_instance == HAL_ADC_AWD_1)
  {
    p_config->filtering = (hal_adc_awd_filtering_t)LL_ADC_GetAnalogWDFiltering(p_instance, (uint32_t)awd_instance);
  }
  else
  {
    p_config->filtering = HAL_ADC_AWD_FILTERING_NONE;
  }
}

/**
  * @brief  Configure ADC analog watchdog parameter: thresholds.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  awd_instance Analog watchdog instance.
  * @param  awd_threshold_sel Analog watchdog threshold selection (high or low)
  * @param  awd_threshold_value Analog watchdog threshold value. Value is signed and can exceed ADC resolution
  *         with post-processing computation (offset, oversampling, data shift, ...).
  *         Value between Min_Data=-4194304 (two's complement 0xFFC00000) and Max_Data=+4194303 (0x003FFFFF)
  * @note   Function intended to update analog watchdog thresholds whatever ADC conversion state, on the fly
  *         (other analog watchdog parameters require ADC deactivated or no conversion ongoing)
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_SetAnalogWDThresholds(hal_adc_handle_t *hadc, hal_adc_awd_instance_t awd_instance,
                                           hal_adc_awd_threshold_sel_t awd_threshold_sel, int32_t awd_threshold_value)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;
  uint32_t adc_resolution;
  int32_t threshold_value_res;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(IS_ADC_AWD_INSTANCE(awd_instance));
  ASSERT_DBG_PARAM(IS_ADC_AWD_THRESHOLD_SEL(awd_threshold_sel));
  ASSERT_DBG_PARAM(IS_ADC_AWD_THRESHOLD(awd_threshold_value));

  /* Analog watchdog thresholds can be updated even during ADC conversion */
  ASSERT_DBG_STATE(hadc->global_state,
                   (uint32_t)HAL_ADC_STATE_CONFIGURING |
                   (uint32_t)HAL_ADC_STATE_IDLE |
                   (uint32_t)HAL_ADC_STATE_ACTIVE);

  p_instance = ADC_GET_INSTANCE(hadc);

  /* Thresholds computation: convert from numerical value to ADC peripheral digital value */
  adc_resolution = LL_ADC_GetResolution(p_instance);
  threshold_value_res = (int32_t)LL_ADC_ANALOGWD_SET_THRESHOLD_RES(adc_resolution, awd_threshold_value);

  LL_ADC_SetAnalogWDThresholds(p_instance, (uint32_t)awd_instance, (uint32_t)awd_threshold_sel, threshold_value_res);

  return status;
}

/**
  * @brief  Get ADC analog watchdog parameter: thresholds.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  awd_instance Analog watchdog instance.
  * @param  awd_threshold_sel Analog watchdog threshold selection (high or low)
  * @note   Function intended to update analog watchdog thresholds whatever ADC conversion state, on the fly
  *         (other analog watchdog parameters require ADC deactivated or no conversion ongoing)
  * @retval Analog watchdog threshold value. Value is signed and can exceed ADC resolution
  *         with post-processing computation (offset, oversampling, data shift, ...).
  *         Value between Min_Data=-4194304 (two's complement 0xFFC00000) and Max_Data=+4194303 (0x003FFFFF)
  */
int32_t HAL_ADC_GetAnalogWDThresholds(const hal_adc_handle_t *hadc, hal_adc_awd_instance_t awd_instance,
                                      hal_adc_awd_threshold_sel_t awd_threshold_sel)
{
  ADC_TypeDef *p_instance;
  uint32_t adc_resolution;
  int32_t threshold_value;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(IS_ADC_AWD_INSTANCE(awd_instance));
  ASSERT_DBG_PARAM(IS_ADC_AWD_THRESHOLD_SEL(awd_threshold_sel));

  ASSERT_DBG_STATE(hadc->global_state, (hal_adc_state_t)((uint32_t)HAL_ADC_STATE_CONFIGURING
                                                         | (uint32_t)HAL_ADC_STATE_IDLE
                                                         | (uint32_t)HAL_ADC_STATE_ACTIVE));

  p_instance = ADC_GET_INSTANCE(hadc);

  /* Thresholds computation: convert from numerical value to ADC peripheral digital value */
  threshold_value = LL_ADC_GetAnalogWDThresholds(p_instance, (uint32_t)awd_instance, (uint32_t)awd_threshold_sel);
  adc_resolution = LL_ADC_GetResolution(p_instance);
  threshold_value = (int32_t)LL_ADC_ANALOGWD_GET_THRESHOLD_RES(adc_resolution, threshold_value);

  return threshold_value;
}

/**
  * @brief  Configure ADC analog watchdog parameter: ADC channel.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  awd_instance Analog watchdog instance.
  * @param  channel ADC channel to be monitored
  * @note   This function keeps unchanged ADC group configuration monitored by analog watchdog, must have been
  *         previously configured.
  *         For analog watchdog monitoring to be effective, the selected ADC channel must be converted by
  *         this ADC group.
  *         If needed to update it, use function @ref HAL_ADC_SetConfigAnalogWD().
  * @note   To monitor a list of channels (AWD2 and AWD3 only): call @ref HAL_ADC_SetConfigAnalogWD() once to configure
  *         all parameters with one channel, then this functions for each channels to add.
  *         Channels list can be flushed with parameter HAL_ADC_CHANNEL_NONE.
  * @note   Analog watchdog instances specificities: refer to description of "hal_adc_awd_instance_t".
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_SetAnalogWDChannel(hal_adc_handle_t *hadc, hal_adc_awd_instance_t awd_instance,
                                        hal_adc_channel_t channel)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;
  uint32_t group;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(IS_ADC_AWD_INSTANCE(awd_instance));
  ASSERT_DBG_PARAM(IS_ADC_CHANNEL(hadc->instance, channel));

  /* Required state: no conversion ongoing (implies global state can be idle or active) */
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_REGULAR],
                   (uint32_t)HAL_ADC_GROUP_STATE_RESET |
                   (uint32_t)HAL_ADC_GROUP_STATE_IDLE);
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_INJECTED],
                   (uint32_t)HAL_ADC_GROUP_STATE_RESET |
                   (uint32_t)HAL_ADC_GROUP_STATE_IDLE);

  p_instance = ADC_GET_INSTANCE(hadc);

  if (awd_instance == HAL_ADC_AWD_1)
  {
    if (channel == HAL_ADC_CHANNEL_NONE)
    {
      /* Case analog watchdog disable */
      group = LL_ADC_GROUP_NONE;
    }
    else
    {
      /* Case channel monitored update */
      group = (uint32_t)LL_ADC_GetAnalogWDScopeGroup(p_instance, (uint32_t)awd_instance);
    }

    /* Apply analog watchdog configuration */
    LL_ADC_SetAnalogWDScope(p_instance, (uint32_t)awd_instance, group, (uint32_t)channel);
  }
  else /* HAL_ADC_AWD_2, HAL_ADC_AWD_3 */
  {
    if (channel == HAL_ADC_CHANNEL_NONE)
    {
      /* Case analog watchdog disable */
      LL_ADC_SetAnalogWDChannelRem(p_instance, (uint32_t)awd_instance, LL_ADC_CHANNEL_ALL);
    }
    else
    {
      /* Case channel monitored update: add channel to list of monitored channels */
      LL_ADC_SetAnalogWDChannelAdd(p_instance, (uint32_t)awd_instance, (uint32_t)channel);
    }
  }

