MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  return status;
}

/**
  * @brief  Get ADC analog watchdog parameter: ADC channel.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  awd_instance Analog watchdog instance.
  * @note   This function does not return information of ADC group configuration monitored by analog watchdog.
  *         For analog watchdog monitoring to be effective, the selected ADC channel must be converted by
  *         this ADC group.
  *         If needed to retrieve it, use function @ref HAL_ADC_GetConfigAnalogWD().
  * @note   Usage of the returned channel value:
  *         To reinject this channel into another function HAL_ADC_xxx: the returned channel number
  *         is only partly formatted on definition of literals HAL_ADC_CHANNEL_x.
  *         Therefore, it has to be compared with literals HAL_ADC_CHANNEL_x using
  *         helper macro LL_ADC_CHANNEL_TO_DECIMAL_NB().
  * @note   Case of multiple channels monitored (AWD2 and AWD3 only): the channel value returned corresponds
  *         to the lowest one. If needed to check a specific channel, use LL_ADC_IsAnalogWDChannelMonitored().
  * @note   Analog watchdog instances specificities: refer to description of "hal_adc_awd_instance_t".
  * @retval ADC channel partially corresponding to literals of hal_adc_channel_t
  *         (the returned value is only partially formatted on definition of hal_adc_channel_t.
  *         It can be reinjected in other functions or used with LL_ADC_CHANNEL_TO_DECIMAL_NB())
  */
hal_adc_channel_t HAL_ADC_GetAnalogWDChannel(const hal_adc_handle_t *hadc, hal_adc_awd_instance_t awd_instance)
{
  ADC_TypeDef *p_instance;
  hal_adc_channel_t channel;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(IS_ADC_AWD_INSTANCE(awd_instance));

  ASSERT_DBG_STATE(hadc->global_state, (hal_adc_state_t)((uint32_t)HAL_ADC_STATE_CONFIGURING
                                                         | (uint32_t)HAL_ADC_STATE_IDLE
                                                         | (uint32_t)HAL_ADC_STATE_ACTIVE));

  p_instance = ADC_GET_INSTANCE(hadc);

  channel = (hal_adc_channel_t)LL_ADC_GetAnalogWDScopeChannel(p_instance, (uint32_t)awd_instance);

  if ((channel != HAL_ADC_CHANNEL_ALL) && (channel != HAL_ADC_CHANNEL_NONE))
  {
    /* Case unitary channel */
    channel = (hal_adc_channel_t)
              ((uint32_t)LL_ADC_DECIMAL_NB_TO_CHANNEL(LL_ADC_CHANNEL_TO_DECIMAL_NB((uint32_t)channel)));
  }

  return channel;
}

/**
  * @brief  Configure ADC oversampling.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  ovs_instance Oversampling instance.
  * @param  p_config Pointer to a hal_adc_ovs_config_t structure containing ADC oversampling configuration.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_SetConfigOverSampling(hal_adc_handle_t *hadc, hal_adc_ovs_instance_t ovs_instance,
                                           const hal_adc_ovs_config_t *p_config)
{
  STM32_UNUSED(ovs_instance); /* Function argument not used on this STM32 series */
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_ADC_OVS_INSTANCE(ovs_instance));
  ASSERT_DBG_PARAM(IS_ADC_OVS_SCOPE(p_config->scope));
  if (p_config->scope != HAL_ADC_OVS_DISABLE)
  {
    ASSERT_DBG_PARAM(IS_ADC_OVS_DISCONT(p_config->discont));
    ASSERT_DBG_PARAM(IS_ADC_OVS_RATIO(p_config->ratio));
    ASSERT_DBG_PARAM(IS_ADC_OVS_SHIFT(p_config->shift));
  }

  ASSERT_DBG_STATE(hadc->global_state,
                   (uint32_t)HAL_ADC_STATE_CONFIGURING |
                   (uint32_t)HAL_ADC_STATE_IDLE);

  p_instance = ADC_GET_INSTANCE(hadc);

  LL_ADC_SetOverSamplingScope(p_instance, (uint32_t)p_config->scope);

  if (p_config->scope != HAL_ADC_OVS_DISABLE)
  {
    LL_ADC_SetOverSamplingDiscont(p_instance, (uint32_t)p_config->discont);
    LL_ADC_ConfigOverSamplingRatioShift(p_instance, (uint32_t)p_config->ratio, ((uint32_t)p_config->shift));
  }

  return status;
}

/**
  * @brief  Get configuration of ADC oversampling.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  ovs_instance Oversampling instance.
  * @param  p_config Pointer to a hal_adc_ovs_config_t structure containing ADC oversampling configuration.
  */
void HAL_ADC_GetConfigOverSampling(const hal_adc_handle_t *hadc, hal_adc_ovs_instance_t ovs_instance,
                                   hal_adc_ovs_config_t *p_config)
{
  STM32_UNUSED(ovs_instance); /* Function argument not used on this STM32 series */
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));
  ASSERT_DBG_PARAM(IS_ADC_OVS_INSTANCE(ovs_instance));

  ASSERT_DBG_STATE(hadc->global_state, (hal_adc_state_t)((uint32_t)HAL_ADC_STATE_CONFIGURING
                                                         | (uint32_t)HAL_ADC_STATE_IDLE
                                                         | (uint32_t)HAL_ADC_STATE_ACTIVE));

  p_instance = ADC_GET_INSTANCE(hadc);

  p_config->scope = (hal_adc_ovs_scope_t)LL_ADC_GetOverSamplingScope(p_instance);
  p_config->discont = (hal_adc_ovs_discont_t)LL_ADC_GetOverSamplingDiscont(p_instance);
  p_config->ratio = (uint16_t)LL_ADC_GetOverSamplingRatio(p_instance);
  p_config->shift = (uint8_t)LL_ADC_GetOverSamplingShift(p_instance);
}

/**
  * @brief  Compute ADC oversampling right bit shift value in function of ratio to have oversampling data
  *         keeping current resolution (example: to keep data resolution, ratio x8 requires right shift of 3 bits).
  * @param  ratio ADC oversampling ratio, value must be from 1 to 1024 and a power of 2: {1; 2; 4; 8; ...; 1024}.
  * @note   Value intended to be used for parameter "shift" of @ref hal_adc_ovs_config_t.
  * @retval Value of right bit shift (number between Min_Data = 1 and Max_Data = 10)
  */
uint32_t HAL_ADC_GetOverSamplingShiftKeepRes(uint32_t ratio)
{
  uint32_t right_bit_shift;

  ASSERT_DBG_PARAM(IS_ADC_OVS_RATIO_POW_2(ratio));

  right_bit_shift = LL_ADC_OVS_SHIFT_KEEP_RES(ratio);

  return right_bit_shift;
}

/**
  * @brief  Configure ADC offset subblock features (offset level, sign, saturation, ...).
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  offset_instance Offset instance.
  * @param  p_config Pointer to a hal_adc_offset_config_t structure containing ADC offset configuration.
  * @note   To remove a channel from an offset instance, set configuration with channel to HAL_ADC_CHANNEL_NONE.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_SetConfigOffset(hal_adc_handle_t *hadc, hal_adc_offset_instance_t offset_instance,
                                     const hal_adc_offset_config_t *p_config)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;
  uint32_t offset_sign;
  uint32_t adc_resolution;
  uint32_t offset_level_processed;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_ADC_OFFSET_INSTANCE(offset_instance));
  ASSERT_DBG_PARAM(IS_ADC_CHANNEL(hadc->instance, p_config->channel));
  if (p_config->channel != HAL_ADC_CHANNEL_NONE)
  {
    ASSERT_DBG_PARAM(p_config->channel != HAL_ADC_CHANNEL_ALL);
    ASSERT_DBG_PARAM(IS_ADC_OFFSET_LEVEL(p_config->level));
    ASSERT_DBG_PARAM(IS_ADC_OFFSET_SAT_SIGN(p_config->saturation_signed));
    ASSERT_DBG_PARAM(IS_ADC_OFFSET_SAT_UNSIGN(p_config->saturation_unsigned));
  }

  ASSERT_DBG_STATE(hadc->global_state,
                   (uint32_t)HAL_ADC_STATE_CONFIGURING |
                   (uint32_t)HAL_ADC_STATE_IDLE);

  p_instance = ADC_GET_INSTANCE(hadc);

  LL_ADC_SetOffsetChannel(p_instance, (uint32_t)offset_instance, (uint32_t)p_config->channel);

  if (p_config->channel == HAL_ADC_CHANNEL_NONE)
  {
    LL_ADC_SetOffsetLevel(p_instance, (uint32_t)offset_instance, 0UL);
  }
  else
  {
    /* Manage offset level sign */
    if (p_config->level < 0L)
    {
      offset_level_processed = (uint32_t)(-p_config->level);
      offset_sign = LL_ADC_OFFSET_SIGN_NEGATIVE;
    }
    else
    {
      offset_level_processed = (uint32_t)p_config->level;
      offset_sign = LL_ADC_OFFSET_SIGN_POSITIVE;
    }

    /* Offset level computation: convert from numerical value to ADC peripheral digital value depending on resolution */
    adc_resolution = LL_ADC_GetResolution(p_instance);
    offset_level_processed = LL_ADC_OFFSET_SET_LEVEL_RES(adc_resolution, offset_level_processed);

    LL_ADC_SetOffsetLevel(p_instance, (uint32_t)offset_instance, offset_level_processed);
    LL_ADC_SetOffsetSign(p_instance, (uint32_t)offset_instance, offset_sign);
    LL_ADC_SetOffsetSignedSaturation(p_instance, (uint32_t)offset_instance, (uint32_t)p_config->saturation_signed);
    LL_ADC_SetOffsetUnsignedSaturation(p_instance, (uint32_t)offset_instance, (uint32_t)p_config->saturation_unsigned);
  }

