MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  return status;
}

/**
  * @brief  Get configuration of ADC offset subblock features (offset level, sign, saturation, ...).
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  offset_instance Offset instance.
  * @param  p_config Pointer to a hal_adc_offset_config_t structure containing ADC offset configuration.
  * @note   Usage of the returned structure field "channel":
  *         To reinject this channel into another function HAL_ADC_xxx: the returned channel number
  *         is only partly formatted on definition of literals HAL_ADC_CHANNEL_x.
  *         Therefore, it has to be compared with literals HAL_ADC_CHANNEL_x using
  *         helper macro LL_ADC_CHANNEL_TO_DECIMAL_NB().
  */
void HAL_ADC_GetConfigOffset(const hal_adc_handle_t *hadc,  hal_adc_offset_instance_t offset_instance,
                             hal_adc_offset_config_t *p_config)
{
  ADC_TypeDef *p_instance;
  uint32_t offset_sign;
  uint32_t adc_resolution;
  uint32_t offset_level_processed;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));
  ASSERT_DBG_PARAM(IS_ADC_OFFSET_INSTANCE(offset_instance));

  ASSERT_DBG_STATE(hadc->global_state, (hal_adc_state_t)((uint32_t)HAL_ADC_STATE_CONFIGURING
                                                         | (uint32_t)HAL_ADC_STATE_IDLE
                                                         | (uint32_t)HAL_ADC_STATE_ACTIVE));

  p_instance = ADC_GET_INSTANCE(hadc);

  p_config->channel = (hal_adc_channel_t)(LL_ADC_GetOffsetChannel(p_instance, (uint32_t) offset_instance));
  adc_resolution = LL_ADC_GetResolution(p_instance);
  offset_level_processed = LL_ADC_GetOffsetLevel(p_instance, (uint32_t)offset_instance);
  offset_level_processed = LL_ADC_OFFSET_GET_LEVEL_RES(adc_resolution, offset_level_processed);

  /* Manage offset level sign */
  offset_level_processed = (offset_level_processed & ADC_OFR_OFFSET); /* Explicitly limit value to register
  bitfield range to avoid compiler warning of potential overflow */
  offset_sign = LL_ADC_GetOffsetSign(p_instance, (uint32_t)offset_instance);
  if (offset_sign == LL_ADC_OFFSET_SIGN_NEGATIVE)
  {
    p_config->level = -((int32_t)offset_level_processed);
  }
  else
  {
    p_config->level = (int32_t)offset_level_processed;
  }

  p_config->saturation_signed = (hal_adc_offset_sat_sign_state_t)
                                LL_ADC_GetOffsetSignedSaturation(p_instance, (uint32_t)offset_instance);
  p_config->saturation_unsigned = (hal_adc_offset_sat_unsign_state_t)
                                  LL_ADC_GetOffsetUnsignedSaturation(p_instance, (uint32_t)offset_instance);
}

/**
  * @brief  Set ADC offset subblock parameter: offset level.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  offset_instance Offset instance.
  * @param  offset_level ADC offset level (signed value between Min_Data= -1*0x003FFFFF (two's complement 0xFFC00001)
  *         and Max_Data=0x003FFFFF).
  * @note   Other ADC offset subblock parameters can be set using @ref HAL_ADC_SetConfigOffset().
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_SetOffsetLevel(hal_adc_handle_t *hadc,  hal_adc_offset_instance_t offset_instance,
                                    int32_t offset_level)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;
  uint32_t offset_sign;
  uint32_t adc_resolution;
  uint32_t offset_level_processed;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(IS_ADC_OFFSET_INSTANCE(offset_instance));
  ASSERT_DBG_PARAM(IS_ADC_OFFSET_LEVEL(offset_level));

  ASSERT_DBG_STATE(hadc->global_state,
                   (uint32_t)HAL_ADC_STATE_CONFIGURING |
                   (uint32_t)HAL_ADC_STATE_IDLE);

  p_instance = ADC_GET_INSTANCE(hadc);

  /* Manage offset level sign */
  if (offset_level < 0L)
  {
    offset_level_processed = (uint32_t)(-offset_level);
    offset_sign = LL_ADC_OFFSET_SIGN_NEGATIVE;
  }
  else
  {
    offset_level_processed = (uint32_t)offset_level;
    offset_sign = LL_ADC_OFFSET_SIGN_POSITIVE;
  }

  /* Offset level computation: convert from numerical value to ADC peripheral digital value depending on resolution */
  adc_resolution = LL_ADC_GetResolution(p_instance);
  offset_level_processed = LL_ADC_OFFSET_SET_LEVEL_RES(adc_resolution, offset_level_processed);

  LL_ADC_SetOffsetLevel(p_instance, (uint32_t)offset_instance, offset_level_processed);
  LL_ADC_SetOffsetSign(p_instance, (uint32_t)offset_instance, offset_sign);

  return status;
}

/**
  * @brief  Get ADC offset subblock parameter: offset level.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  offset_instance Offset instance.
  * @note   Other ADC offset subblock parameters can be retrieved using @ref HAL_ADC_GetConfigOffset().
  * @retval ADC offset level (signed value between Min_Data= -1*0x003FFFFF (two's complement 0xFFC00001)
  *         and Max_Data=0x003FFFFF).
  */
int32_t HAL_ADC_GetOffsetLevel(const hal_adc_handle_t *hadc, hal_adc_offset_instance_t offset_instance)
{
  ADC_TypeDef *p_instance;
  uint32_t offset_sign;
  uint32_t adc_resolution;
  uint32_t offset_level_processed;
  int32_t offset_level;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(IS_ADC_OFFSET_INSTANCE(offset_instance));

  ASSERT_DBG_STATE(hadc->global_state, (hal_adc_state_t)((uint32_t)HAL_ADC_STATE_CONFIGURING
                                                         | (uint32_t)HAL_ADC_STATE_IDLE
                                                         | (uint32_t)HAL_ADC_STATE_ACTIVE));

  p_instance = ADC_GET_INSTANCE(hadc);

  /* Thresholds computation: convert from ADC peripheral digital value to numerical value depending on resolution */
  adc_resolution = LL_ADC_GetResolution(p_instance);
  offset_level_processed = LL_ADC_GetOffsetLevel(p_instance, (uint32_t)offset_instance);
  offset_level_processed = LL_ADC_OFFSET_GET_LEVEL_RES(adc_resolution, offset_level_processed);

  /* Manage offset level sign */
  offset_sign = LL_ADC_GetOffsetSign(p_instance, (uint32_t)offset_instance);
  if (offset_sign == LL_ADC_OFFSET_SIGN_NEGATIVE)
  {
    offset_level = -((int32_t)offset_level_processed);
  }
  else
  {
    offset_level = (int32_t)offset_level_processed;
  }

  return offset_level;
}

/**
  * @}
  */

/** @addtogroup ADC_Exported_Functions_Group3
  * @{
    Set of function to handle the ADC interruptions :
      + HAL_ADC_IRQHandler(): Handle all ADC interrupt requests
      + HAL_ADC_IRQHandler_REG(): Handle ADC interrupt requests optimized: specific to ADC group regular
      + HAL_ADC_IRQHandler_INJ(): Handle ADC interrupt requests optimized: specific to ADC group injected
      + HAL_ADC_IRQHandler_AWD(): Handle ADC interrupt requests optimized: specific to ADC analog watchdog
  */

/**
  * @brief  Handle all ADC interrupt requests.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @note   For optimized process of specific interrupts, refer to other HAL_ADC_IRQHandler_x functions.
  */
void HAL_ADC_IRQHandler(hal_adc_handle_t *hadc)
{
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  p_instance = ADC_GET_INSTANCE(hadc);

  uint32_t flag_status = LL_ADC_READ_REG(p_instance, ISR);
  uint32_t it_sources = LL_ADC_READ_REG(p_instance, IER);
  uint32_t flag_status_masked = flag_status & it_sources; /* Logical AND with flags status and interrupts sources
                                                             (registers bitfields aligned) */

  if ((flag_status_masked & LL_ADC_FLAG_EOC) != 0UL)
  {
    LL_ADC_ClearFlag_EOC(p_instance);

    if (hadc->group_conv_per_start[ADC_GROUP_REGULAR] == HAL_ADC_GROUP_CONV_UNIT)
    {
      hadc->group_state[ADC_GROUP_REGULAR] = HAL_ADC_GROUP_STATE_IDLE;
    }

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->p_reg_eoc_cb(hadc);
#else
    HAL_ADC_REG_UnitaryConvCpltCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_ADC_FLAG_EOS) != 0UL)
  {
    LL_ADC_ClearFlag_EOS(p_instance);

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->p_reg_eos_cb(hadc);
#else
    HAL_ADC_REG_SequenceConvCpltCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
  }

