MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  if ((flag_status_masked & LL_ADC_FLAG_OVR) != 0UL)
  {
    LL_ADC_ClearFlag_OVR(p_instance);
#if defined(USE_HAL_ADC_GET_LAST_ERRORS) && (USE_HAL_ADC_GET_LAST_ERRORS == 1)
    hadc->last_error_codes |= HAL_ADC_REG_ERROR_OVR;
#endif /* USE_HAL_ADC_GET_LAST_ERRORS */

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->p_error_cb(hadc);
#else
    HAL_ADC_ErrorCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_ADC_FLAG_EOSMP) != 0UL)
  {
    LL_ADC_ClearFlag_EOSMP(p_instance);

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->p_reg_end_of_sampling_cb(hadc);
#else
    HAL_ADC_REG_EndOfSamplingCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_ADC_FLAG_JEOC) != 0UL)
  {
    LL_ADC_ClearFlag_JEOC(p_instance);

    if (hadc->group_conv_per_start[ADC_GROUP_INJECTED] == HAL_ADC_GROUP_CONV_UNIT)
    {
      hadc->group_state[ADC_GROUP_INJECTED] = HAL_ADC_GROUP_STATE_IDLE;
    }

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->p_inj_eoc_cb(hadc);
#else
    HAL_ADC_INJ_UnitaryConvCpltCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_ADC_FLAG_JEOS) != 0UL)
  {
    LL_ADC_ClearFlag_JEOS(p_instance);

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->p_inj_eos_cb(hadc);
#else
    HAL_ADC_INJ_SequenceConvCpltCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_ADC_FLAG_AWD1) != 0UL)
  {
    LL_ADC_ClearFlag_AWD1(p_instance);

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->p_awd_out_window_cb(hadc, HAL_ADC_AWD_1);
#else
    HAL_ADC_AnalogWD_OutOfWindowCallback(hadc, HAL_ADC_AWD_1);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_ADC_FLAG_AWD2) != 0UL)
  {
    LL_ADC_ClearFlag_AWD2(p_instance);

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->p_awd_out_window_cb(hadc, HAL_ADC_AWD_2);
#else
    HAL_ADC_AnalogWD_OutOfWindowCallback(hadc, HAL_ADC_AWD_2);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_ADC_FLAG_AWD3) != 0UL)
  {
    LL_ADC_ClearFlag_AWD3(p_instance);

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->p_awd_out_window_cb(hadc, HAL_ADC_AWD_3);
#else
    HAL_ADC_AnalogWD_OutOfWindowCallback(hadc, HAL_ADC_AWD_3);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  Handle ADC interrupt requests optimized: specific to ADC group regular.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @note   For generic process of all ADC interrupts request, use function HAL_ADC_IRQHandler().
  */
void HAL_ADC_IRQHandler_REG(hal_adc_handle_t *hadc)
{
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  p_instance = ADC_GET_INSTANCE(hadc);

  uint32_t flag_status = LL_ADC_READ_REG(p_instance, ISR);
  uint32_t it_sources = LL_ADC_READ_REG(p_instance, IER);
  uint32_t flag_status_masked = flag_status & it_sources; /* Logical AND with flags status and interrupts sources
                                                             (registers bitfields aligned) */

  if ((flag_status_masked & LL_ADC_FLAG_EOC) != 0UL)
  {
    LL_ADC_ClearFlag_EOC(p_instance);

    if (hadc->group_conv_per_start[ADC_GROUP_REGULAR] == HAL_ADC_GROUP_CONV_UNIT)
    {
      hadc->group_state[ADC_GROUP_REGULAR] = HAL_ADC_GROUP_STATE_IDLE;
    }

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->p_reg_eoc_cb(hadc);
#else
    HAL_ADC_REG_UnitaryConvCpltCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_ADC_FLAG_EOS) != 0UL)
  {
    LL_ADC_ClearFlag_EOS(p_instance);

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->p_reg_eos_cb(hadc);
#else
    HAL_ADC_REG_SequenceConvCpltCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_ADC_FLAG_OVR) != 0UL)
  {
    LL_ADC_ClearFlag_OVR(p_instance);
#if defined(USE_HAL_ADC_GET_LAST_ERRORS) && (USE_HAL_ADC_GET_LAST_ERRORS == 1)
    hadc->last_error_codes |= HAL_ADC_REG_ERROR_OVR;
#endif /* USE_HAL_ADC_GET_LAST_ERRORS */

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->p_error_cb(hadc);
#else
    HAL_ADC_ErrorCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_ADC_FLAG_EOSMP) != 0UL)
  {
    LL_ADC_ClearFlag_EOSMP(p_instance);

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->p_reg_end_of_sampling_cb(hadc);
#else
    HAL_ADC_REG_EndOfSamplingCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  Handle ADC interrupt requests optimized: specific to ADC group injected.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @note   For generic process of all ADC interrupts request, use function HAL_ADC_IRQHandler().
  */
void HAL_ADC_IRQHandler_INJ(hal_adc_handle_t *hadc)
{
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  p_instance = ADC_GET_INSTANCE(hadc);

  uint32_t flag_status = LL_ADC_READ_REG(p_instance, ISR);
  uint32_t it_sources = LL_ADC_READ_REG(p_instance, IER);
  uint32_t flag_status_masked = flag_status & it_sources; /* Logical AND with flags status and interrupts sources
                                                             (registers bitfields aligned) */

  if ((flag_status_masked & LL_ADC_FLAG_JEOC) != 0UL)
  {
    LL_ADC_ClearFlag_JEOC(p_instance);

    if (hadc->group_conv_per_start[ADC_GROUP_INJECTED] == HAL_ADC_GROUP_CONV_UNIT)
    {
      hadc->group_state[ADC_GROUP_INJECTED] = HAL_ADC_GROUP_STATE_IDLE;
    }

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->p_inj_eoc_cb(hadc);
#else
    HAL_ADC_INJ_UnitaryConvCpltCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_ADC_FLAG_JEOS) != 0UL)
  {
    LL_ADC_ClearFlag_JEOS(p_instance);

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->p_inj_eos_cb(hadc);
#else
    HAL_ADC_INJ_SequenceConvCpltCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  Handle ADC interrupt requests optimized: specific to ADC analog watchdog.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @note   For generic process of all ADC interrupts request, use function HAL_ADC_IRQHandler().
  */
void HAL_ADC_IRQHandler_AWD(hal_adc_handle_t *hadc)
{
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  p_instance = ADC_GET_INSTANCE(hadc);

  uint32_t flag_status = LL_ADC_READ_REG(p_instance, ISR);
  uint32_t it_sources = LL_ADC_READ_REG(p_instance, IER);
  uint32_t flag_status_masked = flag_status & it_sources; /* Logical AND with flags status and interrupts sources
                                                             (registers bitfields aligned) */

