MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  if ((flag_status_masked & LL_ADC_FLAG_AWD1) != 0UL)
  {
    LL_ADC_ClearFlag_AWD1(p_instance);

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->p_awd_out_window_cb(hadc, HAL_ADC_AWD_1);
#else
    HAL_ADC_AnalogWD_OutOfWindowCallback(hadc, HAL_ADC_AWD_1);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_ADC_FLAG_AWD2) != 0UL)
  {
    LL_ADC_ClearFlag_AWD2(p_instance);

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->p_awd_out_window_cb(hadc, HAL_ADC_AWD_2);
#else
    HAL_ADC_AnalogWD_OutOfWindowCallback(hadc, HAL_ADC_AWD_2);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_ADC_FLAG_AWD3) != 0UL)
  {
    LL_ADC_ClearFlag_AWD3(p_instance);

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->p_awd_out_window_cb(hadc, HAL_ADC_AWD_3);
#else
    HAL_ADC_AnalogWD_OutOfWindowCallback(hadc, HAL_ADC_AWD_3);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  HAL ADC error callback.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  */
__WEAK void HAL_ADC_ErrorCallback(hal_adc_handle_t *hadc)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hadc);

  /* Warning : This function must not be modified. When the callback is needed, function
               HAL_ADC_ErrorCallback() can be implemented in the user file. */
}

/**
  * @brief  ADC group regular end of sampling phase callback.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @note   ADC conversion has 2 phases (sampling, SAR conversion). Conversion data is available upon
  *         conversion complete callbacks.
  * @note   Sampling phase duration can be set using ADC channel sampling time.
  */
__WEAK void HAL_ADC_REG_EndOfSamplingCallback(hal_adc_handle_t *hadc)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hadc);

  /* Warning : This function must not be modified. When the callback is needed, function
               HAL_ADC_REG_EndOfSamplingCallback() can be implemented in the user file. */
}

/**
  * @brief  ADC group regular end of unitary conversion callback.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  */
__WEAK void HAL_ADC_REG_UnitaryConvCpltCallback(hal_adc_handle_t *hadc)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hadc);

  /* Warning : This function must not be modified. When the callback is needed, function
               HAL_ADC_REG_UnitaryConvCpltCallback() can be implemented in the user file. */
}

/**
  * @brief  ADC group regular end of sequence conversions callback.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  */
__WEAK void HAL_ADC_REG_SequenceConvCpltCallback(hal_adc_handle_t *hadc)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hadc);

  /* Warning : This function must not be modified. When the callback is needed, function
               HAL_ADC_REG_SequenceConvCpltCallback() can be implemented in the user file. */
}

#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
/**
  * @brief  ADC group regular conversion data buffer half transfer.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  */
__WEAK void HAL_ADC_REG_DataTransferHalfCallback(hal_adc_handle_t *hadc)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hadc);

  /* Warning : This function must not be modified. When the callback is needed, function
               HAL_ADC_REG_DataTransferHalfCallback() can be implemented in the user file. */
}

/**
  * @brief  ADC group regular conversion data buffer transfer complete.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  */
__WEAK void HAL_ADC_REG_DataTransferCpltCallback(hal_adc_handle_t *hadc)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hadc);

  /* Warning : This function must not be modified. When the callback is needed, function
               HAL_ADC_REG_DataTransferCpltCallback() can be implemented in the user file. */
}

/**
  * @brief  ADC group regular conversion data transfer abort.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  */
__WEAK void HAL_ADC_REG_DataTransferStopCallback(hal_adc_handle_t *hadc)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hadc);

  /* Warning : This function must not be modified. When the callback is needed, function
               HAL_ADC_REG_DataTransferStopCallback() can be implemented in the user file. */
}
#endif /* USE_HAL_ADC_DMA */

/**
  * @brief  ADC group injected end of unitary conversion callback.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  */
__WEAK void HAL_ADC_INJ_UnitaryConvCpltCallback(hal_adc_handle_t *hadc)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hadc);

  /* Warning : This function must not be modified. When the callback is needed, function
               HAL_ADC_INJ_UnitaryConvCpltCallback() can be implemented in the user file. */
}

/**
  * @brief  ADC group injected end of sequence conversions callback.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  */
__WEAK void HAL_ADC_INJ_SequenceConvCpltCallback(hal_adc_handle_t *hadc)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hadc);

  /* Warning : This function must not be modified. When the callback is needed, function
               HAL_ADC_INJ_SequenceConvCpltCallback() can be implemented in the user file. */
}

/**
  * @brief  ADC group regular analog watchdog out of window event callback.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  awd_instance Analog watchdog instance
  */
__WEAK void HAL_ADC_AnalogWD_OutOfWindowCallback(hal_adc_handle_t *hadc, hal_adc_awd_instance_t awd_instance)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hadc);
  STM32_UNUSED(awd_instance);

  /* Warning : This function must not be modified. When the callback is needed, function
               HAL_ADC_AnalogWD_OutOfWindowCallback() can be implemented in the user file. */
}

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register ADC error callback function to be used in place of
  *         the weak HAL_ADC_ErrorCallback() predefined callback.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_callback Pointer to the hal_adc_cb_t callback function.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_OK    Register completed successfully.
  * @retval HAL_ERROR Register completed with error.
  */
hal_status_t HAL_ADC_RegisterErrorCallback(hal_adc_handle_t *hadc, hal_adc_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hadc->p_error_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register ADC group regular end of sampling phase callback function to be used in place of
  *         the weak HAL_ADC_REG_EndOfSamplingCallback() predefined callback.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_callback Pointer to the hal_adc_cb_t callback function.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_OK    Register completed successfully.
  * @retval HAL_ERROR Register completed with error.
  */
hal_status_t HAL_ADC_RegisterRegEndOfSamplingCallback(hal_adc_handle_t *hadc, hal_adc_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

