MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  hadc->p_reg_end_of_sampling_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register ADC group regular end of unitary conversion callback to be used in place of
  *         the weak HAL_ADC_REG_UnitaryConvCpltCallback() predefined callback.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_callback Pointer to the hal_adc_cb_t callback function.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_OK    Register completed successfully.
  * @retval HAL_ERROR Register completed with error.
  */
hal_status_t HAL_ADC_RegisterRegUnitaryConvCpltCallback(hal_adc_handle_t *hadc, hal_adc_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hadc->p_reg_eoc_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register ADC group regular end of sequence conversions callback function to be used in place of
  *         the weak HAL_ADC_REG_SequenceConvCpltCallback() predefined callback.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_callback Pointer to the hal_adc_cb_t callback function.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_OK    Register completed successfully.
  * @retval HAL_ERROR Register completed with error.
  */
hal_status_t HAL_ADC_RegisterRegSequenceConvCpltCallback(hal_adc_handle_t *hadc, hal_adc_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hadc->p_reg_eos_cb = p_callback;

  return HAL_OK;
}

#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
/**
  * @brief  Register ADC group regular conv data buffer half transfer callback function to be used in place of
  *         the weak HAL_ADC_REG_DataTransferHalfCallback() predefined callback.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_callback Pointer to the hal_adc_cb_t callback function.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_OK    Register completed successfully.
  * @retval HAL_ERROR Register completed with error.
  */
hal_status_t HAL_ADC_RegisterDataTransferHalfCallback(hal_adc_handle_t *hadc, hal_adc_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hadc->p_reg_xfer_half_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register ADC group regular conv data buffer transfer complete callback function to be used in place of
  *         the weak HAL_ADC_REG_DataTransferCpltCallback() predefined callback.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_callback Pointer to the hal_adc_cb_t callback function.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_OK    Register completed successfully.
  * @retval HAL_ERROR Register completed with error.
  */
hal_status_t HAL_ADC_RegisterDataTransferCpltCallback(hal_adc_handle_t *hadc, hal_adc_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hadc->p_reg_xfer_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register ADC group regular conv data transfer abort callback function to be used in place of
  *         the weak HAL_ADC_REG_DataTransferStopCallback() predefined callback.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_callback Pointer to the hal_adc_cb_t callback function.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_OK    Register completed successfully.
  * @retval HAL_ERROR Register completed with error.
  */
hal_status_t HAL_ADC_RegisterDataTransferStopCallback(hal_adc_handle_t *hadc, hal_adc_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hadc->p_reg_xfer_stop_cb = p_callback;

  return HAL_OK;
}
#endif /* USE_HAL_ADC_DMA */

/**
  * @brief  Register ADC group injected end of unitary conversion callback to be used in place of
  *         the weak HAL_ADC_INJ_UnitaryConvCpltCallback() predefined callback.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_callback Pointer to the hal_adc_cb_t callback function.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_OK    Register completed successfully.
  * @retval HAL_ERROR Register completed with error.
  */
hal_status_t HAL_ADC_RegisterInjUnitaryConvCpltCallback(hal_adc_handle_t *hadc, hal_adc_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hadc->p_inj_eoc_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register ADC group injected end of sequence conversions callback function to be used in place of
  *         the weak HAL_ADC_INJ_SequenceConvCpltCallback() predefined callback.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_callback Pointer to the hal_adc_cb_t callback function.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_OK    Register completed successfully.
  * @retval HAL_ERROR Register completed with error.
  */
hal_status_t HAL_ADC_RegisterInjSequenceConvCpltCallback(hal_adc_handle_t *hadc, hal_adc_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

