MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  hadc->p_inj_eos_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register ADC analog watchdog out of window event callback function to be used in place of
  *         the weak HAL_ADC_AnalogWD_OutOfWindowCallback() predefined callback.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_callback Pointer to the hal_adc_awd_cb_t callback function.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_OK    Register completed successfully.
  * @retval HAL_ERROR Register completed with error.
  */
hal_status_t HAL_ADC_RegisterAwdOutOfWindowCallback(hal_adc_handle_t *hadc, hal_adc_awd_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hadc->p_awd_out_window_cb = p_callback;

  return HAL_OK;
}
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @addtogroup ADC_Exported_Functions_Group4
  * @{
    Set of function to handle the HAL ADC driver state, errors, kernel clock frequency:
      + HAL_ADC_GetState(): Retrieve the HAL ADC global state
      + HAL_ADC_GetStateGroup(): Retrieve the HAL ADC groups (regular, injected) state
      + HAL_ADC_GetStateCommon(): Retrieve the HAL ADC handle link to common instance state
      + HAL_ADC_GetLastErrorCodes(): Retrieve the HAL ADC last error codes
      + HAL_ADC_GetClockFreq(): Retrieve the HAL ADC instance kernel clock frequency
  */

/**
  * @brief  Retrieve the HAL ADC global state.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @retval hal_adc_state_t HAL ADC global state
  */
hal_adc_state_t HAL_ADC_GetState(const hal_adc_handle_t *hadc)
{
  ASSERT_DBG_PARAM((hadc != NULL));

  return hadc->global_state;
}

/**
  * @brief  Retrieve the HAL ADC groups (regular, injected) state.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  group ADC group from which conversion data is compared to thresholds
  *         This parameter can be one of the following values:
  *         @arg @ref HAL_ADC_GROUP_REGULAR
  *         @arg @ref HAL_ADC_GROUP_INJECTED
  * @retval hal_adc_group_state_t HAL ADC global state
  */
hal_adc_group_state_t HAL_ADC_GetStateGroup(const hal_adc_handle_t *hadc, hal_adc_group_t group)
{
  ASSERT_DBG_PARAM((hadc != NULL));

  return hadc->group_state[(uint8_t)group - 1U];
}

/**
  * @brief  Retrieve the HAL ADC handle link to common instance state.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @retval hal_adc_common_state_t HAL ADC global state
  */
hal_adc_common_state_t HAL_ADC_GetStateCommon(const hal_adc_handle_t *hadc)
{
  ASSERT_DBG_PARAM((hadc != NULL));

  return hadc->common_state;
}

#if defined(USE_HAL_ADC_GET_LAST_ERRORS) && (USE_HAL_ADC_GET_LAST_ERRORS == 1)
/**
  * @brief  Retrieve the HAL ADC last error codes.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @retval uint32_t last error code.
  *         This parameter can be a combination (bitfields) of the following values: \n
  *         @arg @ref HAL_ADC_ERROR_NONE
  *         @arg @ref HAL_ADC_ERROR_INTERNAL
  *         @arg @ref HAL_ADC_REG_ERROR_OVR
  *         @arg @ref HAL_ADC_REG_ERROR_DMA
  */
uint32_t HAL_ADC_GetLastErrorCodes(const hal_adc_handle_t *hadc)
{
  ASSERT_DBG_PARAM((hadc != NULL));

  return hadc->last_error_codes;
}
#endif /* USE_HAL_ADC_GET_LAST_ERRORS */

/** @brief  Return the peripheral clock frequency for ADC.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @note   Clock frequency corresponds to ADC kernel clock, including clock source and prescaler configurations
  *         from all related modules (RCC and ADC).
  * @retval uint32_t Frequency in Hz.
  *                  0 if the source clock of the ADC is not configured or not ready.
  */
uint32_t HAL_ADC_GetClockFreq(const hal_adc_handle_t *hadc)
{
  ASSERT_DBG_PARAM((hadc != NULL));
  ASSERT_DBG_STATE(hadc->global_state, (hal_adc_state_t)((uint32_t)HAL_ADC_STATE_INIT
                                                         | (uint32_t)HAL_ADC_STATE_CONFIGURING
                                                         | (uint32_t)HAL_ADC_STATE_CALIB
                                                         | (uint32_t)HAL_ADC_STATE_IDLE
                                                         | (uint32_t)HAL_ADC_STATE_ACTIVE));

#if !defined(USE_ASSERT_DBG_STATE) && !defined(USE_ASSERT_DBG_PARAM)
  STM32_UNUSED(hadc);
#endif /* USE_ASSERT_DBG_STATE or USE_ASSERT_DBG_PARAM */

  return HAL_RCC_ADC_GetKernelClkFreq(ADC_GET_INSTANCE(hadc));
}

/**
  * @}
  */

/** @addtogroup ADC_Exported_Functions_Group5
  * @{
    Set of functions allowing to operate ADCx peripheral.
      + Activation and deactivation
      + Calibration
      + ADC conversions management
    @note For more details, refer to state machine diagram or "How to use the ADC HAL module driver" section).
  */

/**
  * @brief  Activate ADC instance.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_Start(hal_adc_handle_t *hadc)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);

  ASSERT_DBG_STATE(hadc->global_state, HAL_ADC_STATE_IDLE);

  p_instance = ADC_GET_INSTANCE(hadc);

  /* Verify configuration compliance to hardware constraints:
     with operation on group injected, specific sampling mode cannot be used */
  if (hadc->group_state[ADC_GROUP_INJECTED] == HAL_ADC_GROUP_STATE_IDLE)
  {
    if (LL_ADC_GetSamplingMode(p_instance) != LL_ADC_SAMPLING_MODE_NORMAL)
    {
      status = HAL_ERROR;
    }
  }

  if (status == HAL_OK)
  {
    HAL_CHECK_UPDATE_STATE(hadc, global_state,
                           HAL_ADC_STATE_IDLE,
                           HAL_ADC_STATE_ACTIVE);

    if (LL_ADC_INJ_GetTrigAuto(p_instance) == LL_ADC_INJ_TRIG_FROM_REGULAR)
    {
      HAL_CHECK_UPDATE_STATE(hadc, group_state[ADC_GROUP_INJECTED],
                             HAL_ADC_GROUP_STATE_IDLE,
                             HAL_ADC_GROUP_STATE_ACTIVE);
    }

    status = adc_activate(hadc);
  }

