MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  return status;
}

/**
  * @brief  Deactivate ADC instance.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_Stop(hal_adc_handle_t *hadc)
{
  hal_status_t status;
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);

  ASSERT_DBG_STATE(hadc->global_state, HAL_ADC_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_REGULAR],
                   (uint32_t)HAL_ADC_GROUP_STATE_RESET |
                   (uint32_t)HAL_ADC_GROUP_STATE_IDLE);

  p_instance = ADC_GET_INSTANCE(hadc);

  if (LL_ADC_INJ_GetTrigAuto(p_instance) == LL_ADC_INJ_TRIG_FROM_REGULAR)
  {
    ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_INJECTED],
                     (uint32_t)HAL_ADC_GROUP_STATE_RESET |
                     (uint32_t)HAL_ADC_GROUP_STATE_IDLE |
                     (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE);
  }
  else
  {
    ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_INJECTED],
                     (uint32_t)HAL_ADC_GROUP_STATE_RESET |
                     (uint32_t)HAL_ADC_GROUP_STATE_IDLE);
  }

  status = adc_deactivate(hadc);

  /* Clear flags and interruptions */
  LL_ADC_ClearFlag(p_instance, LL_ADC_FLAG_ALL);
  LL_ADC_DisableIT(p_instance, LL_ADC_IT_ALL);

  if (LL_ADC_INJ_GetTrigAuto(p_instance) == LL_ADC_INJ_TRIG_FROM_REGULAR)
  {
    hadc->group_state[ADC_GROUP_INJECTED] = HAL_ADC_GROUP_STATE_IDLE;
  }

  hadc->global_state = HAL_ADC_STATE_IDLE;

  return status;
}

/**
  * @brief  Perform self-calibration of ADC instance.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_Calibrate(hal_adc_handle_t *hadc)
{
  hal_status_t status;

  ASSERT_DBG_PARAM(hadc != NULL);

  ASSERT_DBG_STATE(hadc->global_state, HAL_ADC_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_REGULAR],
                   (uint32_t)HAL_ADC_GROUP_STATE_RESET |
                   (uint32_t)HAL_ADC_GROUP_STATE_IDLE);
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_INJECTED],
                   (uint32_t)HAL_ADC_GROUP_STATE_RESET |
                   (uint32_t)HAL_ADC_GROUP_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hadc, global_state, HAL_ADC_STATE_ACTIVE, HAL_ADC_STATE_CALIB);

  status = adc_calibrate(hadc);

  if (status == HAL_OK)
  {
    hadc->global_state = HAL_ADC_STATE_ACTIVE;
  }

  return status;
}

/**
  * @brief  Get ADC instance calibration factors.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_calib Pointer to a hal_adc_calib_t structure containing calibration data.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_GetCalibrationFactor(hal_adc_handle_t *hadc, hal_adc_calib_t *p_calib)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(p_calib != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_calib == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hadc->global_state, HAL_ADC_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_REGULAR],
                   (uint32_t)HAL_ADC_GROUP_STATE_RESET |
                   (uint32_t)HAL_ADC_GROUP_STATE_IDLE);
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_INJECTED],
                   (uint32_t)HAL_ADC_GROUP_STATE_RESET |
                   (uint32_t)HAL_ADC_GROUP_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hadc, global_state, HAL_ADC_STATE_ACTIVE, HAL_ADC_STATE_CALIB);

  p_instance = ADC_GET_INSTANCE(hadc);

  p_calib->factors[0] = LL_ADC_GetCalibrationFactor(p_instance, LL_ADC_IN_SINGLE_ENDED);

  hadc->global_state = HAL_ADC_STATE_ACTIVE;

  return status;
}

/**
  * @brief  Set ADC instance calibration factors.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_calib Pointer to a hal_adc_calib_t structure containing calibration data.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_SetCalibrationFactor(hal_adc_handle_t *hadc, const hal_adc_calib_t *p_calib)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(p_calib != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_calib == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hadc->global_state, HAL_ADC_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_REGULAR],
                   (uint32_t)HAL_ADC_GROUP_STATE_RESET |
                   (uint32_t)HAL_ADC_GROUP_STATE_IDLE);
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_INJECTED],
                   (uint32_t)HAL_ADC_GROUP_STATE_RESET |
                   (uint32_t)HAL_ADC_GROUP_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hadc, global_state, HAL_ADC_STATE_ACTIVE, HAL_ADC_STATE_CALIB);

  p_instance = ADC_GET_INSTANCE(hadc);

  LL_ADC_SetCalibrationFactor(p_instance, LL_ADC_IN_SINGLE_ENDED, p_calib->factors[0]);

  hadc->global_state = HAL_ADC_STATE_ACTIVE;

  return status;
}

/**
  * @brief  Poll for ADC event.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  event Value of hal_adc_event_t
  * @param  timeout_ms ADC conversion timeout value (unit: ms)
  * @note   HAL ADC state machine is not updated by this function
  *         (on the contrary to other polling functions: HAL_ADC_REG_PollForConv(), ...)
  * @retval HAL_TIMEOUT       Operation exceeds user timeout
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_PollForEvent(hal_adc_handle_t *hadc, hal_adc_event_t event, uint32_t timeout_ms)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;
  uint32_t tickstart;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(IS_ADC_EVENT(event));

  ASSERT_DBG_STATE(hadc->global_state, HAL_ADC_STATE_IDLE | HAL_ADC_STATE_ACTIVE);

  p_instance = ADC_GET_INSTANCE(hadc);
  tickstart = HAL_GetTick();

  /* Wait until selected flag is raised */
  while (LL_ADC_IsActiveFlag(p_instance, (uint32_t)event) == 0UL)
  {
    if ((HAL_GetTick() - tickstart) > timeout_ms)
    {
      /* New check to avoid false timeout detection in case of preemption */
      if (LL_ADC_IsActiveFlag(p_instance, (uint32_t)event) == 0UL)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  LL_ADC_ClearFlag(p_instance, (uint32_t)event);

