MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  return status;
}

/**
  * @brief  Start conversion on ADC group regular.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @retval HAL_BUSY          HAL ADC state machine not in expected initial state
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_REG_StartConv(hal_adc_handle_t *hadc)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);

  ASSERT_DBG_STATE(hadc->global_state, HAL_ADC_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_REGULAR], HAL_ADC_GROUP_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hadc, group_state[ADC_GROUP_REGULAR], HAL_ADC_GROUP_STATE_IDLE, HAL_ADC_GROUP_STATE_ACTIVE);

  p_instance = ADC_GET_INSTANCE(hadc);

  LL_ADC_REG_StartConversion(p_instance);

  return status;
}

/**
  * @brief  Start conversion on ADC group regular with interruption: default interruptions.
  *         Default interruptions used: end of unitary conversion, overrun. To use other interruptions,
  *         refer to HAL_ADC_REG_StartConv_IT_Opt().
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @note   Callback functions "HAL_ADC_REG_...Callback()" (corresponding to these interruptions) will be triggered.
  * @retval HAL_BUSY          HAL ADC state machine not in expected initial state
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_REG_StartConv_IT(hal_adc_handle_t *hadc)
{
  hal_status_t status;

  status = HAL_ADC_REG_StartConv_IT_Opt(hadc, HAL_ADC_OPT_IT_REG_EOC | HAL_ADC_OPT_IT_REG_OVR);

  return status;
}

/**
  * @brief  Start conversion on ADC group regular with interruption: selected optional interruptions.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  it_opt Can be a combination of values (subset of @ref ADC_optional_interruptions):
  *         @arg @ref HAL_ADC_OPT_IT_NONE
  *         @arg @ref HAL_ADC_OPT_IT_REG_EOSMP
  *         @arg @ref HAL_ADC_OPT_IT_REG_EOC
  *         @arg @ref HAL_ADC_OPT_IT_REG_EOS
  *         @arg @ref HAL_ADC_OPT_IT_REG_OVR
  *         @arg @ref HAL_ADC_OPT_IT_AWD_1
  *         @arg @ref HAL_ADC_OPT_IT_AWD_2
  *         @arg @ref HAL_ADC_OPT_IT_AWD_3
  * @note   Callback functions "HAL_ADC_REG_...Callback()" (corresponding to these interruptions) will be triggered.
  * @retval HAL_BUSY          HAL ADC state machine not in expected initial state
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_REG_StartConv_IT_Opt(hal_adc_handle_t *hadc, uint32_t it_opt)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(IS_ADC_OPT_IT_REG(it_opt));

  ASSERT_DBG_STATE(hadc->global_state, HAL_ADC_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_REGULAR], HAL_ADC_GROUP_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hadc, group_state[ADC_GROUP_REGULAR], HAL_ADC_GROUP_STATE_IDLE, HAL_ADC_GROUP_STATE_ACTIVE);

  p_instance = ADC_GET_INSTANCE(hadc);

  /* Manage optional interruptions */
  LL_ADC_ClearFlag(p_instance, it_opt);
  LL_ADC_EnableIT(p_instance, it_opt);

  LL_ADC_REG_StartConversion(p_instance);

  return status;
}

#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
/**
  * @brief  Start conversion on ADC group regular with data transfer by DMA.
  *         Default interruptions used: buffer half transfer and transfer complete. To use other interruptions,
  *         refer to HAL_ADC_REG_StartConv_DMA_Opt().
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_data     Pointer to the data buffer (data transfer from ADC to buffer, through DMA).
  * @param  size_byte  Data buffer size (in bytes).
  * @note   Callback functions @ref HAL_ADC_REG_DataTransferHalfCallback and @ref HAL_ADC_REG_DataTransferCpltCallback
  *         (corresponding to these interruptions) will be triggered.
  * @note   This function configures automatically ADC data transfer by DMA mode limited or unlimited in function of
  *         DMA configuration one shot or circular mode.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_REG_StartConv_DMA(hal_adc_handle_t *hadc, uint8_t *p_data, uint32_t size_byte)
{
  hal_status_t status;

  status = HAL_ADC_REG_StartConv_DMA_Opt(hadc, p_data, size_byte, HAL_ADC_OPT_DMA_IT_HT);

  return status;
}

/**
  * @brief  Start conversion on ADC group regular with data transfer by DMA and selected optional interruptions.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  p_data     Pointer to the data buffer (data transfer from ADC to buffer, through DMA).
  * @param  size_byte  Data buffer size (in bytes).
  * @param  it_opt Can be a combination of values (subset of @ref ADC_optional_interruptions):
  *         @arg @ref HAL_ADC_OPT_IT_NONE
  *         @arg @ref HAL_ADC_OPT_IT_REG_EOSMP
  *         @arg @ref HAL_ADC_OPT_IT_REG_EOS
  *         @arg @ref HAL_ADC_OPT_IT_AWD_1
  *         @arg @ref HAL_ADC_OPT_IT_AWD_2
  *         @arg @ref HAL_ADC_OPT_IT_AWD_3
  *         @arg @ref HAL_ADC_OPT_DMA_IT_NONE
  *         @arg @ref HAL_ADC_OPT_DMA_IT_HT
  *         @arg @ref HAL_ADC_OPT_DMA_IT_DEFAULT
  * @if USE_HAL_DMA_LINKEDLIST
  *         @arg @ref HAL_ADC_OPT_DMA_IT_SILENT (1)
  *
  *         (1) If mode silent selected, then all other interruptions are disabled
  * @endif
  * @note   Callback functions "HAL_ADC_REG_DataTransfer...Callback" (corresponding to these interruptions) will
  *         be triggered.
  * @note   This function configure automatically ADC data transfer by DMA mode limited or unlimited in function of
  *         DMA configuration one shot or circular mode.
  * @note   Optional interruptions not applicable: HAL_ADC_OPT_IT_REG_EOC (flag cleared by DMA)
  *         and HAL_ADC_OPT_IT_REG_OVR (always enabled: overrun event is an error in case of DMA transfer)
  * @warning  Prerequisite: Function @ref HAL_ADC_REG_SetDMA() must be called prior to this function,
  *           to set link to DMA.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_BUSY          HAL ADC state machine not in expected initial state
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_REG_StartConv_DMA_Opt(hal_adc_handle_t *hadc, uint8_t *p_data, uint32_t size_byte,
                                           uint32_t it_opt)
{
  hal_status_t status;
  ADC_TypeDef *p_instance;
  hal_dma_handle_t *hdma;
  uint32_t hal_dma_opt_it = it_opt;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(hadc->hdma_reg != NULL); /* Pointer set by HAL_ADC_REG_SetDMA() */
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(IS_ADC_OPT_IT_REG_DMA(it_opt));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((hadc->hdma_reg == NULL) || (p_data == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

