MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  ASSERT_DBG_STATE(hadc->global_state, HAL_ADC_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_REGULAR], HAL_ADC_GROUP_STATE_IDLE);

#if defined(HAL_ADC_OPT_DMA_IT_SILENT)
  if (it_opt == HAL_ADC_OPT_DMA_IT_SILENT)
  {
    HAL_CHECK_UPDATE_STATE(hadc, group_state[ADC_GROUP_REGULAR],
                           HAL_ADC_GROUP_STATE_IDLE,
                           HAL_ADC_GROUP_STATE_ACTIVE_SILENT);
  }
  else
#endif /* HAL_ADC_OPT_DMA_IT_SILENT */
  {
    HAL_CHECK_UPDATE_STATE(hadc, group_state[ADC_GROUP_REGULAR],
                           HAL_ADC_GROUP_STATE_IDLE,
                           HAL_ADC_GROUP_STATE_ACTIVE);
  }

  p_instance = ADC_GET_INSTANCE(hadc);

  hdma = hadc->hdma_reg;

  /* Set DMA channel callback functions pointers */
  hdma->p_xfer_error_cb     = adc_reg_dma_data_transfer_error_callback;
  hdma->p_xfer_halfcplt_cb  = adc_reg_dma_data_transfer_half_callback;
  hdma->p_xfer_cplt_cb      = adc_reg_dma_data_transfer_cplt_callback;

  /* Manage optional interruptions specific to HAL DMA */
#if defined(HAL_ADC_OPT_DMA_IT_SILENT)
  if (hal_dma_opt_it != HAL_ADC_OPT_DMA_IT_SILENT)
  {
    hal_dma_opt_it = ((it_opt >> HAL_ADC_OPT_DMA_SHIFT) & HAL_DMA_OPT_IT_DEFAULT);
  }
  ASSERT_DBG_PARAM(IS_ADC_DMA_VALID_SILENT_MODE(hadc, hal_dma_opt_it));
#else
  hal_dma_opt_it = ((it_opt >> HAL_ADC_OPT_DMA_SHIFT) & HAL_DMA_OPT_IT_DEFAULT);
#endif /* HAL_ADC_OPT_DMA_IT_SILENT */

  /* Start DMA transfer in IT mode */
  status = HAL_DMA_StartPeriphXfer_IT_Opt(hdma,
                                          LL_ADC_DMA_GetRegAddr(p_instance, LL_ADC_DMA_REG_REGULAR_DATA),
                                          (uint32_t)p_data, size_byte, hal_dma_opt_it);

  if (status != HAL_OK)
  {
    status = HAL_ERROR;
#if defined(USE_HAL_ADC_GET_LAST_ERRORS) && (USE_HAL_ADC_GET_LAST_ERRORS == 1)
    hadc->last_error_codes |= HAL_ADC_REG_ERROR_DMA;
#endif /* USE_HAL_ADC_GET_LAST_ERRORS */

    /* Start operation aborted, restore state machine initial state */
    hadc->group_state[ADC_GROUP_REGULAR] = HAL_ADC_GROUP_STATE_IDLE;
  }
  else
  {
    uint32_t dma_mode;
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
    if (hdma->xfer_mode == HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR)
    {
      dma_mode = 1U;
    }
    else
#endif /* USE_HAL_DMA_LINKEDLIST */
    {
      dma_mode = 0U;
    }

    if (dma_mode == 1U)
    {
      LL_ADC_REG_SetDataTransferMode(p_instance, LL_ADC_REG_DMA_TRANSFER_UNLIMITED);
    }
    else
    {
      LL_ADC_REG_SetDataTransferMode(p_instance, LL_ADC_REG_DMA_TRANSFER_LIMITED);
    }

    /* Clear flags */
    LL_ADC_ClearFlag(p_instance, LL_ADC_FLAG_EOC | LL_ADC_FLAG_EOS | LL_ADC_FLAG_OVR);

    /* Enable interruptions */
    LL_ADC_EnableIT_OVR(p_instance);

    /* Manage optional interruptions */
#if defined(HAL_ADC_OPT_DMA_IT_SILENT)
    if (it_opt != HAL_ADC_OPT_DMA_IT_SILENT)
#endif /* HAL_ADC_OPT_DMA_IT_SILENT */
    {
      LL_ADC_ClearFlag(p_instance, (it_opt & LL_ADC_FLAG_ALL));
      LL_ADC_EnableIT(p_instance, (it_opt & LL_ADC_IT_ALL));
    }

    LL_ADC_REG_StartConversion(p_instance);
  }

  return status;
}
#endif /* USE_HAL_ADC_DMA */

/**
  * @brief  Trigger conversion (SW start) on ADC group regular for a conversion process ongoing.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @note   This function can be used to iterate a conversion process ongoing initiated by HAL_ADC_REG_StartConv...()
  *         (for example, sequence in discontinuous mode or DMA transfer from unitary conversions by SW start).
  * @warning Necessary condition: previous conversion must be completed (state HAL_ADC_GROUP_STATE_IDLE, ensured by
  *         polling (HAL_ADC_REG_PollForConv()) or interruption (HAL_ADC_IRQHandler()).
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_REG_TrigNextConv(hal_adc_handle_t *hadc)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);

  p_instance = ADC_GET_INSTANCE(hadc);
  ASSERT_DBG_PARAM(LL_ADC_REG_IsTriggerSourceSWStart(p_instance) != 0U);

  ASSERT_DBG_STATE(hadc->global_state, HAL_ADC_STATE_ACTIVE);
#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_REGULAR],
                   (uint32_t)HAL_ADC_GROUP_STATE_IDLE |
                   (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE_SILENT |
                   (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE);
#else
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_REGULAR],
                   (uint32_t)HAL_ADC_GROUP_STATE_IDLE |
                   (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE);
#endif /* USE_HAL_ADC_DMA */

  if (LL_ADC_REG_IsConversionOngoing(p_instance) != 0U)
  {
    status = HAL_ERROR;
  }
  else
  {
    if (hadc->group_state[ADC_GROUP_REGULAR] == HAL_ADC_GROUP_STATE_IDLE)
    {
      HAL_CHECK_UPDATE_STATE(hadc, group_state[ADC_GROUP_REGULAR],
                             HAL_ADC_GROUP_STATE_IDLE,
                             HAL_ADC_GROUP_STATE_ACTIVE);
    }

    LL_ADC_REG_StartConversion(p_instance);
  }

  return status;
}

/**
  * @brief  Stop conversion on ADC group regular.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_REG_StopConv(hal_adc_handle_t *hadc)
{
  hal_status_t status;

  ASSERT_DBG_PARAM(hadc != NULL);

  ASSERT_DBG_STATE(hadc->global_state, HAL_ADC_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_REGULAR],
                   (uint32_t)HAL_ADC_GROUP_STATE_IDLE |
                   (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE);

  status = adc_reg_stop_conversion(hadc);

  hadc->group_state[ADC_GROUP_REGULAR] = HAL_ADC_GROUP_STATE_IDLE;

  return status;
}

/**
  * @brief  Stop conversion on ADC group regular with interruption.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @note   This function disable interruptions enabled by start conversion function except
  *         analog watchdog interrutpions possibly used by group injected. To disable them, use @ref HAL_ADC_Stop().
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_REG_StopConv_IT(hal_adc_handle_t *hadc)
{
  hal_status_t status;
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);

