MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  ASSERT_DBG_STATE(hadc->global_state, HAL_ADC_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_REGULAR],
                   (uint32_t)HAL_ADC_GROUP_STATE_IDLE |
                   (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE);

  p_instance = ADC_GET_INSTANCE(hadc);

  status = adc_reg_stop_conversion(hadc);

  /* Disable interruptions */
  LL_ADC_DisableIT(p_instance, LL_ADC_IT_EOSMP | LL_ADC_IT_EOC | LL_ADC_IT_EOS | LL_ADC_IT_OVR);

  hadc->group_state[ADC_GROUP_REGULAR] = HAL_ADC_GROUP_STATE_IDLE;

  return status;
}

#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
/**
  * @brief  Stop conversion on ADC group regular with data transfer by DMA.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @note   This function disable interruptions enabled by start conversion function except
  *         analog watchdog interrutpions possibly used by group injected. To disable them, use @ref HAL_ADC_Stop().
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_REG_StopConv_DMA(hal_adc_handle_t *hadc)
{
  hal_status_t status;
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);

  ASSERT_DBG_STATE(hadc->global_state, HAL_ADC_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_REGULAR],
                   (uint32_t)HAL_ADC_GROUP_STATE_IDLE |
                   (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE |
                   (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE_SILENT);

  p_instance = ADC_GET_INSTANCE(hadc);

  status = adc_reg_stop_conversion(hadc);

  LL_ADC_REG_SetDataTransferMode(p_instance, LL_ADC_REG_DR_TRANSFER);

  if (hadc->group_state[ADC_GROUP_REGULAR] == HAL_ADC_GROUP_STATE_ACTIVE_SILENT)
  {
    (void)HAL_DMA_Abort(hadc->hdma_reg);
    /* Error flag clearing when error in silent mode */

    adc_reg_dma_data_transfer_stop_callback(hadc->hdma_reg);
  }
  else
  {
    hadc->hdma_reg->p_xfer_abort_cb = adc_reg_dma_data_transfer_stop_callback;

    if (HAL_DMA_Abort_IT(hadc->hdma_reg) != HAL_OK)
    {
      adc_reg_dma_data_transfer_stop_callback(hadc->hdma_reg);
    }
  }

  /* Disable interruptions */
  LL_ADC_DisableIT(p_instance, LL_ADC_IT_EOSMP | LL_ADC_IT_EOC | LL_ADC_IT_EOS | LL_ADC_IT_OVR);

  /* Note: HAL ADC state machine is updated in function adc_reg_dma_data_transfer_stop_callback() */

  return status;
}
#endif /* USE_HAL_ADC_DMA */

/**
  * @brief  Wait for conversion on ADC group regular to be completed.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  timeout_ms ADC conversion timeout value (unit: ms)
  * @retval HAL_TIMEOUT       Operation exceeds user timeout
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_REG_PollForConv(hal_adc_handle_t *hadc, uint32_t timeout_ms)
{
  ADC_TypeDef *p_instance;
  uint32_t tickstart;

  ASSERT_DBG_PARAM(hadc != NULL);

  ASSERT_DBG_STATE(hadc->global_state, HAL_ADC_STATE_ACTIVE);

  p_instance = ADC_GET_INSTANCE(hadc);
  tickstart = HAL_GetTick();

  /* Wait until end of unitary conversion flag is raised */
  while (LL_ADC_IsActiveFlag_EOC(p_instance) == 0UL)
  {
    if ((HAL_GetTick() - tickstart) > timeout_ms)
    {
      /* New check to avoid false timeout detection in case of preemption */
      if (LL_ADC_IsActiveFlag_EOC(p_instance) == 0UL)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  /* Clear flag */
  LL_ADC_ClearFlag_EOC(p_instance);

  if (hadc->group_conv_per_start[ADC_GROUP_REGULAR] == HAL_ADC_GROUP_CONV_UNIT)
  {
    hadc->group_state[ADC_GROUP_REGULAR] = HAL_ADC_GROUP_STATE_IDLE;
  }

  return HAL_OK;
}

/**
  * @brief  Get ADC group regular conversion data.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @retval conversion data (signed value (can be negative after post-processing computation: offset feature)
  *         between Min_Data=-2147483648 (two's complement 0x80000000) and Max_Data=+2147483647 (0x7FFFFFFF))
  */
int32_t HAL_ADC_REG_ReadConversionData(const hal_adc_handle_t *hadc)
{
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_STATE(hadc->global_state, (hal_adc_state_t)((uint32_t)HAL_ADC_STATE_INIT
                                                         | (uint32_t)HAL_ADC_STATE_CONFIGURING
                                                         | (uint32_t)HAL_ADC_STATE_CALIB
                                                         | (uint32_t)HAL_ADC_STATE_IDLE
                                                         | (uint32_t)HAL_ADC_STATE_ACTIVE));

  p_instance = ADC_GET_INSTANCE(hadc);
  int32_t data = LL_ADC_REG_ReadConversionData(p_instance);

  return data;
}

/**
  * @brief  Start conversion on ADC group injected.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @retval HAL_BUSY          HAL ADC state machine not in expected initial state
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_INJ_StartConv(hal_adc_handle_t *hadc)
{
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);

  ASSERT_DBG_STATE(hadc->global_state, HAL_ADC_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_INJECTED], HAL_ADC_GROUP_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hadc, group_state[ADC_GROUP_INJECTED], HAL_ADC_GROUP_STATE_IDLE, HAL_ADC_GROUP_STATE_ACTIVE);

  p_instance = ADC_GET_INSTANCE(hadc);

  ASSERT_DBG_PARAM(LL_ADC_INJ_GetTrigAuto(p_instance) != LL_ADC_INJ_TRIG_FROM_REGULAR);

  LL_ADC_INJ_StartConversion(p_instance);

  return HAL_OK;
}

/**
  * @brief  Start conversion on ADC group injected with interruption: default interruptions.
  *         Default interruptions used: end of unitary conversion. To use other interruptions,
  *         refer to HAL_ADC_INJ_StartConv_IT_Opt().
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @note   Callback functions "HAL_ADC_INJ_...Callback()" (corresponding to these interruptions) will be triggered.
  * @retval HAL_BUSY          HAL ADC state machine not in expected initial state
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_INJ_StartConv_IT(hal_adc_handle_t *hadc)
{
  hal_status_t status;

  status = HAL_ADC_INJ_StartConv_IT_Opt(hadc, HAL_ADC_OPT_IT_INJ_EOC);

