MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  return status;
}

/**
  * @brief  Start conversion on ADC group injected with interruption: selected optional interruptions.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  it_opt Can be a combination of values (subset of @ref ADC_optional_interruptions):
  *         @arg @ref HAL_ADC_OPT_IT_NONE
  *         @arg @ref HAL_ADC_OPT_IT_INJ_EOC
  *         @arg @ref HAL_ADC_OPT_IT_INJ_EOS
  *         @arg @ref HAL_ADC_OPT_IT_AWD_1
  *         @arg @ref HAL_ADC_OPT_IT_AWD_2
  *         @arg @ref HAL_ADC_OPT_IT_AWD_3
  * @note   Callback functions "HAL_ADC_INJ_...Callback()" (corresponding to these interruptions) will be triggered.
  * @retval HAL_BUSY          HAL ADC state machine not in expected initial state
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_INJ_StartConv_IT_Opt(hal_adc_handle_t *hadc, uint32_t it_opt)
{
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(IS_ADC_OPT_IT_INJ(it_opt));

  ASSERT_DBG_STATE(hadc->global_state, HAL_ADC_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_INJECTED], HAL_ADC_GROUP_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hadc, group_state[ADC_GROUP_INJECTED], HAL_ADC_GROUP_STATE_IDLE, HAL_ADC_GROUP_STATE_ACTIVE);

  p_instance = ADC_GET_INSTANCE(hadc);

  ASSERT_DBG_PARAM(LL_ADC_INJ_GetTrigAuto(p_instance) != LL_ADC_INJ_TRIG_FROM_REGULAR);

  /* Manage optional interruptions */
  LL_ADC_ClearFlag(p_instance, it_opt);
  LL_ADC_EnableIT(p_instance, it_opt);

  LL_ADC_INJ_StartConversion(p_instance);

  return HAL_OK;
}

/**
  * @brief  Trigger conversion (SW start) on ADC group injected for a conversion process ongoing.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @note   This function can be used to iterate a conversion process ongoing initiated by HAL_ADC_INJ_StartConv...()
  *         (for example, sequence in discontinuous mode).
  * @warning Necessary condition: previous conversion must be completed (state HAL_ADC_GROUP_STATE_IDLE, ensured by
  *         polling (HAL_ADC_INJ_PollForConv()) or interruption (HAL_ADC_IRQHandler()).
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_INJ_TrigNextConv(hal_adc_handle_t *hadc)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);

  p_instance = ADC_GET_INSTANCE(hadc);
  ASSERT_DBG_PARAM(LL_ADC_INJ_IsTriggerSourceSWStart(p_instance) != 0U);

  ASSERT_DBG_STATE(hadc->global_state, HAL_ADC_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_INJECTED],
                   (uint32_t)HAL_ADC_GROUP_STATE_IDLE |
                   (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE);

  if (LL_ADC_INJ_IsConversionOngoing(p_instance) != 0U)
  {
    status = HAL_ERROR;
  }
  else
  {
    if (hadc->group_state[ADC_GROUP_INJECTED] == HAL_ADC_GROUP_STATE_IDLE)
    {
      HAL_CHECK_UPDATE_STATE(hadc, group_state[ADC_GROUP_INJECTED],
                             HAL_ADC_GROUP_STATE_IDLE,
                             HAL_ADC_GROUP_STATE_ACTIVE);
    }

    LL_ADC_INJ_StartConversion(p_instance);
  }

  return status;
}

/**
  * @brief  Stop conversion on ADC group injected.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_INJ_StopConv(hal_adc_handle_t *hadc)
{
  hal_status_t status;

  ASSERT_DBG_PARAM(hadc != NULL);

  ASSERT_DBG_STATE(hadc->global_state, HAL_ADC_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_INJECTED],
                   (uint32_t)HAL_ADC_GROUP_STATE_IDLE |
                   (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE);

  status = adc_inj_stop_conversion(hadc);

  hadc->group_state[ADC_GROUP_INJECTED] = HAL_ADC_GROUP_STATE_IDLE;

  return status;
}

/**
  * @brief  Stop conversion on ADC group injected with interruption.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @note   This function disable interruptions enabled by start conversion function except
  *         analog watchdog interrutpions possibly used by group regular. To disable them, use @ref HAL_ADC_Stop().
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_INJ_StopConv_IT(hal_adc_handle_t *hadc)
{
  hal_status_t status;
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);

  ASSERT_DBG_STATE(hadc->global_state, HAL_ADC_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadc->group_state[ADC_GROUP_INJECTED],
                   (uint32_t)HAL_ADC_GROUP_STATE_IDLE |
                   (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE);

  p_instance = ADC_GET_INSTANCE(hadc);

  status = adc_inj_stop_conversion(hadc);

  /* Disable interruptions */
  LL_ADC_DisableIT(p_instance, LL_ADC_IT_JEOC | LL_ADC_IT_JEOS);

  hadc->group_state[ADC_GROUP_INJECTED] = HAL_ADC_GROUP_STATE_IDLE;

  return status;
}

/**
  * @brief  Wait for conversion on ADC group injected to be completed.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  timeout_ms ADC conversion timeout value (unit: ms)
  * @retval HAL_TIMEOUT       Operation exceeds user timeout
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_INJ_PollForConv(hal_adc_handle_t *hadc, uint32_t timeout_ms)
{
  ADC_TypeDef *p_instance;
  uint32_t tickstart;

  ASSERT_DBG_PARAM(hadc != NULL);

  ASSERT_DBG_STATE(hadc->global_state, HAL_ADC_STATE_ACTIVE);

  p_instance = ADC_GET_INSTANCE(hadc);

  /* Get tick count */
  tickstart = HAL_GetTick();

  /* Wait until end of unitary conversion flag is raised */
  while (LL_ADC_IsActiveFlag_JEOC(p_instance) == 0UL)
  {
    if ((HAL_GetTick() - tickstart) > timeout_ms)
    {
      /* New check to avoid false timeout detection in case of preemption */
      if (LL_ADC_IsActiveFlag_JEOC(p_instance) == 0UL)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  /* Clear flag */
  LL_ADC_ClearFlag_JEOC(p_instance);

