MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  if (hadc->group_conv_per_start[ADC_GROUP_INJECTED] == HAL_ADC_GROUP_CONV_UNIT)
  {
    hadc->group_state[ADC_GROUP_INJECTED] = HAL_ADC_GROUP_STATE_IDLE;
  }

  return HAL_OK;
}

/**
  * @brief  Get ADC group injected conversion data.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  sequencer_rank ADC group injected sequencer rank.
  *                        Can be a number between Min_Data = 1, Max_Data = 4
  * @retval conversion data (signed value (can be negative after post-processing computation: offset feature)
  *         between Min_Data=-2147483648 (two's complement 0x80000000) and Max_Data=+2147483647 (0x7FFFFFFF))
  */
int32_t HAL_ADC_INJ_ReadConversionDataRank(const hal_adc_handle_t *hadc, uint8_t sequencer_rank)
{
  ADC_TypeDef *p_instance;
  uint32_t sequencer_rank_ll_format;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(IS_ADC_INJ_SEQUENCER_LENGTH(sequencer_rank));
  ASSERT_DBG_STATE(hadc->global_state, (hal_adc_state_t)((uint32_t)HAL_ADC_STATE_INIT
                                                         | (uint32_t)HAL_ADC_STATE_CONFIGURING
                                                         | (uint32_t)HAL_ADC_STATE_CALIB
                                                         | (uint32_t)HAL_ADC_STATE_IDLE
                                                         | (uint32_t)HAL_ADC_STATE_ACTIVE));

  p_instance = ADC_GET_INSTANCE(hadc);
  sequencer_rank_ll_format = LL_ADC_DECIMAL_NB_TO_INJ_SEQ_RANK(sequencer_rank);
  int32_t data = LL_ADC_INJ_ReadConversionDataRank(p_instance, sequencer_rank_ll_format);

  return data;
}

#if defined(ADC_MULTIMODE_SUPPORT)
/**
  * @brief  Multimode operation: Activate ADC instances part of multimode.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @warning  Prerequisite: HAL ADC handles part of multimode setup must have been linked using function
  *           @ref HAL_ADC_SetLinkNextHandle()
  *           and multimode must have been configured using function @ref HAL_ADC_MM_SetConfig().
  * @retval HAL_BUSY          HAL ADC state machine not in expected initial state
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_Start(hal_adc_handle_t *hadc)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;
  hal_adc_handle_t *p_handle_current;
  uint32_t index;

  ASSERT_DBG_PARAM(hadc != NULL);

  p_instance = ADC_GET_INSTANCE(hadc);

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(p_instance) == p_instance);

  /* Check state of all HAL ADC handles part of multimode */
  adc_assert_state_mm_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_IDLE);

  adc_mm_set_state_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE);

  if (LL_ADC_INJ_GetTrigAuto(p_instance) == LL_ADC_INJ_TRIG_FROM_REGULAR)
  {
    status = adc_mm_check_set_state_group(hadc, ADC_GROUP_INJECTED,
                                          HAL_ADC_GROUP_STATE_IDLE,
                                          HAL_ADC_GROUP_STATE_ACTIVE);
  }

  if (status == HAL_OK)
  {
    /* Verify configuration compliance to hardware constraints */
    if (hadc->group_state[ADC_GROUP_INJECTED] == HAL_ADC_GROUP_STATE_IDLE)
    {
      if (LL_ADC_GetSamplingMode(p_instance) != LL_ADC_SAMPLING_MODE_NORMAL)
      {
        status = HAL_ERROR;
      }
    }

    if (status == HAL_OK)
    {
      /* Parse multimode instances through links of daisy chain (starting from ADC master) */
      p_handle_current = hadc;
      for (index = 0; index < ADC_MM_INST_COUNT; index++)
      {
        status = adc_activate(p_handle_current);

        if (status != HAL_OK)
        {
          break;
        }

        p_handle_current = p_handle_current->p_link_next_handle;
      }
    }
  }

  return status;
}

/**
  * @brief  Multimode operation: Deactivate ADC instances part of multimode.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @warning  Prerequisite: HAL ADC handles part of multimode setup must have been linked using function
  *           @ref HAL_ADC_SetLinkNextHandle()
  *           and multimode must have been configured using function @ref HAL_ADC_MM_SetConfig().
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_Stop(hal_adc_handle_t *hadc)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance;
  hal_adc_handle_t *p_handle_current;
  uint32_t index;

  ASSERT_DBG_PARAM(hadc != NULL);

  p_instance = ADC_GET_INSTANCE(hadc);

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(p_instance) == p_instance);

  /* Check state of all HAL ADC handles part of multimode */
  adc_assert_state_mm_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE);
  adc_assert_state_mm_reg(hadc, HAL_ADC_GROUP_STATE_IDLE);

  if (LL_ADC_INJ_GetTrigAuto(p_instance) == LL_ADC_INJ_TRIG_FROM_REGULAR)
  {
    adc_assert_state_mm_inj(hadc, (hal_adc_group_state_t)((uint32_t)HAL_ADC_GROUP_STATE_RESET |
                                                          (uint32_t)HAL_ADC_GROUP_STATE_IDLE |
                                                          (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE));
  }
  else
  {
    adc_assert_state_mm_inj(hadc, (hal_adc_group_state_t)((uint32_t)HAL_ADC_GROUP_STATE_RESET |
                                                          (uint32_t)HAL_ADC_GROUP_STATE_IDLE));
  }

  /* Parse multimode instances through links of daisy chain (starting from ADC master) */
  p_handle_current = hadc;
  for (index = 0; index < ADC_MM_INST_COUNT; index++)
  {
    status = adc_deactivate(p_handle_current);

    /* Clear flags and interruptions */
    LL_ADC_ClearFlag(ADC_GET_INSTANCE(p_handle_current), LL_ADC_FLAG_ALL);
    LL_ADC_DisableIT(ADC_GET_INSTANCE(p_handle_current), LL_ADC_IT_ALL);

    if (status != HAL_OK)
    {
      break;
    }

    p_handle_current = p_handle_current->p_link_next_handle;
  }

