MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  if (LL_ADC_INJ_GetTrigAuto(p_instance) == LL_ADC_INJ_TRIG_FROM_REGULAR)
  {
    adc_mm_set_state_inst_inj(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_IDLE, HAL_ADC_GROUP_STATE_IDLE);
  }
  else
  {
    adc_mm_set_state_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_IDLE);
  }

  return status;
}

/**
  * @brief  Multimode operation: Perform self-calibration of ADC instances part of multimode.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @warning  Prerequisite: HAL ADC handles part of multimode setup must have been linked using function
  *           @ref HAL_ADC_SetLinkNextHandle()
  *           and multimode must have been configured using function @ref HAL_ADC_MM_SetConfig().
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_Calibrate(hal_adc_handle_t *hadc)
{
  hal_status_t status = HAL_OK;
  hal_adc_handle_t *p_handle_current;
  uint32_t index;

  ASSERT_DBG_PARAM(hadc != NULL);

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(ADC_GET_INSTANCE(hadc)) == ADC_GET_INSTANCE(hadc));

  /* Check state of all HAL ADC handles part of multimode */
  adc_assert_state_mm_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE);
  adc_assert_state_mm_reg(hadc, HAL_ADC_GROUP_STATE_IDLE);
  adc_assert_state_mm_inj(hadc, HAL_ADC_GROUP_STATE_IDLE);

  /* Parse multimode instances through links of daisy chain (starting from ADC master) */
  p_handle_current = hadc;
  for (index = 0; index < ADC_MM_INST_COUNT; index++)
  {
    HAL_CHECK_UPDATE_STATE(p_handle_current, global_state, HAL_ADC_STATE_ACTIVE, HAL_ADC_STATE_CALIB);

    status = adc_calibrate(p_handle_current);

    if (status != HAL_OK)
    {
      break;
    }

    p_handle_current = p_handle_current->p_link_next_handle;
  }

  adc_mm_set_state_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE);

  return status;
}

/**
  * @brief  Multimode operation: Start conversion on multimode ADC instances group regular.
  *         Callback functions "HAL_ADC_INJ_...Callback" (depending on ADC interrupt selected) will be triggered.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @warning  Prerequisite: HAL ADC handles part of multimode setup must have been linked using function
  *           @ref HAL_ADC_SetLinkNextHandle()
  *           and multimode must have been configured using function @ref HAL_ADC_MM_SetConfig().
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_REG_StartConv(hal_adc_handle_t *hadc)
{
  hal_status_t status;
  ADC_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hadc != NULL);

  p_instance = ADC_GET_INSTANCE(hadc);

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(p_instance) == p_instance);

  /* Check state of all HAL ADC handles part of multimode */
  adc_assert_state_mm_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE);
  adc_assert_state_mm_reg(hadc, HAL_ADC_GROUP_STATE_IDLE);

  status = adc_mm_check_set_state_group(hadc, ADC_GROUP_REGULAR,
                                        HAL_ADC_GROUP_STATE_IDLE,
                                        HAL_ADC_GROUP_STATE_ACTIVE);

  if (status == HAL_OK)
  {
    LL_ADC_REG_StartConversion(p_instance);
  }

  return status;
}

/**
  * @brief  Multimode operation: Start conversion on multimode ADC instances group regular with interruption: default
  *         interruptions.
  *         Default interruptions used: end of unitary conversion, overrun. To use other interruptions,
  *         refer to HAL_ADC_REG_StartConv_IT_Opt().
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @note   Callback functions "HAL_ADC_REG_...Callback()" (corresponding to these interruptions) will be triggered.
  * @warning  Prerequisite: HAL ADC handles part of multimode setup must have been linked using function
  *           @ref HAL_ADC_SetLinkNextHandle()
  *           and multimode must have been configured using function @ref HAL_ADC_MM_SetConfig().
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_REG_StartConv_IT(hal_adc_handle_t *hadc)
{
  hal_status_t status;

  status = HAL_ADC_MM_REG_StartConv_IT_Opt(hadc, (HAL_ADC_OPT_IT_REG_EOC | HAL_ADC_OPT_IT_REG_OVR));

  return status;
}

/**
  * @brief  Multimode operation: Start conversion on multimode ADC instances group regular with interruption: selected
  *         optional interruptions.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @param  it_opt Can be a combination of values (subset of @ref ADC_optional_interruptions):
  *         @arg @ref HAL_ADC_OPT_IT_NONE
  *         @arg @ref HAL_ADC_OPT_IT_REG_EOSMP
  *         @arg @ref HAL_ADC_OPT_IT_REG_EOC
  *         @arg @ref HAL_ADC_OPT_IT_REG_EOS
  *         @arg @ref HAL_ADC_OPT_IT_REG_OVR
  *         @arg @ref HAL_ADC_OPT_IT_AWD_1
  *         @arg @ref HAL_ADC_OPT_IT_AWD_2
  *         @arg @ref HAL_ADC_OPT_IT_AWD_3
  * @note   Callback functions "HAL_ADC_REG_...Callback()" (corresponding to these interruptions) will be triggered.
  * @warning  Prerequisite: HAL ADC handles part of multimode setup must have been linked using function
  *           @ref HAL_ADC_SetLinkNextHandle()
  *           and multimode must have been configured using function @ref HAL_ADC_MM_SetConfig().
  * @retval HAL_BUSY          HAL ADC state machine not in expected initial state
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_REG_StartConv_IT_Opt(hal_adc_handle_t *hadc, uint32_t it_opt)
{
  hal_status_t status;
  ADC_TypeDef *p_instance_mst;
  ADC_TypeDef *p_instance_slv;

  ASSERT_DBG_PARAM(hadc != NULL);

