MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  p_instance_mst = ADC_GET_INSTANCE(hadc);
  p_instance_slv = ADC_GET_INSTANCE(hadc->p_link_next_handle);

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(p_instance_mst) == p_instance_mst);
  ASSERT_DBG_PARAM(IS_ADC_OPT_IT_REG(it_opt));

  /* Check state of all HAL ADC handles part of multimode */
  adc_assert_state_mm_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE);
  adc_assert_state_mm_reg(hadc, HAL_ADC_GROUP_STATE_IDLE);

  status = adc_mm_check_set_state_group(hadc, ADC_GROUP_REGULAR,
                                        HAL_ADC_GROUP_STATE_IDLE,
                                        HAL_ADC_GROUP_STATE_ACTIVE);

  if (status == HAL_OK)
  {
    /* Manage optional interruptions */
    LL_ADC_ClearFlag(p_instance_mst, it_opt);
    LL_ADC_ClearFlag(p_instance_slv, it_opt);
    LL_ADC_EnableIT(p_instance_mst, it_opt);

    LL_ADC_REG_StartConversion(p_instance_mst);
  }

  return status;
}

#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
/**
  * @brief  Multimode operation: Start conversion on multimode ADC instances group regular with data transfer by DMA.
  *         In this mode, multimode conversion data of all ADC instances part of multimode are concatenated and
  *         transferred using only one DMA channel (the one assigned to ADC master).
  *         Default interruptions used: buffer half transfer and transfer complete. To use other interruptions,
  *         refer to HAL_ADC_MM_REG_StartConv_DMA_Opt().
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @param  p_data     Pointer to the data buffer (data transfer from ADC to buffer, through DMA).
  * @param  size_byte  Data buffer size (in bytes).
  * @note   Callback functions @ref HAL_ADC_REG_DataTransferHalfCallback and @ref HAL_ADC_REG_DataTransferCpltCallback
  *         (corresponding to these interruptions) will be triggered.
  * @warning  Prerequisite: HAL ADC handles part of multimode setup must have been linked using function
  *           @ref HAL_ADC_SetLinkNextHandle()
  *           and multimode must have been configured using function @ref HAL_ADC_MM_SetConfig().
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_REG_StartConv_DMA(hal_adc_handle_t *hadc, uint8_t *p_data, uint32_t size_byte)
{
  hal_status_t status;

  status = HAL_ADC_MM_REG_StartConv_DMA_Opt(hadc, p_data, size_byte, HAL_ADC_OPT_DMA_IT_HT);

  return status;
}

/**
  * @brief  Multimode operation: Start conversion on multimode ADC instances group regular with data transfer by DMA
  *         and selected optional interruptions.
  *         In this mode, multimode conversion data of all ADC instances part of multimode are concatenated and
  *         transferred using only one DMA channel (the one assigned to ADC master).
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @param  p_data     Pointer to the data buffer (data transfer from ADC to buffer, through DMA).
  * @param  size_byte  Data buffer size (in bytes).
  * @param  it_opt Can be a combination of values (subset of @ref ADC_optional_interruptions):
  *         @arg @ref HAL_ADC_OPT_IT_NONE
  *         @arg @ref HAL_ADC_OPT_IT_REG_EOSMP
  *         @arg @ref HAL_ADC_OPT_IT_REG_EOS
  *         @arg @ref HAL_ADC_OPT_IT_AWD_1
  *         @arg @ref HAL_ADC_OPT_IT_AWD_2
  *         @arg @ref HAL_ADC_OPT_IT_AWD_3
  *         @arg @ref HAL_ADC_OPT_DMA_IT_NONE
  *         @arg @ref HAL_ADC_OPT_DMA_IT_HT
  *         @arg @ref HAL_ADC_OPT_DMA_IT_DEFAULT
  * @if USE_HAL_DMA_LINKEDLIST
  *         @arg @ref HAL_ADC_OPT_DMA_IT_SILENT (1)
  *
  *         (1) If mode silent selected, then all other interruptions are disabled
  * @endif
  * @note   Callback functions "HAL_ADC_REG_DataTransfer...Callback" (corresponding to these interruptions) will
  *         be triggered.
  * @note   Function @ref HAL_ADC_REG_SetDMA() must be called prior to this function, to set link to DMA.

  * @note   Optional interruptions not applicable: HAL_ADC_OPT_IT_REG_EOC (flag cleared by DMA)
  *         and HAL_ADC_OPT_IT_REG_OVR (always enabled: overrun event is an error in case of DMA transfer)
  * @warning  Prerequisite: Function @ref HAL_ADC_REG_SetDMA() must be called prior to this function,
  *           to set link to DMA.
  * @warning  Prerequisite: HAL ADC handles part of multimode setup must have been linked using function
  *           @ref HAL_ADC_SetLinkNextHandle()
  *           and multimode must have been configured using function @ref HAL_ADC_MM_SetConfig().
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_BUSY          HAL ADC state machine not in expected initial state
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_REG_StartConv_DMA_Opt(hal_adc_handle_t *hadc, uint8_t *p_data, uint32_t size_byte,
                                              uint32_t it_opt)
{
  hal_status_t status;
  ADC_TypeDef *p_instance_mst;
  ADC_TypeDef *p_instance_slv;
  hal_dma_handle_t *hdma;
  uint32_t hal_dma_opt_it = it_opt;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(hadc->hdma_reg != NULL); /* Pointer set by HAL_ADC_REG_SetDMA() */
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(IS_ADC_OPT_IT_REG_DMA(it_opt));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((hadc->hdma_reg == NULL) || (p_data == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_instance_mst = ADC_GET_INSTANCE(hadc);

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(p_instance_mst) == p_instance_mst);

  /* Check state of all HAL ADC handles part of multimode */
  adc_assert_state_mm_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE);
  adc_assert_state_mm_reg(hadc, HAL_ADC_GROUP_STATE_IDLE);

#if defined(HAL_ADC_OPT_DMA_IT_SILENT)
  if (it_opt == HAL_ADC_OPT_DMA_IT_SILENT)
  {
    status = adc_mm_check_set_state_group(hadc, ADC_GROUP_REGULAR,
                                          HAL_ADC_GROUP_STATE_IDLE,
                                          HAL_ADC_GROUP_STATE_ACTIVE_SILENT);
  }
  else
#endif /* HAL_ADC_OPT_DMA_IT_SILENT */
  {
    status = adc_mm_check_set_state_group(hadc, ADC_GROUP_REGULAR,
                                          HAL_ADC_GROUP_STATE_IDLE,
                                          HAL_ADC_GROUP_STATE_ACTIVE);
  }

  p_instance_slv = ADC_GET_INSTANCE(hadc->p_link_next_handle);
  hdma = hadc->hdma_reg;

