MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  /* Set DMA channel callback functions pointers */
  hdma->p_xfer_error_cb     = adc_reg_dma_data_transfer_error_callback;
  hdma->p_xfer_halfcplt_cb  = adc_reg_dma_data_transfer_half_callback;
  hdma->p_xfer_cplt_cb      = adc_reg_dma_data_transfer_cplt_callback;

  if (status == HAL_OK)
  {
    /* Manage optional interruptions specific to HAL DMA */
#if defined(HAL_ADC_OPT_DMA_IT_SILENT)
    if (hal_dma_opt_it != HAL_ADC_OPT_DMA_IT_SILENT)
    {
      hal_dma_opt_it = ((it_opt >> HAL_ADC_OPT_DMA_SHIFT) & HAL_DMA_OPT_IT_DEFAULT);
    }
    ASSERT_DBG_PARAM(IS_ADC_DMA_VALID_SILENT_MODE(hadc, hal_dma_opt_it));
#else
    hal_dma_opt_it = ((it_opt >> HAL_ADC_OPT_DMA_SHIFT) & HAL_DMA_OPT_IT_DEFAULT);
#endif /* HAL_ADC_OPT_DMA_IT_SILENT */

    /* Start DMA transfer in IT mode */
    status = HAL_DMA_StartPeriphXfer_IT_Opt(hdma,
                                            LL_ADC_DMA_GetRegAddr(p_instance_mst,
                                                                  (uint32_t)hadc->mm_reg_data_transfer_packing),
                                            (uint32_t)p_data, size_byte, hal_dma_opt_it);
  }
  else
  {
    status = HAL_ERROR;
  }

  if (status != HAL_OK)
  {
    status = HAL_ERROR;
#if defined(USE_HAL_ADC_GET_LAST_ERRORS) && (USE_HAL_ADC_GET_LAST_ERRORS == 1)
    hadc->last_error_codes |= HAL_ADC_REG_ERROR_DMA;
#endif /* USE_HAL_ADC_GET_LAST_ERRORS */
  }
  else
  {
    uint32_t dma_mode;
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
    if (hdma->xfer_mode == HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR)
    {
      dma_mode = 1U;
    }
    else
#endif /* USE_HAL_DMA_LINKEDLIST */
    {
      dma_mode = 0U;
    }

    if (dma_mode == 1U)
    {
      LL_ADC_REG_SetDataTransferMode(p_instance_mst, LL_ADC_REG_DMA_TRANSFER_UNLIMITED);
    }
    else
    {
      LL_ADC_REG_SetDataTransferMode(p_instance_mst, LL_ADC_REG_DMA_TRANSFER_LIMITED);
    }

    /* Clear flags */
    LL_ADC_ClearFlag(p_instance_mst, LL_ADC_FLAG_EOC | LL_ADC_FLAG_EOS | LL_ADC_FLAG_OVR);
    LL_ADC_ClearFlag(p_instance_slv, LL_ADC_FLAG_EOC | LL_ADC_FLAG_EOS | LL_ADC_FLAG_OVR);

    /* Enable interruptions */
    LL_ADC_EnableIT_OVR(p_instance_mst);
    LL_ADC_EnableIT_OVR(p_instance_slv);

    /* Manage optional interruptions */
#if defined(HAL_ADC_OPT_DMA_IT_SILENT)
    if (it_opt != HAL_ADC_OPT_DMA_IT_SILENT)
#endif /* HAL_ADC_OPT_DMA_IT_SILENT */
    {
      LL_ADC_ClearFlag(p_instance_mst, (it_opt & LL_ADC_FLAG_ALL));
      LL_ADC_EnableIT(p_instance_mst, (it_opt & LL_ADC_IT_ALL));
    }

    LL_ADC_REG_StartConversion(p_instance_mst);
  }

  return status;
}

/**
  * @brief  Multimode operation: Start conversion on multimode ADC instances group regular with data transfer by DMA
  *         using multiple DMA channels ("M_DMA" stands for multiple DMA).
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @note   In this mode, multimode conversion data of all ADC instances part of multimode are
  *         transferred using multiple DMA channels (the one assigned to each ADC).
  *         DMA transfer must have been configured using @ref HAL_ADC_MM_REG_SetMultiDMA().
  *         Default interruptions used: buffer half transfer and transfer complete. To use other interruptions,
  *         refer to @ref HAL_ADC_MM_REG_StartConvM_DMA_Opt().
  * @note   Callback functions "HAL_ADC_REG_DataTransfer...Callback" (corresponding to these interruptions) will
  *         be triggered.
  * @note   To stop conversion data and transfer by DMA of all ADC instances part of multimode use function
  *         @ref HAL_ADC_MM_REG_StopConv_DMA(). To restart new conversion DMA transfer must have been re-configured
  *         using @ref HAL_ADC_MM_REG_SetMultiDMA() before calling this function.
  * @warning  Prerequisite: HAL ADC handles part of multimode setup must have been linked using function
  *           @ref HAL_ADC_SetLinkNextHandle()
  *           and multimode must have been configured using function @ref HAL_ADC_MM_SetConfig().
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_REG_StartConvM_DMA(hal_adc_handle_t *hadc)
{
  hal_status_t status;

  status = HAL_ADC_MM_REG_StartConvM_DMA_Opt(hadc, HAL_ADC_OPT_DMA_IT_NONE);

  return status;
}

/**
  * @brief  Multimode operation: Start conversion on multimode ADC instances group regular with data transfer by DMA
  *         using multiple DMA channels ("M_DMA" stands for multiple DMA), and selected optional interruptions.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @param  it_opt Can be a combination of values (subset of @ref ADC_optional_interruptions):
  *         @arg @ref HAL_ADC_OPT_IT_NONE
  *         @arg @ref HAL_ADC_OPT_IT_REG_EOSMP
  *         @arg @ref HAL_ADC_OPT_IT_REG_EOC
  *         @arg @ref HAL_ADC_OPT_IT_REG_EOS
  *         @arg @ref HAL_ADC_OPT_IT_REG_OVR
  *         @arg @ref HAL_ADC_OPT_IT_AWD_1
  *         @arg @ref HAL_ADC_OPT_IT_AWD_2
  *         @arg @ref HAL_ADC_OPT_IT_AWD_3
  *         @arg @ref HAL_ADC_OPT_DMA_IT_NONE
  *         @arg @ref HAL_ADC_OPT_DMA_IT_HT
  *         @arg @ref HAL_ADC_OPT_DMA_IT_DEFAULT
  * @if USE_HAL_DMA_LINKEDLIST
  *         @arg @ref HAL_ADC_OPT_DMA_IT_SILENT (1)
  *
  *         (1) If mode silent selected, then all other interruptions are disabled
  * @endif
  * @note   In this mode, multimode conversion data of all ADC instances part of multimode are
  *         transferred using multiple DMA channels (the one assigned to each ADC).
  *         DMA transfer must have been configured using @ref HAL_ADC_MM_REG_SetMultiDMA().
  * @note   Callback functions "HAL_ADC_REG_DataTransfer...Callback" (corresponding to these interruptions) will
  *         be triggered.
  * @note   Optional interruptions not applicable: HAL_ADC_OPT_IT_REG_EOC (flag cleared by DMA)
  *         and HAL_ADC_OPT_IT_REG_OVR (always enabled: overrun event is an error in case of DMA transfer)
  * @note   To stop conversion data and transfer by DMA of all ADC instances part of multimode use function
  *         @ref HAL_ADC_MM_REG_StopConv_DMA(). To restart new conversion DMA transfer must have been re-configured
  *         using @ref HAL_ADC_MM_REG_SetMultiDMA() before calling this function.
  * @warning  Prerequisite: HAL ADC handles part of multimode setup must have been linked using function
  *           @ref HAL_ADC_SetLinkNextHandle()
  *           and multimode must have been configured using function @ref HAL_ADC_MM_SetConfig().
  * @retval HAL_BUSY          HAL ADC state machine not in expected initial state
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_REG_StartConvM_DMA_Opt(hal_adc_handle_t *hadc, uint32_t it_opt)
{
  hal_status_t status;
  ADC_TypeDef *p_instance_mst;
  ADC_TypeDef *p_instance_slv;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(IS_ADC_OPT_IT_REG_DMA(it_opt));

