MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  p_instance_mst = ADC_GET_INSTANCE(hadc);
  p_instance_slv = ADC_GET_INSTANCE(hadc->p_link_next_handle);

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(p_instance_mst) == p_instance_mst);

  /* Check state of all HAL ADC handles part of multimode */
  adc_assert_state_mm_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE);
  adc_assert_state_mm_reg(hadc, HAL_ADC_GROUP_STATE_IDLE);

#if defined(HAL_ADC_OPT_DMA_IT_SILENT)
  if (it_opt == HAL_ADC_OPT_DMA_IT_SILENT)
  {
    status = adc_mm_check_set_state_group(hadc, ADC_GROUP_REGULAR,
                                          HAL_ADC_GROUP_STATE_IDLE,
                                          HAL_ADC_GROUP_STATE_ACTIVE_SILENT);
  }
  else
#endif /* HAL_ADC_OPT_DMA_IT_SILENT */
  {
    status = adc_mm_check_set_state_group(hadc, ADC_GROUP_REGULAR,
                                          HAL_ADC_GROUP_STATE_IDLE,
                                          HAL_ADC_GROUP_STATE_ACTIVE);
  }

  if ((it_opt & (HAL_ADC_OPT_DMA_IT_HT | HAL_ADC_OPT_DMA_IT_DEFAULT)) != 0U)
  {
    /* Manage optional interruptions specific to HAL DMA */
    uint32_t hal_dma_opt_it = it_opt;
#if defined(HAL_ADC_OPT_DMA_IT_SILENT)
    if (hal_dma_opt_it != HAL_ADC_OPT_DMA_IT_SILENT)
    {
      hal_dma_opt_it = ((it_opt >> HAL_ADC_OPT_DMA_SHIFT) & HAL_DMA_OPT_IT_DEFAULT);
    }
    ASSERT_DBG_PARAM(IS_ADC_DMA_VALID_SILENT_MODE(hadc, hal_dma_opt_it));
#else
    hal_dma_opt_it = ((it_opt >> HAL_ADC_OPT_DMA_SHIFT) & HAL_DMA_OPT_IT_DEFAULT);
#endif /* HAL_ADC_OPT_DMA_IT_SILENT */

    /* Update DMA transfer interruptions selection */
    LL_DMA_DisableIT((DMA_Channel_TypeDef *)((uint32_t)hadc->hdma_reg->instance), LL_DMA_IT_ALL);
    LL_DMA_DisableIT((DMA_Channel_TypeDef *)((uint32_t)hadc->p_link_next_handle->hdma_reg->instance), LL_DMA_IT_ALL);
#if defined(HAL_ADC_OPT_DMA_IT_SILENT)
    if (hal_dma_opt_it != HAL_ADC_OPT_DMA_IT_SILENT)
#endif /* HAL_ADC_OPT_DMA_IT_SILENT */
    {
      LL_DMA_EnableIT((DMA_Channel_TypeDef *)((uint32_t)hadc->hdma_reg->instance),
                      (LL_DMA_IT_TC  | LL_DMA_IT_DTE | LL_DMA_IT_ULE | LL_DMA_IT_USE | hal_dma_opt_it));
      LL_DMA_EnableIT((DMA_Channel_TypeDef *)((uint32_t)hadc->p_link_next_handle->hdma_reg->instance),
                      (LL_DMA_IT_TC  | LL_DMA_IT_DTE | LL_DMA_IT_ULE | LL_DMA_IT_USE | hal_dma_opt_it));
    }
  }

  uint32_t dma_mode;
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (hadc->hdma_reg->xfer_mode == HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR)
  {
    dma_mode = 1U;
  }
  else
#endif /* USE_HAL_DMA_LINKEDLIST */
  {
    dma_mode = 0U;
  }

  if (dma_mode == 1U)
  {
    LL_ADC_REG_SetDataTransferMode(p_instance_mst, LL_ADC_REG_DMA_TRANSFER_UNLIMITED);
    LL_ADC_REG_SetDataTransferMode(p_instance_slv, LL_ADC_REG_DMA_TRANSFER_UNLIMITED);
  }
  else
  {
    LL_ADC_REG_SetDataTransferMode(p_instance_mst, LL_ADC_REG_DMA_TRANSFER_LIMITED);
    LL_ADC_REG_SetDataTransferMode(p_instance_slv, LL_ADC_REG_DMA_TRANSFER_LIMITED);
  }

  /* Clear flags */
  LL_ADC_ClearFlag(p_instance_mst, LL_ADC_FLAG_EOC | LL_ADC_FLAG_EOS | LL_ADC_FLAG_OVR);
  LL_ADC_ClearFlag(p_instance_slv, LL_ADC_FLAG_EOC | LL_ADC_FLAG_EOS | LL_ADC_FLAG_OVR);

  /* Enable interruptions */
  LL_ADC_EnableIT_OVR(p_instance_mst);
  LL_ADC_EnableIT_OVR(p_instance_slv);

  /* Manage optional interruptions */
#if defined(HAL_ADC_OPT_DMA_IT_SILENT)
  if (it_opt != HAL_ADC_OPT_DMA_IT_SILENT)
#endif /* HAL_ADC_OPT_DMA_IT_SILENT */
  {
    LL_ADC_ClearFlag(p_instance_mst, (it_opt & LL_ADC_FLAG_ALL));
    LL_ADC_EnableIT(p_instance_mst, (it_opt & LL_ADC_IT_ALL));
  }

  LL_ADC_REG_StartConversion(p_instance_mst);

  return status;
}
#endif /* USE_HAL_ADC_DMA */

/**
  * @brief  Trigger conversion (SW start) on multimode ADC instances group regular for a conversion process ongoing.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @note   This function can be used to iterate a conversion process ongoing initiated
  *         by HAL_ADC_MM_REG_StartConv...() (for example, sequence in discontinuous mode or DMA transfer
  *         from unitary conversions by SW start).
  * @note   This function is not compliant with multimode regular interleaved.
  * @warning Necessary condition: previous conversion must be completed (state HAL_ADC_GROUP_STATE_IDLE, ensured by
  *          polling (HAL_ADC_REG_PollForConv()) or interruption (HAL_ADC_IRQHandler()).
  * @retval HAL_BUSY          HAL ADC state machine not in expected initial state
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_REG_TrigNextConv(hal_adc_handle_t *hadc)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance_mst;

  ASSERT_DBG_PARAM(hadc != NULL);

  p_instance_mst = ADC_GET_INSTANCE(hadc);

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(p_instance_mst) == p_instance_mst);

  ASSERT_DBG_PARAM(LL_ADC_REG_IsTriggerSourceSWStart(p_instance_mst) != 0U);

#if defined(USE_ASSERT_DBG_PARAM)
  uint32_t multimode = LL_ADC_GetMultimode(ADC_COMMON_INSTANCE(p_instance_mst));
  ASSERT_DBG_PARAM((multimode != LL_ADC_MULTI_DUAL_REG_INTERL) && (multimode != LL_ADC_MULTI_DUAL_REG_INT_INJ_SIM));
#endif /* USE_ASSERT_DBG_PARAM */

  adc_assert_state_mm_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE);

  /* Check state of all HAL ADC handles part of multimode */
  adc_assert_state_mm_reg(hadc, (hal_adc_group_state_t)
                          ((uint32_t)HAL_ADC_GROUP_STATE_IDLE |
#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
                           (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE_SILENT |
#endif /* USE_HAL_ADC_DMA */
                           (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE));

  if (LL_ADC_REG_IsConversionOngoing(p_instance_mst) != 0U)
  {
    status = HAL_ERROR;
  }
  else
  {
    if (hadc->group_state[ADC_GROUP_REGULAR] == HAL_ADC_GROUP_STATE_IDLE)
    {
      status = adc_mm_check_set_state_group(hadc, ADC_GROUP_REGULAR,
                                            HAL_ADC_GROUP_STATE_IDLE,
                                            HAL_ADC_GROUP_STATE_ACTIVE);
    }

    LL_ADC_REG_StartConversion(p_instance_mst);
  }

