MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  return status;
}

/**
  * @brief  Multimode operation: Stop conversion on multimode ADC instances group regular.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_REG_StopConv(hal_adc_handle_t *hadc)
{
  hal_status_t status;
  ADC_TypeDef *p_instance_mst;

  ASSERT_DBG_PARAM(hadc != NULL);

  p_instance_mst = ADC_GET_INSTANCE(hadc);

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(p_instance_mst) == p_instance_mst);

  /* Check state of all HAL ADC handles part of multimode */
  adc_assert_state_mm_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE);
  adc_assert_state_mm_reg(hadc, (hal_adc_group_state_t)((uint32_t)HAL_ADC_GROUP_STATE_IDLE |
                                                        (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE));

  /* Multimode conversions controlled by ADC master only */
  status = adc_reg_stop_conversion(hadc);

  /* Disable features enabled by all start conversion functions */
  LL_ADC_DisableIT_EOC(p_instance_mst);
  LL_ADC_DisableIT_EOS(p_instance_mst);

  adc_mm_set_state_inst_reg(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE, HAL_ADC_GROUP_STATE_IDLE);

  return status;
}

/**
  * @brief  Multimode operation: Stop conversion on multimode ADC instances group regular with interruption.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_REG_StopConv_IT(hal_adc_handle_t *hadc)
{
  hal_status_t status;
  ADC_TypeDef *p_instance_mst;
  ADC_TypeDef *p_instance_slv;

  ASSERT_DBG_PARAM(hadc != NULL);

  p_instance_mst = ADC_GET_INSTANCE(hadc);
  p_instance_slv = ADC_GET_INSTANCE(hadc->p_link_next_handle);

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(p_instance_mst) == p_instance_mst);

  /* Check state of all HAL ADC handles part of multimode */
  adc_assert_state_mm_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE);
  adc_assert_state_mm_reg(hadc, (hal_adc_group_state_t)((uint32_t)HAL_ADC_GROUP_STATE_IDLE |
                                                        (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE));

  /* Multimode conversions controlled by ADC master only */
  status = adc_reg_stop_conversion(hadc);

  /* Disable features enabled by all start conversion functions */
  LL_ADC_DisableIT_EOC(p_instance_mst);
  LL_ADC_DisableIT_EOS(p_instance_mst);

  /* Disable interruptions */
  LL_ADC_DisableIT(p_instance_mst, LL_ADC_IT_EOSMP | LL_ADC_IT_EOC | LL_ADC_IT_EOS | LL_ADC_IT_OVR);
  LL_ADC_DisableIT(p_instance_slv, LL_ADC_IT_OVR);

  adc_mm_set_state_inst_reg(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE, HAL_ADC_GROUP_STATE_IDLE);

  return status;
}

#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
/**
  * @brief  Multimode operation: Stop conversion on multimode ADC instances group regular with data transfer by DMA.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @note   This function disable interruptions enabled by start conversion function except
  *         analog watchdog interrutpions possibly used by group injected. To disable them, use @ref HAL_ADC_MM_Stop().
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_REG_StopConv_DMA(hal_adc_handle_t *hadc)
{
  hal_status_t status;
  ADC_TypeDef *p_instance_mst;
  ADC_TypeDef *p_instance_slv;
  hal_adc_handle_t *hadc_stop_last;

  ASSERT_DBG_PARAM(hadc != NULL);

  p_instance_mst = ADC_GET_INSTANCE(hadc);
  p_instance_slv = ADC_GET_INSTANCE(hadc->p_link_next_handle);

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(p_instance_mst) == p_instance_mst);

  /* Check state of all HAL ADC handles part of multimode */
  adc_assert_state_mm_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE);
  adc_assert_state_mm_reg(hadc, (hal_adc_group_state_t)((uint32_t)HAL_ADC_GROUP_STATE_IDLE |
                                                        (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE |
                                                        (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE_SILENT));

  /* Multimode conversions controlled by ADC master only */
  status = adc_reg_stop_conversion(hadc);

  /* Disable features enabled by all start conversion functions */
  LL_ADC_DisableIT_EOC(p_instance_mst);
  LL_ADC_DisableIT_EOS(p_instance_mst);

  LL_ADC_REG_SetDataTransferMode(p_instance_mst, LL_ADC_REG_DR_TRANSFER);
  LL_ADC_REG_SetDataTransferMode(p_instance_slv, LL_ADC_REG_DR_TRANSFER);

  /* Case multiple buffers (started by HAL_ADC_MM_REG_StartConvM_DMA() / M_DMA_Opt()) */
  if (hadc->p_link_next_handle->hdma_reg != NULL)
  {
    hadc_stop_last = hadc->p_link_next_handle;
    (void)HAL_DMA_Abort(hadc->hdma_reg);
  }
  else
  {
    hadc_stop_last = hadc;
  }

  if (hadc->group_state[ADC_GROUP_REGULAR] == HAL_ADC_GROUP_STATE_ACTIVE_SILENT)
  {
    (void)HAL_DMA_Abort(hadc_stop_last->hdma_reg);
    /* Error flag clearing when error in silent mode */

    adc_mm_reg_dma_data_transfer_stop_callback(hadc_stop_last->hdma_reg);
  }
  else
  {
    hadc_stop_last->hdma_reg->p_xfer_abort_cb = adc_mm_reg_dma_data_transfer_stop_callback;

    if (HAL_DMA_Abort_IT(hadc_stop_last->hdma_reg) != HAL_OK)
    {
      adc_mm_reg_dma_data_transfer_stop_callback(hadc_stop_last->hdma_reg);
    }
  }

  /* Disable interruptions */
  LL_ADC_DisableIT(p_instance_mst, LL_ADC_IT_EOSMP | LL_ADC_IT_EOC | LL_ADC_IT_EOS | LL_ADC_IT_OVR);
  LL_ADC_DisableIT(p_instance_slv, LL_ADC_IT_OVR);

  /* Note: HAL ADC state machine is updated in function adc_reg_dma_data_transfer_stop_callback() */

