MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  return status;
}
#endif /* USE_HAL_ADC_DMA */

/**
  * @brief  Multimode operation: Wait for conversion on ADC group regular to be completed
  *         (for all ADC instances part of multimode).
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @param  timeout_ms ADC conversion timeout value (unit: ms)
  * @retval HAL_TIMEOUT       Operation exceeds user timeout
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_REG_PollForConv(hal_adc_handle_t *hadc, uint32_t timeout_ms)
{
  ADC_TypeDef *p_instance_mst;
  ADC_TypeDef *p_instance_slv;
  uint32_t flag_eoc_mst;
  uint32_t flag_eoc_slv;
  uint32_t tickstart;

  ASSERT_DBG_PARAM(hadc != NULL);

  adc_assert_state_mm_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE);

  p_instance_mst = ADC_GET_INSTANCE(hadc);
  p_instance_slv = ADC_GET_INSTANCE(hadc->p_link_next_handle);

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(p_instance_mst) == p_instance_mst);

  /* Get tick count */
  tickstart = HAL_GetTick();

  /* Wait until end of unitary conversion flag is raised */
  flag_eoc_mst = LL_ADC_IsActiveFlag_EOC(p_instance_mst);
  flag_eoc_slv = LL_ADC_IsActiveFlag_EOC(p_instance_slv);
  while ((flag_eoc_mst == 0UL) && (flag_eoc_slv == 0UL))
  {
    if ((HAL_GetTick() - tickstart) > timeout_ms)
    {
      /* New check to avoid false timeout detection in case of preemption */
      flag_eoc_mst = LL_ADC_IsActiveFlag_EOC(p_instance_mst);
      flag_eoc_slv = LL_ADC_IsActiveFlag_EOC(p_instance_slv);
      if ((flag_eoc_mst == 0UL) && (flag_eoc_slv == 0UL))
      {
        return HAL_TIMEOUT;
      }
    }
    flag_eoc_mst = LL_ADC_IsActiveFlag_EOC(p_instance_mst);
    flag_eoc_slv = LL_ADC_IsActiveFlag_EOC(p_instance_slv);
  }

  /* Clear flag */
  LL_ADC_ClearFlag_EOC(p_instance_mst);
  LL_ADC_ClearFlag_EOC(p_instance_slv);

  if (hadc->group_conv_per_start[ADC_GROUP_REGULAR] == HAL_ADC_GROUP_CONV_UNIT)
  {
    hadc->group_state[ADC_GROUP_REGULAR] = HAL_ADC_GROUP_STATE_IDLE;
    /* ADC slave state machine update */
    hadc->p_link_next_handle->group_state[ADC_GROUP_REGULAR] = HAL_ADC_GROUP_STATE_IDLE;
  }

  return HAL_OK;
}

/**
  * @brief  Multimode operation: Get ADC group regular conversion data of ADC master, ADC slave
  *         or ADC master and slave concatenated.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @param  multi_inst Value of hal_adc_mm_inst_t:
  *         @arg @ref HAL_ADC_MM_MASTER       (1)
  *         @arg @ref HAL_ADC_MM_SLAVE        (1)
  *         @arg @ref HAL_ADC_MM_MASTER_SLAVE
  *
  *         (1) Parameter available only if ADC multimode group regular data format with packing option on 32 bits
  *             (refer to @ref hal_adc_mm_reg_data_format_t).
  * @note   This function is relevant only for ADC multimode group regular data format with packing: each ADC conversion
  *         data concatenated in a single register (refer to @ref hal_adc_mm_reg_data_format_t).
  * @note   Each ADC conversion data width is limited to 8 or 16 bits depending on data packing setting.
  *         If expected data width is wider (this can be the case with features extending data width (oversampling,
  *         data shift,...), others services must be used:
  *         - function "HAL_ADC_REG_ReadConversionData()" for each ADC instance part of multimode.
  *         - multimode functions with data transfer by DMA.
  * @note   Returned value is unsigned, due to concatenation of multiple data.
  *         In case of signed data expected (with features changing data sign: offset),
  *         use function "HAL_ADC_REG_ReadConversionData()" for each ADC instance part of multimode.
  * @retval conversion data (unsigned value between Min_Data = 0x00000000 and Max_Data = 0xFFFFFFFF)
  */
uint32_t HAL_ADC_MM_REG_ReadConversionData(const hal_adc_handle_t *hadc, hal_adc_mm_inst_t multi_inst)
{
  ASSERT_DBG_PARAM(hadc != NULL);

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(ADC_GET_INSTANCE(hadc)) == ADC_GET_INSTANCE(hadc));

  ASSERT_DBG_PARAM(LL_ADC_GetMultiDMATransfer(ADC_COMMON_INSTANCE(ADC_GET_INSTANCE(hadc)))
                   != LL_ADC_MULTI_REG_DMA_EACH_ADC);
  adc_assert_state_mm_inst(hadc, HAL_ADC_COMMON_STATE_MM,
                           (hal_adc_state_t)((uint32_t)HAL_ADC_STATE_INIT
                                             | (uint32_t)HAL_ADC_STATE_CONFIGURING
                                             | (uint32_t)HAL_ADC_STATE_CALIB
                                             | (uint32_t)HAL_ADC_STATE_IDLE
                                             | (uint32_t)HAL_ADC_STATE_ACTIVE));

  uint32_t data = LL_ADC_REG_ReadMultiConversionData32(ADC_COMMON_INSTANCE(ADC_GET_INSTANCE(hadc)),
                                                       (uint32_t)multi_inst);

  return data;
}

/**
  * @brief  Multimode operation: Start conversion on multimode ADC instances group injected.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @warning  Prerequisite: HAL ADC handles part of multimode setup must have been linked using function
  *           @ref HAL_ADC_SetLinkNextHandle()
  *           and multimode must have been configured using function @ref HAL_ADC_MM_SetConfig().
  * @retval HAL_BUSY          HAL ADC state machine not in expected initial state
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_INJ_StartConv(hal_adc_handle_t *hadc)
{
  hal_status_t status;
  ADC_TypeDef *p_instance_mst;

  ASSERT_DBG_PARAM(hadc != NULL);

  p_instance_mst = ADC_GET_INSTANCE(hadc);

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(p_instance_mst) == p_instance_mst);

  /* Check state of all HAL ADC handles part of multimode */
  adc_assert_state_mm_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE);
  adc_assert_state_mm_inj(hadc, HAL_ADC_GROUP_STATE_IDLE);

