MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  status = adc_mm_check_set_state_group(hadc, ADC_GROUP_INJECTED,
                                        HAL_ADC_GROUP_STATE_IDLE,
                                        HAL_ADC_GROUP_STATE_ACTIVE);

  if (status == HAL_OK)
  {
    LL_ADC_INJ_StartConversion(p_instance_mst);
  }

  return status;
}

/**
  * @brief  Multimode operation: Start conversion on multimode ADC instances group injected with interruption: default
  *         interruptions.
  *         Default interruptions used: end of unitary conversion, overrun. To use other interruptions,
  *         refer to HAL_ADC_MM_INJ_StartConv_IT_Opt().
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @note   Callback functions "HAL_ADC_INJ_...Callback()" (corresponding to these interruptions) will be triggered.
  * @warning  Prerequisite: HAL ADC handles part of multimode setup must have been linked using function
  *           @ref HAL_ADC_SetLinkNextHandle()
  *           and multimode must have been configured using function @ref HAL_ADC_MM_SetConfig().
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_INJ_StartConv_IT(hal_adc_handle_t *hadc)
{
  hal_status_t status;

  status = HAL_ADC_MM_INJ_StartConv_IT_Opt(hadc, HAL_ADC_OPT_IT_INJ_EOC);

  return status;
}

/**
  * @brief  Multimode operation: Start conversion on multimode ADC instances group injected with interruption: selected
  *         optional interruptions.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @param  it_opt Can be a combination of values (subset of @ref ADC_optional_interruptions):
  *         @arg @ref HAL_ADC_OPT_IT_NONE
  *         @arg @ref HAL_ADC_OPT_IT_INJ_EOC
  *         @arg @ref HAL_ADC_OPT_IT_INJ_EOS
  *         @arg @ref HAL_ADC_OPT_IT_AWD_1
  *         @arg @ref HAL_ADC_OPT_IT_AWD_2
  *         @arg @ref HAL_ADC_OPT_IT_AWD_3
  * @note   Callback functions "HAL_ADC_INJ_...Callback()" (corresponding to these interruptions) will be triggered.
  * @warning  Prerequisite: HAL ADC handles part of multimode setup must have been linked using function
  *           @ref HAL_ADC_SetLinkNextHandle()
  *           and multimode must have been configured using function @ref HAL_ADC_MM_SetConfig().
  * @retval HAL_BUSY          HAL ADC state machine not in expected initial state
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_INJ_StartConv_IT_Opt(hal_adc_handle_t *hadc, uint32_t it_opt)
{
  hal_status_t status;
  ADC_TypeDef *p_instance_mst;
  ADC_TypeDef *p_instance_slv;

  ASSERT_DBG_PARAM(hadc != NULL);
  ASSERT_DBG_PARAM(IS_ADC_OPT_IT_INJ(it_opt));

  p_instance_mst = ADC_GET_INSTANCE(hadc);
  p_instance_slv = ADC_GET_INSTANCE(hadc->p_link_next_handle);

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(p_instance_mst) == p_instance_mst);

  /* Check state of all HAL ADC handles part of multimode */
  adc_assert_state_mm_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE);
  adc_assert_state_mm_inj(hadc, HAL_ADC_GROUP_STATE_IDLE);

  status = adc_mm_check_set_state_group(hadc, ADC_GROUP_INJECTED,
                                        HAL_ADC_GROUP_STATE_IDLE,
                                        HAL_ADC_GROUP_STATE_ACTIVE);

  if (status == HAL_OK)
  {
    /* Manage optional interruptions */
    LL_ADC_ClearFlag(p_instance_mst, it_opt);
    LL_ADC_ClearFlag(p_instance_slv, it_opt);
    LL_ADC_EnableIT(p_instance_mst, it_opt);

    LL_ADC_INJ_StartConversion(p_instance_mst);
  }

  return status;
}

/**
  * @brief  Trigger conversion (SW start) on multimode ADC instances group injected for a conversion process ongoing.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @note   This function can be used to iterate a conversion process ongoing initiated
  *         by HAL_ADC_MM_INJ_StartConv...() (for example, sequence in discontinuous mode or DMA transfer
  *         from unitary conversions by SW start).
  * @warning Necessary condition: previous conversion must be completed (state HAL_ADC_GROUP_STATE_IDLE, ensured by
  *         polling (HAL_ADC_INJ_PollForConv()) or interruption (HAL_ADC_IRQHandler()).
  * @retval HAL_BUSY          HAL ADC state machine not in expected initial state
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_INJ_TrigNextConv(hal_adc_handle_t *hadc)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance_mst;

  ASSERT_DBG_PARAM(hadc != NULL);

  p_instance_mst = ADC_GET_INSTANCE(hadc);

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(p_instance_mst) == p_instance_mst);

  ASSERT_DBG_PARAM(LL_ADC_INJ_IsTriggerSourceSWStart(p_instance_mst) != 0U);

  adc_assert_state_mm_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE);

  /* Check state of all HAL ADC handles part of multimode */
  adc_assert_state_mm_inj(hadc, (hal_adc_group_state_t)((uint32_t)HAL_ADC_GROUP_STATE_IDLE |
                                                        (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE));

  if (LL_ADC_INJ_IsConversionOngoing(p_instance_mst) != 0U)
  {
    status = HAL_ERROR;
  }
  else
  {
    if (hadc->group_state[ADC_GROUP_INJECTED] == HAL_ADC_GROUP_STATE_IDLE)
    {
      status = adc_mm_check_set_state_group(hadc, ADC_GROUP_INJECTED,
                                            HAL_ADC_GROUP_STATE_IDLE,
                                            HAL_ADC_GROUP_STATE_ACTIVE);
    }

    LL_ADC_INJ_StartConversion(p_instance_mst);
  }

  return status;
}

/**
  * @brief  Multimode operation: Stop conversion on multimode ADC instances group injected.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_INJ_StopConv(hal_adc_handle_t *hadc)
{
  hal_status_t status;

  ASSERT_DBG_PARAM(hadc != NULL);

  /* Check state of all HAL ADC handles part of multimode */
  adc_assert_state_mm_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE);
  adc_assert_state_mm_inj(hadc, (hal_adc_group_state_t)((uint32_t)HAL_ADC_GROUP_STATE_IDLE |
                                                        (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE));

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(ADC_GET_INSTANCE(hadc)) == ADC_GET_INSTANCE(hadc));

  /* Multimode conversions controlled by ADC master only */
  status = adc_inj_stop_conversion(hadc);

  adc_mm_set_state_inst_inj(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE, HAL_ADC_GROUP_STATE_IDLE);

