MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  return status;
}

/**
  * @brief  Multimode operation: Stop conversion on multimode ADC instances group injected.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @note   This function disable interruptions enabled by start conversion function except
  *         analog watchdog interrutpions possibly used by group regular. To disable them, use @ref HAL_ADC_Stop().
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_INJ_StopConv_IT(hal_adc_handle_t *hadc)
{
  hal_status_t status;
  ADC_TypeDef *p_instance_mst;

  ASSERT_DBG_PARAM(hadc != NULL);

  /* Check state of all HAL ADC handles part of multimode */
  adc_assert_state_mm_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE);
  adc_assert_state_mm_inj(hadc, (hal_adc_group_state_t)((uint32_t)HAL_ADC_GROUP_STATE_IDLE |
                                                        (uint32_t)HAL_ADC_GROUP_STATE_ACTIVE));

  p_instance_mst = ADC_GET_INSTANCE(hadc);

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(p_instance_mst) == p_instance_mst);

  /* Multimode conversions controlled by ADC master only */
  status = adc_inj_stop_conversion(hadc);

  /* Disable interruptions */
  LL_ADC_DisableIT(p_instance_mst, LL_ADC_IT_JEOC | LL_ADC_IT_JEOS);

  adc_mm_set_state_inst_inj(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE, HAL_ADC_GROUP_STATE_IDLE);

  return status;
}

/**
  * @brief  Multimode operation: Wait for conversion on ADC group injected to be completed
  *         (for all ADC instances part of multimode).
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @param  timeout_ms ADC conversion timeout value (unit: ms)
  * @retval HAL_TIMEOUT       Operation exceeds user timeout
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
hal_status_t HAL_ADC_MM_INJ_PollForConv(hal_adc_handle_t *hadc, uint32_t timeout_ms)
{
  ADC_TypeDef *p_instance_mst;
  ADC_TypeDef *p_instance_slv;
  uint32_t flag_eoc_mst;
  uint32_t flag_eoc_slv;
  uint32_t tickstart;

  ASSERT_DBG_PARAM(hadc != NULL);

  adc_assert_state_mm_inst(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE);

  p_instance_mst = ADC_GET_INSTANCE(hadc);
  p_instance_slv = ADC_GET_INSTANCE(hadc->p_link_next_handle);

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(p_instance_mst) == p_instance_mst);

  /* Get tick count */
  tickstart = HAL_GetTick();

  /* Wait until end of unitary conversion flag is raised */
  flag_eoc_mst = LL_ADC_IsActiveFlag_JEOC(p_instance_mst);
  flag_eoc_slv = LL_ADC_IsActiveFlag_JEOC(p_instance_slv);
  while ((flag_eoc_mst == 0UL) && (flag_eoc_slv == 0UL))
  {
    if ((HAL_GetTick() - tickstart) > timeout_ms)
    {
      /* New check to avoid false timeout detection in case of preemption */
      flag_eoc_mst = LL_ADC_IsActiveFlag_JEOC(p_instance_mst);
      flag_eoc_slv = LL_ADC_IsActiveFlag_JEOC(p_instance_slv);
      if ((flag_eoc_mst == 0UL) && (flag_eoc_slv == 0UL))
      {
        return HAL_TIMEOUT;
      }
    }
    flag_eoc_mst = LL_ADC_IsActiveFlag_JEOC(p_instance_mst);
    flag_eoc_slv = LL_ADC_IsActiveFlag_JEOC(p_instance_slv);
  }

  /* Clear flag */
  LL_ADC_ClearFlag_JEOC(p_instance_mst);
  LL_ADC_ClearFlag_JEOC(p_instance_slv);

  if (hadc->group_conv_per_start[ADC_GROUP_INJECTED] == HAL_ADC_GROUP_CONV_UNIT)
  {
    hadc->group_state[ADC_GROUP_INJECTED] = HAL_ADC_GROUP_STATE_IDLE;
    /* ADC slave state machine update */
    hadc->p_link_next_handle->group_state[ADC_GROUP_INJECTED] = HAL_ADC_GROUP_STATE_IDLE;
  }

  return HAL_OK;
}

/**
  * @brief  Multimode operation: Get ADC group injected conversion data of ADC master, ADC slave
  *         or ADC master and slave concatenated.
  * @param  hadc Pointer to a hal_adc_handle_t structure.
  * @param  multi_inst Value of hal_adc_mm_inst_t
  * @param  sequencer_rank ADC group injected sequencer rank.
  *                        Can be a number between Min_Data = 1, Max_Data = 4
  * @note   With ADC master and slave concatenated: Data width is limited to 16 bits (due to register 32 bits containing
  *         conversion data of two ADC instances: ADC master and slave data in ranges [15:0] and [31:16] respectively).
  *         If expected data width is wider (this can be the case with features extending data width (oversampling,
  *         data shift,...), others services must be used:
  *         - this function with parameter HAL_ADC_MM_MASTER or HAL_ADC_MM_SLAVE
  *         - function "HAL_ADC_INJ_ReadConversionDataRank()" for each ADC instance part of multimode.
  * @note   Returned value is unsigned, due to concatenation of multiple data.
  *         In case of signed data expected (with features changing data sign: offset),
  *         use function "HAL_ADC_INJ_ReadConversionDataRank()" for each ADC instance part of multimode.
  * @retval conversion data (unsigned value between Min_Data = 0x00000000 and Max_Data = 0xFFFFFFFF)
  */
uint32_t HAL_ADC_MM_INJ_ReadConversionDataRank(const hal_adc_handle_t *hadc, hal_adc_mm_inst_t multi_inst,
                                               uint8_t sequencer_rank)
{
  ADC_TypeDef *p_instance_mst;
  ADC_TypeDef *p_instance_slv;
  uint32_t sequencer_rank_ll_format;
  uint32_t data;

  ASSERT_DBG_PARAM(hadc != NULL);

  /* Check whether HAL ADC handle is the one of ADC master */
  ASSERT_DBG_PARAM(ADC_MULTI_INSTANCE_MASTER(ADC_GET_INSTANCE(hadc)) == ADC_GET_INSTANCE(hadc));

  adc_assert_state_mm_inst(hadc, HAL_ADC_COMMON_STATE_MM,
                           (hal_adc_state_t)((uint32_t)HAL_ADC_STATE_INIT
                                             | (uint32_t)HAL_ADC_STATE_CONFIGURING
                                             | (uint32_t)HAL_ADC_STATE_CALIB
                                             | (uint32_t)HAL_ADC_STATE_IDLE
                                             | (uint32_t)HAL_ADC_STATE_ACTIVE));

