MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
  p_instance_mst = ADC_GET_INSTANCE(hadc);
  p_instance_slv = ADC_GET_INSTANCE(hadc->p_link_next_handle);
  sequencer_rank_ll_format = LL_ADC_DECIMAL_NB_TO_INJ_SEQ_RANK(sequencer_rank);

  if (multi_inst == HAL_ADC_MM_MASTER)
  {
    data = LL_ADC_INJ_ReadConversionData32Rank(p_instance_mst, sequencer_rank_ll_format);
  }
  else if (multi_inst == HAL_ADC_MM_SLAVE)
  {
    data = LL_ADC_INJ_ReadConversionData32Rank(p_instance_slv, sequencer_rank_ll_format);
  }
  else
  {
    /* Concatenate data in 32 bits registers */
    data = LL_ADC_INJ_ReadConversionData32Rank(p_instance_mst, sequencer_rank_ll_format);
    data |= (LL_ADC_INJ_ReadConversionData32Rank(p_instance_slv, sequencer_rank_ll_format) << 16U);
  }

  return data;
}
#endif /* ADC_MULTIMODE_SUPPORT */

/**
  * @}
  */

/** @addtogroup ADC_Exported_Functions_Group6
  * @{
    This subsection provides functions allowing to:
      + Set a user data pointer (ex: a user context) in a HAL ADC handle,
      + Get a user data pointer (ex: a user context) from a HAL ADC handle.
    @note A typical usage is to set user data pointer before starting a data conversion,
          then retrieve it within the user conversion completion callback.
  */
#if defined(USE_HAL_ADC_USER_DATA) && (USE_HAL_ADC_USER_DATA == 1)
/**
  * @brief  Store  user data pointer into the adc handle.
  * @param  hadc Pointer to a hal_adc_handle_t.
  * @param  p_user_data Pointer to the user data.
  */
void HAL_ADC_SetUserData(hal_adc_handle_t *hadc, const void *p_user_data)
{
  ASSERT_DBG_PARAM(hadc != NULL);

  hadc->p_user_data = p_user_data;
}

/**
  * @brief  Retrieve user data pointer from the adc handle.
  * @param  hadc Pointer to a hal_adc_handle_t.
  * @retval (void*) the pointer to the user data, when previously set by HAL_ADC_SetUserData().
  * @retval NULL other way.
  */
const void *HAL_ADC_GetUserData(const hal_adc_handle_t *hadc)
{
  ASSERT_DBG_PARAM(hadc != NULL);

  return (hadc->p_user_data);
}

#endif /* USE_HAL_ADC_USER_DATA */
/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup ADC_Private_Functions
  * @{
  */

#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
/**
  * @brief  DMA data half transfer callback for ADC group regular.
  * @param  hdma pointer to a hal_dma_handle_t structure
  */
static void adc_reg_dma_data_transfer_half_callback(hal_dma_handle_t *hdma)
{
  hal_adc_handle_t *hadc = (hal_adc_handle_t *)(hdma->p_parent);

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
  hadc->p_reg_xfer_half_cb(hadc);
#else
  HAL_ADC_REG_DataTransferHalfCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA data transfer complete callback for ADC group regular.
  * @param  hdma pointer to a hal_dma_handle_t structure
  */
static void adc_reg_dma_data_transfer_cplt_callback(hal_dma_handle_t *hdma)
{
  hal_adc_handle_t *hadc = (hal_adc_handle_t *)(hdma->p_parent);

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
  hadc->p_reg_xfer_cplt_cb(hadc);
#else
  HAL_ADC_REG_DataTransferCpltCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA data transfer stop callback for ADC group regular.
  * @param  hdma pointer to a hal_dma_handle_t structure
  */
static void adc_reg_dma_data_transfer_stop_callback(hal_dma_handle_t *hdma)
{
  hal_adc_handle_t *hadc = (hal_adc_handle_t *)(hdma->p_parent);

  hadc->group_state[ADC_GROUP_REGULAR] = HAL_ADC_GROUP_STATE_IDLE;

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
  hadc->p_reg_xfer_stop_cb(hadc);
#else
  HAL_ADC_REG_DataTransferStopCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
}

#if defined(ADC_MULTIMODE_SUPPORT)
/**
  * @brief  DMA data transfer stop callback for ADC group regular.
  * @param  hdma pointer to a hal_dma_handle_t structure
  */
static void adc_mm_reg_dma_data_transfer_stop_callback(hal_dma_handle_t *hdma)
{
  hal_adc_handle_t *hadc = (hal_adc_handle_t *)(hdma->p_parent);

  adc_mm_set_state_inst_reg(hadc, HAL_ADC_COMMON_STATE_MM, HAL_ADC_STATE_ACTIVE, HAL_ADC_GROUP_STATE_IDLE);

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
  hadc->p_reg_xfer_stop_cb(hadc);
#else
  HAL_ADC_REG_DataTransferStopCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
}
#endif /* ADC_MULTIMODE_SUPPORT */

/**
  * @brief  DMA data transfer error callback for ADC group regular.
  * @param  hdma pointer to a hal_dma_handle_t structure
  */
static void adc_reg_dma_data_transfer_error_callback(hal_dma_handle_t *hdma)
{
  hal_adc_handle_t *hadc = (hal_adc_handle_t *)(hdma->p_parent);

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
  hadc->p_error_cb(hadc);
#else
  HAL_ADC_ErrorCallback(hadc);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
}

#endif /* USE_HAL_ADC_DMA */

/**
  * @brief  Activate the selected ADC instance.
  * @param  hadc Pointer to a hal_adc_handle_t structure
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
static hal_status_t adc_activate(hal_adc_handle_t *hadc)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance = ADC_GET_INSTANCE(hadc);
  uint32_t tickstart;
  uint32_t enabled_internal_channel;
  uint32_t internal_channel_stab_time_us;

  /* ADC enable and wait for ADC ready (in case of ADC disabled or enabling phase not yet completed: flag ADC ready
     not yet set).
     Timeout implemented to not be stuck if ADC cannot be enabled (possible causes: ADC clock not running, ...). */
  if (LL_ADC_IsEnabled(p_instance) == 0UL)
  {
    if (LL_ADC_IsInternalRegulatorEnabled(p_instance) == 0U)
    {
      /* Disable ADC deep power down (enabled by default after reset state) */
      LL_ADC_DisableDeepPowerDown(p_instance);

      /* Enable ADC internal voltage regulator */
      LL_ADC_EnableInternalRegulator(p_instance);

      /* Delay for ADC internal voltage regulator stabilization */
      ADC_DELAY_US(LL_ADC_DELAY_INTERNAL_REGUL_STAB_US);
    }

