MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
    /* Check if conditions to enable the ADC are fulfilled */
    if ((p_instance->CR & (ADC_CR_ADCAL | ADC_CR_JADSTP | ADC_CR_ADSTP | ADC_CR_JADSTART | ADC_CR_ADSTART
                           | ADC_CR_ADDIS | ADC_CR_ADEN)) != 0UL)
    {
      status = HAL_ERROR;
    }
    else
    {
      LL_ADC_ClearFlag_ADRDY(p_instance);

      LL_ADC_Enable(p_instance);

      /* Wait for ADC effectively enabled */
      tickstart = HAL_GetTick();
      /* Poll for ADC ready flag raised */
      while (LL_ADC_IsActiveFlag_ADRDY(p_instance) == 0UL)
      {
        /* If ADEN bit is set less than 4 ADC clock cycles after the ADCAL bit has been cleared (after a calibration),
           ADEN bit is reset by the calibration logic.
           The workaround is to continue setting ADEN until ADRDY is becomes 1.
           Additionally, ADC_ENABLE_TIMEOUT_MS is defined to encompass this 4 ADC clock cycle duration */
        /* Note: Test of ADC enabled required due to hardware constraint to not enable ADC if already enabled. */
        if (LL_ADC_IsEnabled(p_instance) == 0UL)
        {
          LL_ADC_Enable(p_instance);
        }

        if ((HAL_GetTick() - tickstart) > ADC_ENABLE_TIMEOUT_MS)
        {
          /* New check to avoid false timeout detection in case of preemption */
          if (LL_ADC_IsActiveFlag_ADRDY(p_instance) == 0UL)
          {
            status = HAL_ERROR;
            break;
          }
        }
      }

      /* Delay for ADC internal channel voltage stabilization */
      enabled_internal_channel = LL_ADC_GetCommonPathInternalCh(ADC_COMMON_INSTANCE(p_instance));
      if ((enabled_internal_channel & (LL_ADC_PATH_INTERNAL_VREFINT | LL_ADC_PATH_INTERNAL_TEMPSENSOR)) != 0UL)
      {
        if ((enabled_internal_channel & LL_ADC_PATH_INTERNAL_TEMPSENSOR) != 0UL)
        {
          /* Case single internal channel enabled (temperature sensor) or multiple internal channels */
          /* Note: Temperature sensor stabilization delay encompasses VrefInt stabilization delay */
          internal_channel_stab_time_us = LL_ADC_DELAY_TEMPSENSOR_STAB_US;
        }
        else
        {
          /* Case single internal channel enabled (VrefInt) */
          internal_channel_stab_time_us = LL_ADC_DELAY_VREFINT_STAB_US;
        }

        /* Delay for ADC internal channel stabilization */
        ADC_DELAY_US(internal_channel_stab_time_us);
      }
    }

#if defined(USE_HAL_ADC_GET_LAST_ERRORS) && (USE_HAL_ADC_GET_LAST_ERRORS == 1)
    if (status != HAL_OK)
    {
      hadc->last_error_codes |= HAL_ADC_ERROR_INTERNAL;
    }
#endif /* USE_HAL_ADC_GET_LAST_ERRORS */
  }

  return status;
}

/**
  * @brief  Deactivate the selected ADC instance.
  * @param  hadc Pointer to a hal_adc_handle_t structure
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
static hal_status_t adc_deactivate(hal_adc_handle_t *hadc)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance = ADC_GET_INSTANCE(hadc);
  uint32_t tickstart;
  const uint32_t tmp_adc_is_disable_on_going = LL_ADC_IsDisableOngoing(p_instance);

  /* Verification if ADC is not already disabled */
  /* Note: forbidden to disable ADC (set bit ADC_CR_ADDIS) if ADC is already
           disabled. */
  if ((LL_ADC_IsEnabled(p_instance) != 0UL)
      && (tmp_adc_is_disable_on_going == 0UL)
     )
  {
    /* Check if conditions to disable the ADC are fulfilled */
    if ((p_instance->CR & (ADC_CR_JADSTART | ADC_CR_ADSTART | ADC_CR_ADEN)) != ADC_CR_ADEN)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* Disable the ADC peripheral */
      LL_ADC_Disable(p_instance);

      LL_ADC_ClearFlag_ADRDY(p_instance);

      /* Wait for ADC effectively disabled */
      /* Get tick count */
      tickstart = HAL_GetTick();

      while (LL_ADC_IsEnabled(p_instance) != 0UL)
      {
        if ((HAL_GetTick() - tickstart) > ADC_DISABLE_TIMEOUT_MS)
        {
          /* New check to avoid false timeout detection in case of preemption */
          if (LL_ADC_IsEnabled(p_instance) != 0UL)
          {
            status = HAL_ERROR;
            break;
          }
        }
      }
    }

    if (status == HAL_OK)
    {
      /* Set ADC instance to deepest disable level.
         Note: Except case of basic disable state needed by internal process */
      if (hadc->global_state != HAL_ADC_STATE_CALIB)
      {
        LL_ADC_DisableInternalRegulator(p_instance);
        LL_ADC_EnableDeepPowerDown(p_instance);
      }
    }
    else
    {
#if defined(USE_HAL_ADC_GET_LAST_ERRORS) && (USE_HAL_ADC_GET_LAST_ERRORS == 1)
      hadc->last_error_codes |= HAL_ADC_ERROR_INTERNAL;
#endif /* USE_HAL_ADC_GET_LAST_ERRORS */
    }
  }

  return status;
}

/**
  * @brief  Calibrate the selected ADC instance.
  * @param  hadc Pointer to a hal_adc_handle_t structure
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
static hal_status_t adc_calibrate(hal_adc_handle_t *hadc)
{
  hal_status_t status;
  ADC_TypeDef *p_instance;
  uint32_t tickstart;
  __IO uint32_t wait_loop_index;

  p_instance = ADC_GET_INSTANCE(hadc);

  /* Set ADC state for self-calibration */
  status = adc_deactivate(hadc);

  if (status == HAL_OK)
  {
    /* Perform ADC self-calibration */
    LL_ADC_StartCalibration(p_instance, LL_ADC_IN_SINGLE_ENDED);

    /* Poll for ADC calibration completion */
    tickstart = HAL_GetTick();
    while (LL_ADC_IsCalibrationOnGoing(p_instance) != 0UL)
    {
      if ((HAL_GetTick() - tickstart) > ADC_CALIBRATION_TIMEOUT_MS)
      {
        /* New check to avoid false timeout detection in case of preemption */
        if (LL_ADC_IsCalibrationOnGoing(p_instance) != 0UL)
        {
          status = HAL_ERROR;
          break;
        }
      }
    }

    /* Calibration end phase */
    if (status == HAL_OK)
    {
      /* Restore ADC state */
      /* 1. Delay between ADC end of calibration and ADC enable */
      /* Note: Variable divided by 2 to compensate partially CPU processing cycles (depends on compilation
               optimization) */
      wait_loop_index = (ADC_DELAY_CALIB_ENABLE_CPU_CYCLES >> 1U);
      while (wait_loop_index != 0U)
      {
        wait_loop_index--;
      }

