MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.c
      /* 2. Activate ADC */
      status = adc_activate(hadc);
    }
  }

  if (status != HAL_OK)
  {
#if defined(USE_HAL_ADC_GET_LAST_ERRORS) && (USE_HAL_ADC_GET_LAST_ERRORS == 1)
    hadc->last_error_codes |= HAL_ADC_ERROR_INTERNAL;
#endif /* USE_HAL_ADC_GET_LAST_ERRORS */
  }

  return status;
}

/**
  * @brief  Stop conversion on ADC group regular (low level).
  * @param  hadc Pointer to a hal_adc_handle_t structure
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
static hal_status_t adc_reg_stop_conversion(hal_adc_handle_t *hadc)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance = ADC_GET_INSTANCE(hadc);
  uint32_t tickstart;

  /* Stop ADC conversion */
  LL_ADC_REG_StopConversion(p_instance);

  /* Wait for ADC conversion effectively stopped */
  tickstart = HAL_GetTick();
  while (LL_ADC_REG_IsConversionOngoing(p_instance) != 0UL)
  {
    if ((HAL_GetTick() - tickstart) > ADC_CONV_STOP_TIMEOUT_MS)
    {
      /* New check to avoid false timeout detection in case of preemption */
      if (LL_ADC_REG_IsConversionOngoing(p_instance) != 0UL)
      {
        status = HAL_ERROR;
#if defined(USE_HAL_ADC_GET_LAST_ERRORS) && (USE_HAL_ADC_GET_LAST_ERRORS == 1)
        hadc->last_error_codes |= HAL_ADC_ERROR_INTERNAL;
#endif /* USE_HAL_ADC_GET_LAST_ERRORS */
        break;
      }
    }
  }

  return status;
}

/**
  * @brief  Stop conversion on ADC group injected (low level).
  * @param  hadc Pointer to a hal_adc_handle_t structure
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_OK            Operation completed successfully
  */
static hal_status_t adc_inj_stop_conversion(hal_adc_handle_t *hadc)
{
  hal_status_t status = HAL_OK;
  ADC_TypeDef *p_instance = ADC_GET_INSTANCE(hadc);
  uint32_t tickstart;

  /* Stop ADC conversion */
  LL_ADC_INJ_StopConversion(p_instance);

  /* Wait for ADC conversion effectively stopped */
  tickstart = HAL_GetTick();
  while (LL_ADC_INJ_IsConversionOngoing(p_instance) != 0UL)
  {
    if ((HAL_GetTick() - tickstart) > ADC_CONV_STOP_TIMEOUT_MS)
    {
      /* New check to avoid false timeout detection in case of preemption */
      if (LL_ADC_INJ_IsConversionOngoing(p_instance) != 0UL)
      {
        status = HAL_ERROR;
#if defined(USE_HAL_ADC_GET_LAST_ERRORS) && (USE_HAL_ADC_GET_LAST_ERRORS == 1)
        hadc->last_error_codes |= HAL_ADC_ERROR_INTERNAL;
#endif /* USE_HAL_ADC_GET_LAST_ERRORS */
        break;
      }
    }
  }

  return status;
}

#if defined(ADC_MULTIMODE_SUPPORT)
/**
  * @brief  For all HAL ADC handles part of multimode, check handles state: multimode, instance.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @param  common_state_expected  Expected state of HAL handle related to ADC common instance
  * @param  instance_state_expected  Expected state of HAL handle related to ADC instance
  */
static void adc_assert_state_mm_inst(const hal_adc_handle_t *hadc,
                                     const hal_adc_common_state_t common_state_expected,
                                     const hal_adc_state_t instance_state_expected)
{
#if defined(USE_ASSERT_DBG_STATE)
  hal_adc_handle_t *p_handle_current = (hal_adc_handle_t *)hadc;
  uint32_t index;

  /* Parse multimode instances through links of daisy chain (starting from ADC master) */
  for (index = 0; index < ADC_MM_INST_COUNT; index++)
  {
    ASSERT_DBG_STATE(p_handle_current->common_state, common_state_expected);
    ASSERT_DBG_STATE(p_handle_current->global_state, instance_state_expected);
    p_handle_current = p_handle_current->p_link_next_handle;
  }
#else
  STM32_UNUSED(hadc);
  STM32_UNUSED(common_state_expected);
  STM32_UNUSED(instance_state_expected);
#endif /* USE_ASSERT_DBG_STATE */
}

/**
  * @brief  For all HAL ADC handles part of multimode, check handles state: group regular.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @param  group_state_expected  Expected state of HAL handle related to ADC group regular
  */
static void adc_assert_state_mm_reg(const hal_adc_handle_t *hadc,
                                    const hal_adc_group_state_t group_state_expected)
{
#if defined(USE_ASSERT_DBG_STATE)
  hal_adc_handle_t *p_handle_current = (hal_adc_handle_t *)hadc;
  uint32_t index;

  /* Parse multimode instances through links of daisy chain (starting from ADC master) */
  for (index = 0; index < ADC_MM_INST_COUNT; index++)
  {
    ASSERT_DBG_STATE(p_handle_current->group_state[ADC_GROUP_REGULAR], group_state_expected);

    p_handle_current = p_handle_current->p_link_next_handle;
  }
#else
  STM32_UNUSED(hadc);
  STM32_UNUSED(group_state_expected);
#endif /* USE_ASSERT_DBG_STATE */
}

/**
  * @brief  For all HAL ADC handles part of multimode, check handles state: group injected.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @param  group_state_expected  Expected state of HAL handle related to ADC group injected
  */
static void adc_assert_state_mm_inj(const hal_adc_handle_t *hadc,
                                    const hal_adc_group_state_t group_state_expected)
{
#if defined(USE_ASSERT_DBG_STATE)
  hal_adc_handle_t *p_handle_current = (hal_adc_handle_t *)hadc;
  uint32_t index;

  /* Parse multimode instances through links of daisy chain (starting from ADC master) */
  for (index = 0; index < ADC_MM_INST_COUNT; index++)
  {
    ASSERT_DBG_STATE(p_handle_current->group_state[ADC_GROUP_INJECTED], group_state_expected);

    p_handle_current = p_handle_current->p_link_next_handle;
  }
#else
  STM32_UNUSED(hadc);
  STM32_UNUSED(group_state_expected);
#endif /* USE_ASSERT_DBG_STATE */
}

/**
  * @brief  For all HAL ADC handles part of multimode, set handles state: multimode, instance.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @param  common_state  State of HAL handle related to ADC common instance
  * @param  instance_state  State of HAL handle related to ADC instance
  */
static void adc_mm_set_state_inst(hal_adc_handle_t *hadc,
                                  hal_adc_common_state_t common_state,
                                  hal_adc_state_t instance_state)
{
  hal_adc_handle_t *p_handle_current = hadc;
  uint32_t index;

  /* Parse multimode instances through links of daisy chain (starting from ADC master) */
  for (index = 0; index < ADC_MM_INST_COUNT; index++)
  {
    p_handle_current->common_state = common_state;
    p_handle_current->global_state = instance_state;

    p_handle_current = p_handle_current->p_link_next_handle;
  }
}

/**
  * @brief  For all HAL ADC handles part of multimode, set handles state: multimode, instance, group regular.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @param  common_state  State of HAL handle related to ADC common instance
  * @param  instance_state  State of HAL handle related to ADC instance
  * @param  group_state  State of HAL handle related to ADC group regular
  */
static void adc_mm_set_state_inst_reg(hal_adc_handle_t *hadc,
                                      hal_adc_common_state_t common_state,
                                      hal_adc_state_t instance_state,
                                      hal_adc_group_state_t group_state)
{
  hal_adc_handle_t *p_handle_current = hadc;
  uint32_t index;

  /* Parse multimode instances through links of daisy chain (starting from ADC master) */
  for (index = 0; index < ADC_MM_INST_COUNT; index++)
  {
    p_handle_current->common_state = common_state;
    p_handle_current->global_state = instance_state;
    p_handle_current->group_state[ADC_GROUP_REGULAR] = group_state;

    p_handle_current = p_handle_current->p_link_next_handle;
  }
}

/**
  * @brief  For all HAL ADC handles part of multimode, set handles state: multimode, instance, group injected.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @param  common_state  State of HAL handle related to ADC common instance
  * @param  instance_state  State of HAL handle related to ADC instance
  * @param  group_state  State of HAL handle related to ADC group injected
  */
static void adc_mm_set_state_inst_inj(hal_adc_handle_t *hadc,
                                      hal_adc_common_state_t common_state,
                                      hal_adc_state_t instance_state,
                                      hal_adc_group_state_t group_state)
{
  hal_adc_handle_t *p_handle_current = hadc;
  uint32_t index;

  /* Parse multimode instances through links of daisy chain (starting from ADC master) */
  for (index = 0; index < ADC_MM_INST_COUNT; index++)
  {
    p_handle_current->common_state = common_state;
    p_handle_current->global_state = instance_state;
    p_handle_current->group_state[ADC_GROUP_INJECTED] = group_state;

    p_handle_current = p_handle_current->p_link_next_handle;
  }
}

/**
  * @brief  For all HAL ADC handles part of multimode, check and set handles state: group.
  * @param  hadc Pointer to a hal_adc_handle_t structure. Must be the handle of ADC master.
  * @param  group_index  handle state "group_state[]" index (ADC_GROUP_REGULAR, ADC_GROUP_INJECTED)
  * @param  group_state_conditional  State to be checked to authorize moving to the new state.
  * @param  group_state_new          New state to be set.
  * @retval HAL_BUSY          HAL ADC state machine not in expected initial state
  * @retval HAL_OK            ADC instance has been correctly configured.
  */
static hal_status_t adc_mm_check_set_state_group(hal_adc_handle_t *hadc,
                                                 uint8_t group_index,
                                                 hal_adc_group_state_t group_state_conditional,
                                                 hal_adc_group_state_t group_state_new)
{
  hal_adc_handle_t *p_handle_current = hadc;
  uint32_t index;
#if defined(USE_HAL_CHECK_PROCESS_STATE) && (USE_HAL_CHECK_PROCESS_STATE == 0)
  hal_status_t status = HAL_OK;
  STM32_UNUSED(group_state_conditional);
#else
  hal_status_t status;
#endif /* USE_HAL_CHECK_PROCESS_STATE == 0 */

  /* Parse multimode instances through links of daisy chain (starting from ADC master) */
  for (index = 0; index < ADC_MM_INST_COUNT; index++)
  {
    HAL_CHECK_UPDATE_STATE(p_handle_current, group_state[group_index],
                           group_state_conditional,
                           group_state_new);

    p_handle_current = p_handle_current->p_link_next_handle;
  }

#if defined(USE_HAL_CHECK_PROCESS_STATE) && (USE_HAL_CHECK_PROCESS_STATE == 0)
  /* No action */
#else
  status = HAL_OK; /* Value update if no early return by HAL_CHECK_UPDATE_STATE() */
#endif /* USE_HAL_CHECK_PROCESS_STATE == 0 */

  return status;
}
#endif /* ADC_MULTIMODE_SUPPORT */

/**
  * @}
  */

/**
  * @}
  */

#endif /* USE_HAL_ADC_MODULE */
#endif /* ADC1 || ADC2 || ADC3 */
/**
  * @}
  */
